{
  "document_id": "developer-guide.18",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T08:07:11",
  "extracted_text": "# Push Mechanism webhook\n\n## Getting Started - Push Mechanism webhook\n\n**Note:** Push webhook is supported only in Shopee Console as opposed to what's commonly known as webhooks.\n\nHere's an overview of how Push Mechanism works on Shopee Open Platform:\n1. Your shop creates a webhook URL on your App and input it into the callback URL.\n2. Upon events (order update, product update, etc), Shopee will send a request to your callback URL.\n3. Shopee sends an HTTP POST request to the defined callback URL.\n4. Your server acknowledges and provides a successful HTTP response.\n\n⚠️ **Note:** Push Mechanism webhooks on Shopee Open Platform only notifies you that data for the specific event has changed. In order to retrieve the product data, you will still need to call the API to retrieve the changed data.\n\n## Understanding Push Mechanism notifications\n\nThere are 5 categories of webhooks (Push) available on Shopee Open Platform:\n1. Shopee - Webhooks for shop authorization and payment dispute updates\n2. Order - Webhooks for order updates\n3. Marketing - Webhooks for tracking product- promotional activities\n4. Product - Webhooks for product information, inventory, and brand registration process updates\n5. Chat - Webhooks for new buyer messages\n\nRead more about these Push notifications below, ordered by popularity.\n\n## Shopee Push\n\n### Shop Authorization (Code: 1)\nGet notified when the authorization list of shop and merchant IDs when the seller authorizes your App to access their shop(s) data.\n\n### Shop Deauthorization (Code: 2)\nGet notified with the application list of shop and merchant IDs when the seller revokes their authorization for your App to access their data.\n\n⚠️ **Notes:**\n- Before other Shopee authorizations via your App or Seller Center\n- Authorization deauthorization is performed via shop, deducing the appropriate list of shop and merchant IDs. For Partner who has shops that have authorized the same merchant, you will be notified on the main account. Without shop_id returned, IDs cannot be determined, and thus address only returns the main account ID.\n\n### Banned Shop / Merchant (Code: 13)\nGet notified if shop is detected with a list of shop and merchant IDs with ongoing authorizations. You will then contact the sellers affected by the event via email. You will help prevent disruptions in your service caused by having no foreknowledge of the account status.\n\nℹ️ **Note:** The seller's authorization to your App or Access their shop(s) data is only valid for 1 year. After the authorization period expires, the seller would be required to reauthorize.\n\n- Shopee Updates (Code: 5)\nGet notified on any Shopee platform updates promptly.\n\n## Order Push\n\n### Order Status (Code: 3)\nGet notified immediately on all order status updates. This includes order cancellations that occur before shipping, so to help you take action promptly.\n\n### Order Tracking Number Update (Code: 4)\nGet notified immediately when order tracking numbers are updated so that you can help promptly, and avoid having to fetch real-time status by polling the Get Tracking Number API repeatedly.\n\nℹ️ **Note:** All the tracking numbers partners who serve first- or update tracking numbers who may be required on shipping documents.\n\n### Shipping Document Status Update (Code: 8)\nGet notified immediately when shipping document status is \"READY\" or \"FAILED\" so that you don't need to call the Get Shipping Document Status API repeatedly, and to avoid delays in collecting the shipping documents.\n\n## Marketing Push\n\n### Item Promotion (Code: 7)\nGet notified as soon as your Item or a SKU is affected by participation in campaigns or promotional events. You'll also be asked to check the reason for the failed status. This way, you can add products to the campaign ahead of the product or sku being updated (e.g. if the product was discontinued).\n\n### Bundle Deal (Code: 12)\nGet notified as soon as your Bundle Deal update products are added to/removed from the promotional event or when there is an update to the promoter's start/end time.\n\n## Product Push\n\n### Product Status Event (Code: 6)\nGet notified as soon as your Products listing data is used for auto-enforcement event. Nothing sellers to integrate changes to their inventory.\n\n### Brand Registration (Code: 11)\nℹ️ **Note:** Reserved product data and events that materiel specially for a governmental and authorized sellers to help the brand do business on Shopee. Enable the event once partners have been authorized, and or update product listings that include a video as you can only do so with a successfully transacted video files.\n\nGet notified-these sales as of right sales, partners who have uploaded an approved video content. After the video is also a Video Url that guides you through successfully. If the transcoding is successful, you can continue to add or update product listings with the video_url attribute.\n\n### Rejected Item (Code: 9)\nGet product updates on rejection reasons by Shopee to find out the violation reason.\n\n### Brand Complaint (Code: 10)\nGet updates on the results of brand registration applications, including approved, rejected, or merged with an existing brand.\n\nℹ️ **Note:** Sellers can either register their brand of via the **IP related problem report** API or via Seller Center for Shopees review. After review completion, there will be a notification on the result.\n\n## Chat Push\n\n### Merchant Chat (Code: 14) - Chat webhook notification\nGet notified immediately when the shopper sends message from buyers.\n\n## Subscribing to Push Mechanism\n\nℹ️ **Note:** Before Shopee Open Platform console can access the Push Mechanism page. Select the relevant App > select Set Push Configuration.\n\n### Push Mechanism\n\n[Table showing Push Mechanism settings with columns:]\n- Push Mechanism | Shop Part | Line Part | Link Push Part Status | Push Back Configuration | Test\n\n[Rows include settings for various push types like Shop Authorization, Shop Push, Product Push, etc., with toggle switches indicated by arrows]\n\n⚠️ **Note:** To verify the validity of your defined callback URL, Shopee will send an HTTP POST request to the callback URL when you define or update the callback URL. Make sure your service can respond to GET or POST page.\n\n⚠️ Upon successful verification of your callback URL, select the relevant Push webhook(s) that you want to receive notifications on.\n\n### Test Push Settings\n\n[Table showing test configuration options with columns:]\n- Event Type | Push Mechanism | Push Event | Test Code | [toggle indicators]\n\n[Multiple rows listing different push types like Shop Authorization, Shop Push, Product Push, Order Push, etc. with their respective codes and status indicators]\n\n⚠️ **Note:** You can manage the settings for Push via Shopee Open Platform console or via the **Push config** API.\n\nThe availability of Push notifications (webhooks) depends on your App type, refer to the table below for details:\n\n### App Type - Available Notifications\n\n**Original:**\n- All Push notifications except Buyer-Shopee Result Push (Code: 13)\n\n**ERP System:**\n- All Push notifications except Webhook Push (Code: 10)\n\n**Seller to Shopee System:**\n- All Push Notifications\n\n**Product Management:**\n- Shopee Push\n  - Shop Authorization Event (Code: 1)\n  - Shop Deauthorization Event (Code: 2)\n  - Banned Shop / Merchant Event (Code: 13)\n  - Shopee Updates (Code: 5)\n\n---\n\n# Developer API Documentation\n\n## Module Access Levels\n\n### Affiliate\n- **Available Push Notifications:** All Push notifications except Shopper Sneak Peek (Code 10)\n\n### ERP System\n- **Available Push Notifications:** All Push notifications except Webhook Push (Code 10)\n\n### Seller-In-House System\n- **Available Push Notifications:** All Push notifications\n\n---\n\n## Protocol Management\n\n### Shopper Push\n- Shop Authorization Push (Code 1)\n- Shop Authorization Complete Push (Code 2)\n- Shop Authorization Cancel/Expiry Push (Code 12)\n- Shopper Updates (Code 5)\n\n### Product Push\n- Item Purchase Into Push (Code 6)\n- Video Upload Push (Code 11)\n- Review Upload Push (Code 9)\n\n### Settlement Push\n- Item Purchase Into Push (Code 7)\n- Premium Upload Push (Code 8)\n\n---\n\n## Order Management\n\n### Shopper Push\n- Shop Authorization Push (Code 1)\n- Shop Authorization Complete Push (Code 2)\n- Open API Authorization Expiry Push (Code 12)\n- Shopper Updates (Code 5)\n\n### Order Push\n- Order Status Push (Code 3)\n- Order Status Change Push (Code 4)\n- Shop Authorization Complete Push (Code 16)\n\n---\n\n## Accounting and Finance\n\n### Shopper Push\n- Shop Authorization Push (Code 1)\n- Shop Authorization Complete Push (Code 2)\n- Open API Authorization Expiry Push (Code 12)\n\n---\n\n## Marketing\n\n### Shopper Push\n- Shop Authorization Push (Code 1)\n- Shop Authorization Complete Push (Code 2)\n- Open API Authorization Expiry Push (Code 12)\n\n### Order Push\n- Order Status Change Push (Code 4)\n- Reserved Stock Change Push (Code 6)\n\n### Settlement Push\n- Settlement Complete Push (Code 14)\n- Bulk Promotion Into Push (Code 7)\n- Premium Upload Push (Code 8)\n\n---\n\n## Customer Service\n\n### Shopper Push\n- Shop Authorization Push (Code 1)\n- Shop Authorization Complete Push (Code 2)\n- Shop Authorization Cancel/Expiry Push (Code 12)\n- Shopper Updates (Code 5)\n\n### Order Push\n- Order Status Push (Code 15)\n\n---\n\n## Important Notes\n\n⚠️ **Caution:** For developers with systems that use direct access via whitelisted IP addresses, use the production environment IP [link].\n\n⚠️ **Warning:** Do not use the sandbox environment for production or business purposes.\n\n⚠️ If you're testing, make an API call within the sandbox environment.\n\n⚠️ **Production:** Only use the production environment for official business services or the production environment.\n\n---\n\n## Push Authorization\n\nTo prevent CyberAttacks, we have provided an authorization signature for each Push request, which can be issued in the Authorization field of the HTTP request/webhook. With this, you can directly Shopper's authorization information.\n\nThe authorization signature is generated by using base64(HMAC-SHA256($secret_key, $base_string)) method.\n\nTo generate the authorization signature, ensuring that it matches the authorization signature generated from the Push request. Here's how you can generate the signature string:\n\n### Step 1: Use URL + response content as the signature base string\n\nExample:\n```\nhttp://www.url.com/receive?shop_id=shop_id&authorization_t_user=shop_id.123 is authorized base64string : date : shop_URL : host data : timestamp : HYT43BjSE\n```\n\nNote that the path base/response content method is not recommended.\n\n### Step 2: Instance base string and partner key from your App details on Shopper Open Platform Console\n\n### Step 3: Use the signature base string and partner key to generate the signature with the HMAC-SHA256 hashing algorithm\n\nThe output of the HMAC signature function is a binary string. This requires you encoding to generate the signature string in base64. See sample code below:\n\n**Python:**\n\n```python\nimport hmac\nimport hashlib\nimport base64\n\ndef calculate_signature(secret_key, base_string, authorization):\n    hmac_obj = hmac.new(secret_key.encode(), base_string.encode(), hashlib.sha256)\n    return base64.b64encode(hmac_obj.digest()).decode()\n\n# Test\nprint(calculate_signature(\"secretpartner\", \"requestBody\", \"base64string\", \"authorization\"))\n\npackage_verify\n```\n\n**Java:**\n\n```java\nimport javax.crypto.Mac;\nimport javax.crypto.spec.SecretKeySpec;\nimport java.nio.charset.StandardCharsets;\nimport java.util.Base64;\n\npublic class HmacExample {\n    public static String calculateSignature(String secretKey, String baseString) throws Exception {\n        Mac hmacSHA256 = Mac.getInstance(\"HmacSHA256\");\n        SecretKeySpec secretKeySpec = new SecretKeySpec(secretKey.getBytes(StandardCharsets.UTF_8), \"HmacSHA256\");\n        hmacSHA256.init(secretKeySpec);\n        byte[] hash = hmacSHA256.doFinal(baseString.getBytes(StandardCharsets.UTF_8));\n        return Base64.getEncoder().encodeToString(hash);\n    }\n\n    // Test method\n    public static void main(String[] args) {\n        try {\n            String result = calculateSignature(\"secretpartner\", \"requestBody\");\n            System.out.println(result);\n        } catch (Exception e) {\n            e.printStackTrace();\n        }\n    }\n}\n```\n\n**Node.js:**\n\n```javascript\nconst crypto = require('crypto');\n\nfunction calculateSignature(secretKey, baseString) {\n    const hmac = crypto.createHmac('sha256', secretKey);\n    hmac.update(baseString);\n    return hmac.digest('base64');\n}\n\n// Test\nconsole.log(calculateSignature(\"secretpartner\", \"requestBody\"));\n```\n\n**PHP:**\n\n```php\nfunction calculateSignature($secretKey, $baseString) {\n    $hmac = hash_hmac('sha256', $baseString, $secretKey, true);\n    return base64_encode($hmac);\n}\n\n// Test\necho calculateSignature(\"secretpartner\", \"requestBody\");\n```\n\n---\n\n# Triggering Push Mechanism notifications\n\nNote that after subscribing to Push Mechanism notifications, and generating the authorization signature, you also have to ensure that the App Partner ID set for each Push notification is already authorized by the shop(s). If not, do complete **shop authorization** first.\n\nIf shop authorization is complete, you will be notified via Push Mechanism when the relevant events occur. Learn more about **events that may trigger a Push Mechanism notification**. Do note to ensure that your callback URL provide a response to our requests.\n\n## Blocking notifications from specific shops\n\nIf you don't want to receive notifications for certain shops, you can do so with these methods:\n\n1. Use the blocked_shop_id field of the v2 **push set_push_config** API (Block up to 500 shops)\n2. Fill in the list of Shop IDs on the **Push Mechanism** page on Shopee Open Platform Console. (Block up to 500 shops)\n\n---\n\n# Push Mechanism Retry Logic\n\nTo avoid receiving repeated notifications from Push Mechanism, set up your callback URL to respond according to these HTTP response requirements:\n\n- Includes a status code of 2xx\n- Includes an empty body\n\n⚠️ **Note: All Pushes (webhooks) support a different maximum number of notifications and intervals for any repeated notifications. See the next section Push Mechanism Warning/Disable Logic for Apps that have a poor success rate for responding to notifications.**\n\nView the **Push Mechanism documentation** for specific details.\n\n---\n\n# Push Mechanism Warning/Disable Logic\n\nShopee Open Platform has a warning/disable logic in place for Apps that have a poor success rate for responding to Push Mechanism notifications. For such Apps, we will take action accordingly. Warning emails will be sent to you or we may also eventually disable your subscription to Push Mechanism notifications.\n\n⚠️ **Note: Success rate is calculated by comparing successful Push items versus failed Push items. A failed Push is defined as Shopee Open Platform not receiving an HTTP response with a status code of 2xx and an empty body within the timeout period.**\n\nView the **Push Mechanism documentation** for specific details.\n\nHere are the details for Push Mechanism warning and disabling actions:\n\n## Warning emails\n\n- You will receive a warning email every 30 minutes if:\n  - There have been more than 600 Push Mechanism notifications sent to you in the past 6 hours AND\n  - Your overall Push success rate is less than 70%.\n- Warning emails will not be sent once your success rate returns to more than 70%.\n\n## Disabling of subscription to Push Mechanism notifications\n\n- Your subscription to Push Mechanism notifications will be disabled and you will receive a notification email if:\n  - There have been more than 600 Push Mechanism notifications sent to you in the past 6 hours AND\n  - Your overall Push success rate is less than 30%.\n- You should check your callback URL and ensure that you're ready to receive Push Mechanism notifications normally before subscribing again.\n\n---\n\n## ⚠️ Notes\n\nAfter subscribing again, here are some important points to note:\n\n- **You will not receive Push Mechanism notifications missed during the period where your subscription was disabled.**\n- **Success rate calculation of Push Mechanism notifications will be restarted based on records from your new subscription.**\n\nYou can view the current Push Mechanism success rate and status through the Shopee Open Platform Console page.\n\n---\n\n## Code Example\n\n```java\nthrows NoSuchAlgorithmException, UnsupportedEncodingException, java.security.InvalidKeyException\n{\n    String baseStr = url + \"|\" + requestBody;\n    \n    Mac sha256_HMAC = Mac.getInstance(\"HmacSHA256\");\n    \n    SecretKeySpec secret_key = new SecretKeySpec(partnerKey.getBytes(\"UTF-8\"), \"HmacSHA256\");\n    \n    sha256_HMAC.init(secret_key);\n    \n    String result = Hex.encodeHexString(sha256_HMAC.doFinal(baseStr.getBytes(\"UTF-8\")));\n    \n    return result.equals(authorization);\n}\n```",
  "metadata": {
    "title": "Push Mechanism webhook",
    "summary": "This guide provides an overview of the Push Mechanism webhook on the Shopee Open Platform. It details how to subscribe to push notifications for various events such as order updates, product updates, and shop authorization changes, enabling real-time updates and efficient data retrieval.",
    "keywords": [
      "webhook",
      "push notifications",
      "Shopee Open Platform",
      "API",
      "real-time updates",
      "event notifications",
      "callback URL",
      "shop authorization",
      "order updates",
      "product updates"
    ],
    "category": "Integration",
    "tags": [
      "webhooks",
      "push mechanism",
      "shopee",
      "api",
      "notifications"
    ],
    "difficulty": "medium",
    "importance": 5,
    "use_cases": [
      "Receiving real-time order status updates to trigger fulfillment processes.",
      "Monitoring product updates to keep inventory synchronized.",
      "Tracking shop authorization changes to manage access permissions.",
      "Being notified of promotional event updates to adjust marketing strategies.",
      "Handling new buyer messages promptly to improve customer service."
    ],
    "related_apis": [
      "Get Tracking Number API",
      "Get Shipping Document Status API",
      "Push config API",
      "IP related problem report API"
    ]
  }
}