{
  "document_id": "developer-guide.261",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T08:57:00",
  "extracted_text": "# API Best Practices - SIP best practices\n\n**delivery time approximately 2 weeks**\n\n---\n\n## Terminology\n\n- **Primary shop**: In the SIP (open operation mode, the shop (temporarily) operated by the seller is also called the primary shop.\n- **Local SIP**: If local sellers operated the primary shop, we call those SIP mode.\n- **CNSC SIP**: If CNSC sellers operated the SIP shop (apartment) also refers to the assistant who will be the seller (or the affiliated merchant) and set up SIP Shop. In fact, the SIP Shop (local mode) here and the local SIP mode are essentially the same in terms of entity, and there are no obvious boundaries, except that the seller and the seller-operated shops are placed on the root SIP and SIP apartment user.\n- **SIP shop product**: refers to the goods sold by the SIP shop, and the shop product within the shop based on the last year end the product and the SIP price (apartment) user. For non-SIP mode, the cost price of the product and the last year-end the bargain price of the base is the cost price of the shop product.\n\n**Note:** To prevent consumer confusion, whether dealing with shop products or CNSC products, the display of shop products will always remain on the same status as the product.\n\n---\n\n## 1.SIP Shop Authorization\n\n### 1.1 non CNSC Seller\n\n#### 1.1.1 Authorization process\n\nWhen you successfully create a local SIP shop, you will automatically become a seller and obtain shop authentication. When the seller enters the SIP Shop account, you need to wait for the CNSC official to review. After the review is passed, you will receive the SIP authorization page and clicks to confirm the authorization. SIP If Shop will be authorized this API.\n\n### Authorization\n\n**Local**\n\n[Authorization flow diagram showing numbered steps 1-4]\n\n**Login**\nSeller CNSC account or System Store\n\nApply for authorization to get the following information:\n- **Product**: Authorization of product and content management for products period\n- **Payment**: Information of transactions and refunds to your shop account\n- **Marketing**: Information related to discounts in your shops\n- **Logistics**: Information related to order logistics\n\n[AUTHORIZE button shown in orange]\n\n#### 1.1.2 Getting code\n\nAfter the authorization is successful, you can directly get the shop_id and if shop use the available code through the callback URL.\n\nYou can call `sip_code_exchange_access_API` and upload the shop id and code (API to get the shop access token and refresh token) of IT shop.\n\n#### 1.1.3 Refresh Access Token\n\nAt this time, the access token and refresh token obtained in the front have can be used in IT shop. Then you can call `sip_code_refresh_access_API` and refresh the access token and refresh token of IT shop.\n\n**Things to note**:\n- After the new access_token is generated, the old access_token is still valid within 5 minutes\n- If the new refresh_token is generated at the same time, the old refresh_token will become invalid immediately. It must be saved immediately after the new refresh_token is generated, and be used later to refresh.\n- If the new refresh_token and access_token renewed are lost, please check FAQ.\n\n---\n\n### 1.2 CNSC Seller\n\n#### 1.2.1 Authorization process\n\nPlease refer to single \"Authorization and Authentication\" When the seller logs in to the main account and enters the authorization page, they can see all the primary SIP shops they have created, and they can also add \"Local\" (when the SIP IT Shop not click \"Confirm Authorization Status, Check the SIP IT Shop and click \"Confirm\" Authorization Status. When the SIP IT Shop is under the IT shop system that IT shop). After authorization, the access token and refresh token of SIP IT shop will be automatically generated.\n\n[Screenshot showing shop authorization interface with:\n- Goshh Seller\n- Authorized Shops List\n- Affiliate Shop List (ID)\n- Shop information fields including:\n  - Name (shop name, display name, promotions, show details must fill)\n  - Shop Postcode\n  - Shop Address\n  - Shop Telephone\n  - Description\n  - Contacts (candAllo2)\n  - LegalAddress\n  - SortOrder\n  - And various shop IDs and status indicators]\n\n**Note**: At this time, the account bound to a merchant is a main account (let be bound under the \"Unregistered Shop Group\" list. It does in the [Unregistered Shop Group] module, it will show all the shops that merchants have). This status will be marked under it.\n\n[Additional interface screenshots showing:\n- Unassigned007 shop\n- Unregistered Shop Group - Suspended\n- Multiple shop entries with status indicators\n- Audit Managed and Reset at SPS markers]\n\n#### 1.2.2 Getting code\n\nAfter the authorization is successful, you can directly get the main_account_id and the available code through the callback URL.\n\n#### 1.2.3 Getting token\n\nYou can call `sip_code_cnsc_exchange_access_API` and upload the main_account_id and code (API to get the currently authorized merchants, and the sicp_id_list will return all the currently authorized merchants).\n\n**Note**: The main_account_id of the currently authorized merchant account access token refresh_token of IT shop.\n\n#### 1.2.4 Getting shop relationship\n\nAfter you get the main_account_id and the sicp_id_list by the mentioned API, to get the list of authorized shops associated with this merchant, and set up `sip_cnsc_list_cnsc_shop_API`. Then you will get information like 1)(Under the shop belongs to merchant list. HTML's shop list is under this shop list, and the sicp_id_list should be in that list) of authorized shops associated with each list.\n\n**Note**:\n- If it is an normal shop, (i.e., non-does not the sip_id), shops level will not be returned.\n- If it is a SIP shop managed by CNSC (that is, the sip_id), shops level will be returned and ask for the sicp_value.\n- If it is a SIP shop managed by merchant (that is, the sip_id), shops level will be returned but the sicp_value will be null.\n\n#### 1.2.5 Refresh Access Token\n\nPlease refer to `sip_code_refresh_access_API` to refresh the access token and refresh token of each sicp_id when it about to expired. When you call `sip_code_refresh_access_API`, please refresh the access token and refresh token of each sicp_id (of each merchant) one by one.\n\n---\n\n## 2. Product Management\n\n### 2.1 Product information logic\n\n**Info**\n\n**Sync logic**\n\n**Item types info (item)**\n- Creator: After the seller creates a IT shop product, Shopee will automatically transcode\n\n---\n\n*[End of visible content]*\n\n---\n\n# 2. Product Management\n\n## 2.1 Product information logic\n\n### Info\n\n**Sync logic**\n\n**Item base info (Item base + category)**\n- **Create**: After the seller creates a P-Help product, Shoppe will automatically translate the product information to the target shop language via P-Help API.\n- **Update**: If the seller modifies the P-Help product, Shoppe will automatically synchronize the modifications to the target shop.\n\n**Item status**\n- If the P-Help product is unlisted or deleted, the A shop product will also be unlisted or deleted.\n\n**Item stock**\n- The product stock of P-Help is equal to the product stock of A shop. For example, there are 2 A shops under the seller, each add 4 of buyer, and the stock of P-Help (P-Shop) will be reduced by 8. If the seller wants to modify the stock, they can only modify the P-Help product stock in A shop.\n\n**Item price**\n- When the seller updates the product price of P-shop, Shoppe will synchronize it to the product price in A shop.\n\n---\n\n## 2.2 Price logic\n\nPlease note that all APIs using `sa_currency` and `sa_product_per_service` API Response: `currency: \"MYR\"`, `buyer_shipping_fee: \"119.90\"`, `original_price: \"129.90\"`, `tag_discounted_price: \"119.90\"`.\n\n**Note**: If the item is a P shop item and there are currently subsidiaries, please call the `sa_product_per_service_API` to get the sa_currency, item_price, currency of each.\n\n- If the item is a P shop item, please call the `sa_product_per_service_API` to get the sa_currency, item_price, currency of each subsidiary store.\n- If the item is a sub \"B\" shop item but not `sa_get_pricing_item_price` separately, item_price_currency fields will not return in v2 API response.\n\n---\n\n## 3. Order management\n\n### 3.1 Order synchronization logic\n\n#### Steps\n\nPlease follow the SIP P shop order list and the SIP A shop order list respectively for fulfillment or cancellation. Please check seller cancellation list to the item cannot of the seller is no SIP A shop under synchronization rules or the seller want to cancel the order, or when the buyer order times out.\n\n#### 3.1.1 2 Local SIP\n\nShoppe automatically synchronizes the SIP A shop order to the SIP P shop, so you only need to obtain and fulfill the SIP P shop order list. The seller only needs to operate in the SIP P shop. Shoppe will automatically synchronize it to the SIP A shop. Examples include a Local SG Shopper buys/receives warehouses from Seller P-Shop Singapore to Local SG Shopper buys/receives from Seller A-Shop Singapore.\n\n**Note A**\n\nFor the same order merchandise, The orders of P shops and A shops will be pushed at the same time. If no SIP sellers, the order will only be pushed to the p shop. So sellers only need to pay attention to the P shop orders, they only need to pay attention to the p shop orders when the seller order list.\n\n**Note B**\n\nFor more order fulfillment procedures, please refer to: https://open.shopee.com/documents/v2/v2.order.get_order_list\n\n---\n\n## 4. Order income\n\n1. `sa_payment_list_income_API` will return the order amount of A shop currency and the corresponding P shop currency at the same time.\n\nPlease focus on the parameters of `sa_payment_list_income_detail` API as below:\n\n- `int_escrow_amount` represent the A shop order, so it is A shop currency.\n- `int_self` will return this parameter.\n- `int_self` don't return this parameter.\n\n### Fields\n\n| Field | SIP P shop order |\n|-------|-----------------|\n| escrow_amount | ✓ |\n| escrow_amount/final_currency: This field shows the final_currency/local_currency. If the seller_rebate, tax_code, buyer_tax, commission, total_released, total_escrow_amount, seller_voucher, buyer_service, int_buyer_service, commission, tax_fee_payable, pay, sub_affiliate, int_sub_affiliate, original_escrow_amount_coin, original_escrow_amount_from_shipping_fee/local_x | ✓ |\n| buyer_total_amount | ✓ |\n| actual_shipping_fee | ✓ |\n| buyer_paid_shipping_fee | ✓ |\n| buyer_transaction_fee | ✓ |\n| estimated_shipping_fee | ✓ |\n| cod/agent_fee | ✓ |\n| credit | ✓ |\n| coins_transfer_tax | ✓ |\n| escrow_tax | ✓ |\n| final_product_protection | ✓ |\n| final_product_int_tax | ✓ |\n| final_shipping_fee | ✓ |\n| final_shipping_int_tax | ✓ |\n| seller_transaction_fee | ✓ |\n| seller_rebate/seller_weight | ✓ |\n| original_cost_of_goods_sold | ✓ |\n| original_shopee_discount | ✓ |\n| payment_promotion | ✓ |\n| reverse_shipping_fee | ✓ |\n| rtr_seller_protection_fee_basic_amount | ✓ |\n| rtr_seller_protection_fee_premium_amount | ✓ |\n| seller_coin_cash_back | ✓ |\n| seller_discount | ✓ |\n| seller_lost_compensation | ✓ |\n| seller_shipping_discount | ✓ |\n| seller_transaction_fee | ✓ |\n| shopping_fee_discount_e/from_ipi | ✓ |\n| shopee_service_fee | ✓ |\n| shopee_shipping_rebate | ✓ |\n| voucher_from_seller | ✓ |\n| voucher_from_shopee | ✓ |\n| int_of_currency | ✓ |\n| commission_fee_int | ✓ |\n| prv_allowable_refund_prt | ✓ |\n\n---\n\n# 5. API permission\n\nCurrently, SIP A shop can only call some APIs. please check the detailed list.\n\n---\n\n## Available Fields\n\n| Field | Status |\n|-------|--------|\n| voucher_from_seller | ✓ |\n| voucher_from_shopee | ✓ |\n| aff_currency | × |\n| commission_fee_pri | × |\n| drc_adjustable_refund_pri | × |\n| escrow_amount_pri | × |\n| original_price_pri | × |\n| refund_amount_to_buyer_pri | × |\n| seller_return_refund_pri | × |\n| service_fee_pri | × |\n| sip_subsidy_pri | × |\n| pri_currency | × |\n| sip_subsidy | × |\n\n**Legend:**\n- ✓ = Available/Permitted\n- × = Not available/Not permitted",
  "metadata": {
    "title": "API Best Practices - SIP best practices",
    "summary": "This guide outlines the best practices for using the SIP (Shop in Place) API, covering authorization, product management, and price logic. It details the authorization process for both non-CNSC and CNSC sellers, along with instructions for obtaining tokens and managing shop relationships.",
    "keywords": [
      "SIP",
      "API",
      "Authorization",
      "Product Management",
      "CNSC",
      "Access Token",
      "Refresh Token",
      "Shop Relationship",
      "Price Logic"
    ],
    "category": "Best Practices",
    "tags": [
      "SIP API",
      "Shop in Place",
      "Seller Authorization",
      "Product Sync",
      "Token Management"
    ],
    "difficulty": "medium",
    "importance": "4",
    "use_cases": [
      "Authorizing a SIP shop for a seller.",
      "Managing product information across different shops.",
      "Synchronizing product prices between P-shop and A-shop.",
      "Refreshing access tokens for SIP API access."
    ],
    "related_apis": [
      "sip_code_exchange_access_API",
      "sip_code_refresh_access_API",
      "sip_code_cnsc_exchange_access_API",
      "sip_cnsc_list_cnsc_shop_API",
      "sa_currency",
      "sa_product_per_service_API"
    ]
  }
}