{
  "document_id": "developer-guide.568",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T09:24:52",
  "extracted_text": "# Fulfilled by Shopee (BR) - API Best Practices\n\n## Navigation\n- API Best Practices > Brazil Open API Best Prac... > Fulfilled by Shopee (BR)\n\n## Table of Contents\n- Identification of orders under \"Fulfilled by Shopee\"\n- Workflow changes for \"Fulfilled by Shopee\" orders\n- Submission of Tax Data\n- FAQ\n\n---\n\n## Workflows through Seller Center\n\n1. **Registration**: The onboarding process for \"Fulfilled by Sahopee\" starts with granting sellers access to the new functionality. Sellers need to fill out certain information, which is sent for review by the Shopee team.\n\n2. **Product Nomination**: Once approved, sellers can nominate items for \"Fulfilled by Shopee.\" After further approval, these items can be scheduled for delivery to Shopee.\n\n   **Important**: In this process, all tax-related data for the items must be completed; otherwise, the items will not be approved.\n\n3. **Delivery to Shopee**: Schedule the delivery of nominated items to Shopee.\n\n4. **Inventory**: Monitor the inflow and outflow of items in Shopee warehouses.\n\n5. **Sales Tracking**: Track sales from \"Fulfilled by Shopee.\"\n\n6. **Warehouse Withdrawal**: Indicate which products should be removed from Shopee's warehouse.\n\n7. **Download Reports**: Monitor and download financial reports and documents generated by \"Fulfilled by Shopee.\"\n\n---\n\n## Workflows via OpenAPI\n\n### 1 - Identification of Active Sellers for \"Fulfilled by Shopee\"\n\nWhen a seller is active in Fulfilled by Shopee, the API v2 `shop.get_shop_info` will return the parameter `shop_fulfillment_flag` with the value \"PFF - FBS Shopee.\"\n\n### 2 - Inventory and Warehouse Management for \"Fulfilled by Shopee\"\n\nOnce the seller's products arrive at Shopee, the parameter `shopee_stock` will appear in the API v2 `product.get_item_base_info`. This includes:\n\n- **location_id**: Reference to the warehouse location\n- **stock**: Quantity of stock available\n- **if_saleable**: Indicates if the warehouse stock is ready for sale. For example:\n\n```json\n{\n  \"shopee_stock\": {\n    \"location_id\": 12345,\n    \"stock\": 100,\n    \"if_saleable\": true\n  }\n}\n```\n\n**Important**: The shopee_stock parameter is for query purposes only and cannot be modified via API.\n\n### 3 - Identification of Orders under \"Fulfilled by Shopee\"\n\nOrders associated with Fulfilled by Shopee can be identified by the `fulfillment_flag` parameter in the response `optional_fields` of the API v2 `order.get_order_detail`. Possible values include:\n\n- **fulfilled_by_local_seller**: The standard order process continues.\n- **fulfilled_by_shopee**: Shopee handles invoices, stock control, and logistics entirely.\n\nAdditionally, a new filtering option has been added to the API v2 `order.get_order_list` using the `logistic_channel_id` parameter. For Fulfilled by Shopee, the `logistic_id` is 91007.\n\n---\n\n## Workflow Changes for \"Fulfilled by Shopee\" Orders\n\n1. All invoices and documents for \"Fulfilled by Shopee\" orders will be issued by Shopee and can be downloaded from Seller Center.\n\n2. Shopee will automatically handle shipping arrangements, label generation, and the entire logistics process without seller involvement.\n\n3. ERPs/HUB systems must identify orders under Fulfilled by Shopee to avoid deducting inventory from the seller's incorrect stock.\n\n---\n\n## Uploading of Tax Data via OpenAPI\n\nTax data is not mandatory for all items, and the creation of items via OpenAPI is not blocked due to the absence of tax data. However, since the \"Fulfilled by Shopee\" process relies on Seller Center, items without tax data cannot be nominated. To support sellers, ERPs/HUBs are encouraged to integrate automatic tax data submission to Shopee, even for items not yet added to Fulfilled by Shopee. This will streamline the nomination process, avoiding the need for manual input via Seller Center.\n\nTax data can be submitted through the API v2 `product.add_item` using the `tax_info` parameter.\n\n---\n\n## FAQ\n\n### Can documents and invoices be downloaded via OpenAPI for Fulfilled by Shopee?\n\n**A**: No, currently, invoices and documents can only be downloaded via Seller Center.\n\n---\n\nFor further questions, please contact us through the **Ticket Platform**.",
  "metadata": {
    "title": "Fulfilled by Shopee (BR) - API Best Practices",
    "summary": "This guide outlines the best practices for using the Fulfilled by Shopee (FBS) program in Brazil, focusing on API integrations. It covers workflows, inventory management, order identification, and tax data submission, providing essential information for developers integrating with Shopee's FBS program.",
    "keywords": [
      "Fulfilled by Shopee",
      "FBS",
      "API",
      "Brazil",
      "Inventory Management",
      "Order Management",
      "Tax Data",
      "Seller Center",
      "Workflow"
    ],
    "category": "Best Practices",
    "tags": [
      "Shopee",
      "Brazil",
      "API Integration",
      "Fulfillment",
      "eCommerce"
    ],
    "difficulty": "medium",
    "importance": 4,
    "use_cases": [
      "Integrating ERP systems with Shopee's FBS program.",
      "Automating inventory management for FBS sellers.",
      "Identifying FBS orders for accurate processing.",
      "Submitting tax data for products to be fulfilled by Shopee.",
      "Managing warehouse withdrawals via Seller Center"
    ],
    "related_apis": [
      "shop.get_shop_info",
      "product.get_item_base_info",
      "order.get_order_detail",
      "order.get_order_list",
      "product.add_item"
    ]
  }
}