{
  "document_id": "developer-guide.34",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T09:48:48",
  "extracted_text": "# Platform Partner Rules\n\n## Terms of Use - Platform Partner Rules\n\nThese rules are in line with our **Data Protection Policy** and **Terms of Service** which govern all Open Platform developers, ensuring that Shopee continues to be a fair and safe platform for all our partners and users.\n\nYou should familiarize yourself with these 4 key areas of the Platform Partner Rules:\n\n1. Data security\n2. Illegal or inappropriate behavior\n3. API performance and activity\n4. Accuracy of shared information\n\n---\n\n## 4 key areas of the Platform Partner Rules\n\n### Data security\n[Icon: Computer with shield]\n\n### Illegal or inappropriate behavior\n[Icon: Exclamation mark]\n\n### Accuracy of shared information\n[Icon: Document with checkmark]\n\n### API performance and activity\n[Icon: Analytics dashboard]\n\n---\n\nFor third-party partner platforms providing fulfillment services, an additional Third-party Platform Fulfillment Policy applies.\n\nYou can learn more in the detailed sections below, including realistic examples, tips to avoid violations, and the penalties for non-compliance. We also keep track of your fulfillment performance for service quality improvement.\n\n---\n\n## 1. Data security\n\nAs a Shopee Open Platform developer, you have access to the personal and business information of sellers, buyers, or team, or developers using Shopee Open Platform are required to abide strictly by our **Data Protection Policy**.\n\nYou should only access data with the express and informed consent and authorization of the seller or user using your Open Platform.\n\nBelow are a serious taboos against Open Platform developers who are involved in the following actions:\n\n- Using the personal data of sellers or buyers for your own marketing or analytics purposes without the express and informed consent and permission of the seller or buyer\n- Irresponsible collection of user data, including the users not use in the Data Protection Policy\n- Making or keeping a copy of seller or buyer personal or business data on your server, network, network storage account or any other device unless the seller/buyer has authorized you to do so\n- Concealing or failing to report server issues on time and sheltering your platform from regular inspections from Shopee's cyber security\n\n### Tips\n\nWhen accessing our Data Protection Policy, be proactive in minimizing the use of data breaches. Here are some preventive steps to take:\n\n- Carry out regular risk assessments for your data management\n- Regularly scan seller warehouse staff as user log in processes\n- Safeguard platforms, laptops and any other devices from unauthorized or illegal file security management\n- Rectify security vulnerabilities, security risks, security responses, and other related requirements as notified by Shopee on a timely manner\n\nFor more information, read our **Data Protection Policy** in detail.\n\n---\n\n## 2. Illegal or inappropriate behavior\n\nIt is expected that all developers using the Shopee Open Platform uphold fair trading practices. Any behavior that is found to be illegal or inappropriate will not be tolerated.\n\nShopee also takes a serious stance against Open Platform users who are, or are suspected to be, involved or associated with any of the following examples. Any violations will be treated very seriously:\n\n- Performing fraudulent or criminal activity including being convicted of fraud or any activity that is linked to fraud\n- Fulfillment fraud, including actions such as intentional skipping of empty parcels/unordered items to buyers\n- Artificially creating inaccurate or fake tracking statuses as a means to game system functions, i.e. to circumvent Shopee's system for detecting late shipments\n- Abuse of internal API such as reselling internal API to open sellers\n- Issue of local spam by purposely providing Inaccurate logistics order updates, promotional chat messages or any unauthorized material\n- Having a bad reputation in the industry or being known to run a scam with a history of complaints against illegal practices or trading of seller accounts or seller local shops\n- Being up trading or seller accounts or seller local shops after suspension or a competitor's platform, website, or any other illegal or inappropriate websites\n- Sending illegal materials over to the warehouses including fake orders, imitation, followers, and bots\n- Any other seller competition business practices\n\nTo avoid being flagged for illegal or inappropriate behavior, you should always keep to honest trading practices.\n\n---\n\n## 3. Accuracy of shared information\n\nA major concern for Shopee is transparency concerning and it is expected of all Open Platform developers who are doing business with Shopee to share all updates and disclose important or business altering information in advance. Failing to do so is unacceptable and will result in do not tell buyers, providing inaccurate details, and offering services that are different from submitted descriptions.\n\nYou can protect yourself from being affected with these **Terms of Service** before you do business with Shopee Open Platform.\n\n### Tips\n\nTo avoid sharing inaccurate information, check your Open Platform application carefully.\n\nYou should also put your OPP details on the **Open Platform Console App Management page** whenever there are changes in your company name, email address, phone number, address, and other information.\n\n---\n\n## 4. API Performance and Activity\n\nHelping good API Performance and Activity assures that our developers provide high quality services to Shopee users. Open Platform developers should also regularly revise their API call volumes today and meet the necessary margins to a day.\n\nAll developers are expected to meet the following requirements:\n\n- Total Application failure rate of at least 3% will issue a penalty of 14 days which IDs (consecutive days after the medium date removed). The penalty will also be suspended or terminated for 14 days\n- Your Application should have at least 1 API call within a duration of 14 consecutive days after in six-date removed). The penalty may not in any cases, the application should have a six-family week of relief to recover\n- You should regularly call the specific /API endpoint(s) needed to perform your service\n\nShopee reserves the right to sanction Open Platform developers that do not meet the above criteria or fail to provide a good API service.\n\n### Tips\n\nYour Application's success rate is deemed to be consistently low. Shopee will reach out via your registered email. To avoid penalties, ensure that you revise subsequent time frame. If your registered email is no longer in use, please update email details, otherwise your account and those associated with those, if your suggestions email is no longer in use, please email legal@shopee.com at your earliest convenience.\n\n---\n\n## 5. Third-party Platform Fulfillment Policy\n\nThis Policy is in place to ensure that Third-party Partner Platforms that help sellers ship their orders from their own third-party warehouse directly to the buyers\n\nThis policy aims to ensure that Third-party Partner Platforms which provide fulfillment services can help sellers fulfill orders with ease and in good condition.\n\nThe following aspects apply generally to logistics. Third-party Partner Platforms which cannot fulfill the following violations will be deemed to be in violation:\n\n| Area of assessment | Violations |\n|-------------------|-----------|\n| **Non-Fulfillment Rate** | > 3% overall OR in any market of operation |\n| Non-Fulfillment Rate (NFR) is the percentage of orders not of total orders that were shipped late in the past 14 days, shipped to the wrong address, lost in transit, and returns are only counted when the seller or at fault. | |\n| **Late Shipment Rate** | > 3% overall OR in any market of operation |\n| Late Shipment Rate (LSR) is the percentage of orders out of total orders that were arranged late in the past 14 days. The order is considered late if the package is shipped after the shipping deadline shown in a seller's order details. | |\n| **Return Rate** | > 20% overall OR in any market of operation |\n| Return Rate (RR) is the percentage of orders that were returned within the last 60 days. Pre-order items will remain that take a longer time for seller to obtain before ready to ship is not be RR calculation. Buyers' returns due to change of mind are counted. | |\n| **Percentage of orders supported by Shopee Supported Logistics** | < 10% overall OR in any market of operation |\n| Percentage of orders not using Shopee Supported Logistics | |\n\n### Tips\n\n**Check on Announce your next 60-61 LSR** to learn best practices with your vendor partners to avoid fulfillment penalties.\n\n---\n\n# Percentage of pre-order listings\n\nPre-order listings are listings that take a longer time for order preparation where Days to Ship is set to 7 or more consecutive days.\n\n**Threshold:** > 20% overall OR in any market of operation\n\n---\n\n# Percentage of non-integrated orders\n\nNon-integrated orders are orders not fulfilled by Shopee Supported Logistics.\n\n**Threshold:** > 10% overall OR in any market of operation\n\n---\n\n## 💡 Tips\n\nLearn about **improving your NFR and LSR** or share best practices with your retailer partners to avoid fulfillment penalties.\n\nYou should always maintain a **low** percentage of pre-order listings and non-integrated orders to ensure that buyers get their orders promptly.\n\n---\n\n# 7. Penalties\n\nIn the event of a violation, Shopee Open Platform reserves the right to investigate the developer's actions unilaterally, determine the rules that should apply, and take any measures against the application or developer, depending on the severity of the violation.\n\nDetails on the penalties are as follows:\n\n## 1. Warning notice\n- A warning notice via email may be issued to the developer, with a grace period for rectification\n\n## 2. Sensitive data masked when calling sensitive data APIs **(New)**\n- Sensitive data such as the buyer's name, address, and contact will be masked when calling these APIs:\n  - V2.order.get_order_detail\n  - V2.logistics.get_shipping_document_data_info\n  - V2.returns.get_return_detail\n  - V2.order.get_buyer_invoice_info\n\n## 3. API limit reduced **(New)**\n- Daily API limit reduced by a certain percentage determined by Shopee Open Platform\n\n## 4. Suspension of new shop authorizations\n- APP(s) under the penalized developer may be unable to authorize its APP(s) to access new shops/merchants\n- Shops/merchants that have been granted access before the suspension can continue to use the APP before the authorization expires, but re-authorization may be disallowed until the suspension is lifted\n\n## 5. Suspension of APP(s)\n- APP(s) under the penalized developer may be unable to make API calls.\n- All authorized shop access permissions of the APP(s) may also be revoked\n- The penalized developer may be unable to authorize its APP(s) to access new shops/merchants\n\n## 6. Removal of Shopee Open Platform account\n- The penalized developer may have its Open Platform account deleted, with all permissions revoked\n- APP(s) under the penalized developer may be unable to make API calls\n- All authorized shop access permissions of the APP(s) will also be revoked\n- The penalized developer may no longer be able to authorize its APP(s) to access new shops/merchants",
  "metadata": {
    "title": "Platform Partner Rules",
    "summary": "This guide outlines the rules and expectations for Shopee Open Platform developers. It covers key areas such as data security, appropriate behavior, information accuracy, and API performance, ensuring a fair and safe platform for partners and users.",
    "keywords": [
      "Data security",
      "API performance",
      "Illegal behavior",
      "Information accuracy",
      "Fulfillment policy",
      "Open Platform",
      "Terms of Service",
      "Data Protection Policy"
    ],
    "category": "Best Practices",
    "tags": [
      "Partner",
      "Rules",
      "Compliance",
      "API",
      "Fulfillment"
    ],
    "difficulty": "medium",
    "importance": "5",
    "use_cases": [
      "Developing applications for the Shopee Open Platform",
      "Integrating with Shopee's APIs",
      "Ensuring compliance with Shopee's policies",
      "Providing fulfillment services through the Shopee platform",
      "Maintaining data security and user privacy"
    ],
    "related_apis": [
      "Internal API (mentioned in the context of abuse)"
    ]
  }
}