{
  "document_id": "developer-guide.34",
  "document_type": "guide",
  "platform": "shopee",
  "content_ko": "# 플랫폼 파트너 규칙\n\n## 이용 약관 - 플랫폼 파트너 규칙\n\n본 규칙은 모든 오픈 플랫폼 개발자를 관리하는 당사의 **데이터 보호 정책** 및 **서비스 약관**에 부합하며, Shopee가 모든 파트너와 사용자를 위한 공정하고 안전한 플랫폼으로 유지되도록 보장합니다.\n\n플랫폼 파트너 규칙의 다음 4가지 주요 영역을 숙지해야 합니다.\n\n1. 데이터 보안\n2. 불법 또는 부적절한 행위\n3. API 성능 및 활동\n4. 공유 정보의 정확성\n\n---\n\n## 플랫폼 파트너 규칙의 4가지 주요 영역\n\n### 데이터 보안\n[아이콘: 방패가 있는 컴퓨터]\n\n### 불법 또는 부적절한 행위\n[아이콘: 느낌표]\n\n### 공유 정보의 정확성\n[아이콘: 체크 표시가 있는 문서]\n\n### API 성능 및 활동\n[아이콘: 분석 대시보드]\n\n---\n\n풀필먼트 서비스를 제공하는 타사 파트너 플랫폼의 경우, 추가적인 타사 플랫폼 풀필먼트 정책이 적용됩니다.\n\n자세한 내용은 아래 상세 섹션에서 확인할 수 있으며, 현실적인 예시, 위반 방지 팁, 규정 미준수에 대한 처벌이 포함되어 있습니다. 또한 서비스 품질 개선을 위해 풀필먼트 성과를 추적합니다.\n\n---\n\n## 1. 데이터 보안\n\nShopee 오픈 플랫폼 개발자는 판매자, 구매자, 팀 또는 Shopee 오픈 플랫폼을 사용하는 개발자의 개인 및 비즈니스 정보에 액세스할 수 있으므로 당사의 **데이터 보호 정책**을 엄격히 준수해야 합니다.\n\n오픈 플랫폼을 사용하는 판매자 또는 사용자의 명시적이고 정보에 입각한 동의 및 승인을 받아야만 데이터에 액세스할 수 있습니다.\n\n다음 행위에 연루된 오픈 플랫폼 개발자에 대한 심각한 금지 사항은 다음과 같습니다.\n\n- 판매자 또는 구매자의 명시적이고 정보에 입각한 동의 및 허가 없이 자신의 마케팅 또는 분석 목적으로 판매자 또는 구매자의 개인 데이터를 사용하는 행위\n- 데이터 보호 정책에 사용자가 사용하지 않는 데이터를 포함하여 무책임한 사용자 데이터 수집\n- 판매자/구매자가 허가하지 않는 한, 판매자 또는 구매자의 개인 또는 비즈니스 데이터를 서버, 네트워크, 네트워크 스토리지 계정 또는 기타 장치에 복사하거나 보관하는 행위\n- 서버 문제를 제때 보고하지 않고 숨기거나 Shopee의 사이버 보안으로부터 정기적인 검사를 피하는 행위\n\n### 팁\n\n데이터 보호 정책에 액세스할 때 데이터 침해 사용을 최소화하는 데 적극적으로 대처하십시오. 다음은 취할 수 있는 몇 가지 예방 조치입니다.\n\n- 데이터 관리에 대한 정기적인 위험 평가 수행\n- 사용자 로그인 프로세스로서 판매자 창고 직원을 정기적으로 스캔\n- 플랫폼, 랩톱 및 기타 장치를 무단 또는 불법 파일 보안 관리로부터 보호\n- Shopee에서 통지한 보안 취약점, 보안 위험, 보안 대응 및 기타 관련 요구 사항을 적시에 수정\n\n자세한 내용은 **데이터 보호 정책**을 자세히 읽어보십시오.\n\n---\n\n## 2. 불법 또는 부적절한 행위\n\nShopee 오픈 플랫폼을 사용하는 모든 개발자는 공정한 거래 관행을 준수해야 합니다. 불법적이거나 부적절한 것으로 밝혀진 행위는 용납되지 않습니다.\n\nShopee는 또한 다음과 같은 예시에 연루되거나 관련되어 있다고 의심되는 오픈 플랫폼 사용자에 대해 엄중한 입장을 취합니다. 위반 사항은 매우 심각하게 처리됩니다.\n\n- 사기 또는 사기 관련 활동으로 유죄 판결을 포함하여 사기 또는 범죄 행위 수행\n- 구매자에게 빈 소포/주문하지 않은 품목을 의도적으로 건너뛰는 행위와 같은 풀필먼트 사기\n- Shopee의 지연 배송 감지 시스템을 회피하기 위해 시스템 기능을 조작하기 위한 수단으로 부정확하거나 가짜 추적 상태를 인위적으로 생성\n- 오픈 판매자에게 내부 API를 재판매하는 것과 같은 내부 API 남용\n- 부정확한 물류 주문 업데이트, 홍보 채팅 메시지 또는 무단 자료를 의도적으로 제공하여 로컬 스팸 발행\n- 업계에서 평판이 나쁘거나 불법 행위 또는 판매자 계정 또는 판매자 로컬 상점 거래에 대한 불만 이력이 있는 사기를 운영하는 것으로 알려짐\n- 정지 후 또는 경쟁업체의 플랫폼, 웹사이트 또는 기타 불법적이거나 부적절한 웹사이트에서 거래 또는 판매자 계정 또는 판매자 로컬 상점 운영\n- 가짜 주문, 모조품, 팔로워 및 봇을 포함하여 불법 자료를 창고로 보내는 행위\n- 기타 판매자 경쟁 비즈니스 관행\n\n불법적이거나 부적절한 행위로 플래그가 지정되지 않도록 항상 정직한 거래 관행을 준수해야 합니다.\n\n---\n\n## 3. 공유 정보의 정확성\n\nShopee의 주요 관심사는 투명성이며 Shopee와 거래하는 모든 오픈 플랫폼 개발자는 모든 업데이트를 공유하고 중요하거나 비즈니스를 변경하는 정보를 사전에 공개해야 합니다. 그렇게 하지 않으면 용납할 수 없으며 구매자에게 알리지 않거나 부정확한 세부 정보를 제공하거나 제출된 설명과 다른 서비스를 제공하는 결과를 초래합니다.\n\nShopee 오픈 플랫폼과 거래하기 전에 이러한 **서비스 약관**으로부터 자신을 보호할 수 있습니다.\n\n### 팁\n\n부정확한 정보 공유를 방지하려면 오픈 플랫폼 애플리케이션을 주의 깊게 확인하십시오.\n\n회사 이름, 이메일 주소, 전화 번호, 주소 및 기타 정보가 변경될 때마다 **Open Platform Console App Management page**에 OPP 세부 정보를 입력해야 합니다.\n\n---\n\n## 4. API 성능 및 활동\n\n우수한 API 성능 및 활동을 지원하면 개발자가 Shopee 사용자에게 고품질 서비스를 제공할 수 있습니다. 오픈 플랫폼 개발자는 또한 API 호출 볼륨을 정기적으로 수정하고 필요한 마진을 충족해야 합니다.\n\n모든 개발자는 다음 요구 사항을 충족해야 합니다.\n\n- 총 애플리케이션 실패율이 3% 이상이면 14일의 페널티가 부과됩니다(중간 날짜 제거 후 연속 일수). 페널티는 14일 동안 일시 중단되거나 종료됩니다.\n- 애플리케이션은 6일 제거 후 연속 14일 이내에 최소 1개의 API 호출을 해야 합니다. 어떤 경우에도 페널티가 적용되지 않을 수 있으며, 애플리케이션은 복구하기 위해 6주간의 유예 기간을 가져야 합니다.\n- 서비스를 수행하는 데 필요한 특정 /API endpoint(s)를 정기적으로 호출해야 합니다.\n\nShopee는 위의 기준을 충족하지 않거나 우수한 API 서비스를 제공하지 못하는 오픈 플랫폼 개발자를 제재할 권리를 보유합니다.\n\n### 팁\n\n애플리케이션의 성공률이 지속적으로 낮은 것으로 간주됩니다. Shopee는 등록된 이메일을 통해 연락할 것입니다. 페널티를 피하려면 후속 기간을 수정하십시오. 등록된 이메일을 더 이상 사용하지 않는 경우 이메일 세부 정보를 업데이트하십시오. 그렇지 않으면 귀하의 계정 및 관련 계정이 해당됩니다. 제안 이메일을 더 이상 사용하지 않는 경우 legal@shopee.com으로 최대한 빨리 이메일을 보내주십시오.\n\n---\n\n## 5. 타사 플랫폼 풀필먼트 정책\n\n본 정책은 판매자가 자신의 타사 창고에서 구매자에게 직접 주문을 배송하는 데 도움이 되는 타사 파트너 플랫폼을 보장하기 위해 마련되었습니다.\n\n본 정책은 풀필먼트 서비스를 제공하는 타사 파트너 플랫폼이 판매자가 쉽고 양호한 상태로 주문을 처리할 수 있도록 지원하는 것을 목표로 합니다.\n\n다음 사항은 일반적으로 물류에 적용됩니다. 다음 위반 사항을 충족할 수 없는 타사 파트너 플랫폼은 위반으로 간주됩니다.\n\n| 평가 영역 | 위반 사항 |\n|-------------------|-----------|\n| **미이행률** | 전체 또는 운영 시장에서 > 3% |\n| 미이행률(NFR)은 지난 14일 동안 늦게 배송되거나 잘못된 주소로 배송되거나 운송 중 분실된 총 주문 수에 대한 주문 비율이며, 판매자 또는 과실이 있는 경우에만 반품이 계산됩니다. | |\n| **지연 배송률** | 전체 또는 운영 시장에서 > 3% |\n| 지연 배송률(LSR)은 지난 14일 동안 늦게 준비된 총 주문 수에 대한 주문 비율입니다. 판매자의 주문 세부 정보에 표시된 배송 마감일 이후에 패키지가 배송되면 주문이 늦은 것으로 간주됩니다. | |\n| **반품률** | 전체 또는 운영 시장에서 > 20% |\n| 반품률(RR)은 지난 60일 이내에 반품된 주문 비율입니다. 배송 준비 전에 판매자가 더 오래 걸리는 선주문 품목은 RR 계산이 아닙니다. 마음이 바뀌어 구매자가 반품하는 경우는 계산됩니다. | |\n| **Shopee 지원 물류에서 지원하는 주문 비율** | 전체 또는 운영 시장에서 < 10% |\n| Shopee 지원 물류를 사용하지 않는 주문 비율 | |\n\n### 팁\n\n풀필먼트 페널티를 피하기 위해 공급업체 파트너와 함께 모범 사례를 배우려면 **다음 60-61 LSR을 발표할 때 확인하십시오**.\n\n---\n\n# 선주문 목록 비율\n\n선주문 목록은 주문 준비에 더 오랜 시간이 걸리는 목록으로, 배송일이 7일 이상 연속으로 설정됩니다.\n\n**임계값:** 전체 또는 운영 시장에서 > 20%\n\n---\n\n# 비통합 주문 비율\n\n비통합 주문은 Shopee 지원 물류에서 처리하지 않는 주문입니다.\n\n**임계값:** 전체 또는 운영 시장에서 > 10%\n\n---\n\n## 💡 팁\n\n풀필먼트 페널티를 피하기 위해 **NFR 및 LSR 개선**에 대해 알아보거나 소매 파트너와 모범 사례를 공유하십시오.\n\n구매자가 주문을 즉시 받을 수 있도록 항상 선주문 목록 및 비통합 주문의 비율을 **낮게** 유지해야 합니다.\n\n---\n\n# 7. 페널티\n\n위반이 발생할 경우 Shopee 오픈 플랫폼은 개발자의 행위를 일방적으로 조사하고, 적용해야 할 규칙을 결정하고, 위반의 심각도에 따라 애플리케이션 또는 개발자에 대해 조치를 취할 권리를 보유합니다.\n\n페널티에 대한 자세한 내용은 다음과 같습니다.\n\n## 1. 경고 통지\n- 개발자에게 이메일을 통해 경고 통지가 발송될 수 있으며, 시정 기간이 주어집니다.\n\n## 2. 민감한 데이터 API를 호출할 때 민감한 데이터 마스킹 **(신규)**\n- 구매자의 이름, 주소 및 연락처와 같은 민감한 데이터는 다음 API를 호출할 때 마스킹됩니다.\n  - V2.order.get_order_detail\n  - V2.logistics.get_shipping_document_data_info\n  - V2.returns.get_return_detail\n  - V2.order.get_buyer_invoice_info\n\n## 3. API 제한 감소 **(신규)**\n- Shopee 오픈 플랫폼에서 결정한 특정 비율로 일일 API 제한이 감소합니다.\n\n## 4. 신규 상점 인증 중단\n- 페널티를 받은 개발자의 APP는 새로운 상점/판매자에게 APP에 대한 액세스 권한을 부여할 수 없습니다.\n- 중단 전에 액세스 권한을 부여받은 상점/판매자는 인증이 만료되기 전에 APP를 계속 사용할 수 있지만, 중단이 해제될 때까지 재인증이 허용되지 않을 수 있습니다.\n\n## 5. APP 중단\n- 페널티를 받은 개발자의 APP는 API 호출을 할 수 없습니다.\n- APP의 모든 인증된 상점 액세스 권한도 취소될 수 있습니다.\n- 페널티를 받은 개발자는 새로운 상점/판매자에게 APP에 대한 액세스 권한을 부여할 수 없습니다.\n\n## 6. Shopee 오픈 플랫폼 계정 삭제\n- 페널티를 받은 개발자는 오픈 플랫폼 계정이 삭제되고 모든 권한이 취소될 수 있습니다.\n- 페널티를 받은 개발자의 APP는 API 호출을 할 수 없습니다.\n- APP의 모든 인증된 상점 액세스 권한도 취소됩니다.\n- 페널티를 받은 개발자는 더 이상 새로운 상점/판매자에게 APP에 대한 액세스 권한을 부여할 수 없습니다.",
  "translated_at": "2025-10-16T09:49:05",
  "char_count": 5679,
  "metadata_ko": {
    "title": "플랫폼 파트너 규칙",
    "summary": "본 가이드는 Shopee Open Platform 개발자를 위한 규칙 및 기대 사항을 설명합니다. 데이터 보안, 적절한 행동, 정보 정확성, API 성능과 같은 주요 영역을 다루어 파트너와 사용자를 위한 공정하고 안전한 플랫폼을 보장합니다.",
    "keywords": [
      "데이터 보안",
      "API 성능",
      "불법 행위",
      "정보 정확성",
      "주문 처리 정책",
      "Open Platform",
      "서비스 약관",
      "데이터 보호 정책"
    ],
    "category": "모범 사례",
    "tags": [
      "파트너",
      "규칙",
      "규정 준수",
      "API",
      "주문 처리"
    ],
    "difficulty": "medium",
    "importance": "5",
    "use_cases": [
      "Shopee Open Platform용 애플리케이션 개발",
      "Shopee의 APIs와 통합",
      "Shopee의 정책 준수 보장",
      "Shopee 플랫폼을 통한 주문 처리 서비스 제공",
      "데이터 보안 및 사용자 개인 정보 보호 유지"
    ],
    "related_apis": [
      "Internal API (악용 관련 맥락에서 언급됨)"
    ]
  },
  "metadata_translated_at": "2025-10-16T09:49:08"
}