{
  "document_id": "developer-guide.32",
  "document_type": "guide",
  "platform": "shopee",
  "vector_type": "individual",
  "content_en": "# Shopee Open Platform Data Protection Policy\n\n**Announcement | Console**\n\n[Terms of Use](/) | Data Protection Policy\n\n---\n\nThis Shopee Open Platform Data Protection Policy explains how information is collected and used by the Shopee Open Platform (together the \"Platform Terms\"). The Platform Terms are incorporated by reference into any agreement or contract we have with you (including without limitation Shopee Content API Service Level Agreement and API Terms of Use, collectively referred to as \"DPP\") and form part of such agreement.\n\n## 1. Purpose and Scope\n\n### 1.1\nThis Shopee Open Platform Data Protection Policy (\"DPP\") constitutes the maximum data protection and information security standards that you are and your personnel are must and mandated to adopt to protect Protected Data that are collected, stored, used, disclosed and/or processed by you through your access or use of or integration with the Platform.\n\n### 1.2\nYou shall be fully responsible for ensuring that you, your personnel and your users consent to and comply with this DPP, and shall be deemed to directly be in breach of this DPP. Failure to comply with the provisions outlined in this DPP will result in a breach of your legal contract with Shopee and any other applicable laws.\n\n### 1.3\nYou confirm that when you have integrated with the Platform, to ensure the data are secured, for which we will require you to fulfil certain permissions/roles specified, you, your users, your personnel shall be entitled to access shall be entitled to and access data which you, your users, your personnel shall be entitled to access in a secure manner such as information relating to each product in your store, order data, logistics information, finance data, and access to basic configuration settings such as those pertaining to authentication and authorization. In accessing such data, you shall ensure that all reasonable security measures are in place both administratively and technically to protect confidential information and personal data from unauthorized collection, storage, use, disclosure and/or processing of such personal data (i.e. as well is not intended to manifest these as the sole usage of the platform).\n\n### 1.4\nYou shall be fully responsible for ensuring that you, your personnel and your users consent to and comply with this DPP and agree that you accept the practices, requirements, and/or policies outlined in this DPP and the terms described herein. If you are accessing and using the Platform on behalf of a company (such as your employer) or other legal entity, you represent and warrant that you have the authority to bind that company or other legal entity to this DPP. In that case, \"you\" and \"your\" will refer to that company or other legal entity. You represent and warrant that you are duly authorized to accept this DPP on such company or entity's behalf and to legally bind such company or entity. If you do not have such authority, you must not accept this DPP and may not use the Services on behalf of your employer or acknowledgement and acceptance of the changes made to this DPP.\n\n## 2. Definitions\n\n### 2.1\n\"API\" means the application programming interfaces made available by Shopee via the Platform.\n\n### 2.2\n\"Application\" means the software application, website or mobile app with which you access the Platform and which includes integrated Shopee API Services or developed by integrating with the Platform to provide functions to users for the use of any API.\n\n### 2.3\n\"Content\" means text and any other material (including databases, text, graphics, photographs, screenshots, audio, video, information and material provided by Shopee or third parties, or information and material of or provided by third parties or information and material of a third party, or which data Processing to transmission feedback) are provided in support of your Application.\n\n### 2.4\n\"DPP\" means collectively this Data Protection Policy (as updated from time to time) and any attachments hereto.\n\n### 2.5\n\"Personal Data\" or \"PD\" means data, whether true or not, that can be used to identify, contact or locate an individual, or from which such identification, contacting or locating may be reasonably practicable. \"Personal Data\" shall also include any actual or suspected (i) misuse of Shopee Content; or (ii) unauthorised access to or attempt to access Shopee Content or Shopee systems; or (iii) interference with or disruption to Shopee systems; or (iv) violation of DPP and/or any terms or conditions we have with you (including without limitation Shopee Content API Service Level Agreement and API Terms of Use); or (v) security incident or event involving Shopee Content.\n\n### 2.6\n\"Processing\" means any operation or set of operations which is performed upon Data, whether by automatic means or not, including but not limited to, collection, obtaining, recording, holding, storage, organization, adaptation, alteration, use, disclosure, dissemination, erasure, loss, destruction or disposal and \"Process\" and \"Processed\" shall be construed accordingly. \"Restriction of processing\" means the marking of stored Data with the aim of limiting their Processing in the future.\n\n### 2.7\n\"Protected Data\" means all data received, accessed, collected, used, disclosed, stored and/or processed by you via the Platform and which: (a) contains Personal Data; or (b) are commercially confidential to Shopee or its affiliates; or (c) provides us a direct financial basis, and (d) whose access or whose disclosure would likely give a potential adverse financial or reputational impact to Shopee or its customers or business, including but not limited to information relating to orders and products, payment and logistics information, seller/buyer profile and information, as determined by Shopee at its sole discretion (\"Protected Data\").\n\n### 2.8\nThe parties hereby acknowledge that in the course of implementing and maintaining your integration with the Platform and Shopee polygons, statistics relating to the performance, financial or otherwise) of any Shopee services, data, computers, systems or premises, or such information may be shared related to the activity and any other information as may be generated through you based on information received from the Platform or the processing of such information and related activities.\n\n### 2.9\n\"Security Breach\" means any actual or suspected impairment, compromise or breach of security of any system (including but not limited to any computer systems and network systems) maintained containing Shopee Content, for example, any (i) misuse; (ii) loss; (iii) unauthorised access or disclosure; (iv) unauthorised acquisition; (v) unauthorised modification; (vi) other form of misuse; or (vii) other unauthorised activity.\n\n### 2.10\n\"Shopee Content\" means all Data stored in and retrieved from the databases of the Shopee group, which may include but not be limited to (i) Personal Data of users, merchants and any other stakeholders of the Shopee group; (ii) trade secrets or other proprietary information belonging to Shopee; and (iii) any other data related to your or any user of the Platform. \"Systems\" has the meaning given to it under Section 5.1.\n\n### 2.11\nAll other capitalised terms shall have the same meaning as defined in the API Terms of Service.\n\n---\n\n## 3. Restricted Data\n\n### 3.1\nSubject to any applicable law (including without limitation, any applicable data protection or privacy laws and regulations), you shall not collect, use, disclose, store and/or otherwise process any Personal Data if: (i) not required for any feature or function or any purpose of the administrative Restricted Data, except in accordance with Shopee's Terms of Service and Privacy Policy. Restricted Data means full credit or debit card numbers, card verification value (CVV) codes, or bank account and full account numbers / bank codes / financial information held with financial institutions, identity card, national identification number, driver's license number, passport number, or any similar information issued by a government agency, individually or in combination with other information, information about racial, ethnic, religious, sexual orientation, transgender status, household or other income, or health or genetic data, and (ii) not within the scope of consents duly collected from the data subjects in accordance with applicable law; and (iii) not compliant with this DPP.\n\n### 3.2\nIf you have previously collected any Restricted Data from your personnel and your users that is not within the scope as listed in Section 3.1, you should destroy or delete such data as soon as reasonably practicable, subject to the requirements of applicable law and any such breach. You and your personnel agree to waive any requirement to the securing or posting of any bond in connection with exercising any remedy available under this DPP and any other agreements concluded with us.\n\n---\n\n## 4. Security Management\n\n### 4.1\nYou will develop, implement, maintain and enforce a written information privacy and security program that contains appropriate administrative, technical and physical safeguards against (i) any anticipated threat or hazard to the security and integrity of Protected Data; and (ii) unauthorized Processing that may result in substantial harm or inconvenience to any person, business or Shopee, designed to protect the confidentiality, integrity and availability of Shopee Content and Protected Data.\n\n### 4.2\nYou will ensure that the security program required under Section 4.1 should reasonably designed to ensure the confidentiality and integrity of Protected Data and to protect against any anticipated threats or hazards to the security and integrity of Protected Data.\n\n### 4.3\nYou will provide details of any major change to your security program that may adversely affect the security of any Protected Data Processed under Section 3.1. If such changes may have any adverse impact the security of Protected Data, you shall (prior to implementing such change) consult with Shopee and follow Shopee's directions, which may include but not limited to requiring you to postpone or not implement such change or discontinue your use of and access to the Platform.\n\n### 4.4\nYou agree that Shopee will have the right to audit your compliance with this DPP, including but not limited to your security program and communicating with Shopee on information security matters (\"Security Officer\").\n\n### 4.5\nYou acknowledge that in the event Shopee discovers any non-compliance with this DPP in the course of such audit, Shopee reserves its right to suspend the access to the Platform.\n\n### 4.6\nIf you experience any Security Breach, you will as soon as reasonably practicable (and in any event no later than within 24 hours of becoming aware), or have concerns with Shopee and to communicate the level of risk associated with such concerns and any necessary factional law enforcement actions to protect affected individuals. You agree to waive, without limitation to remedial action(s) we may take, and to cooperate and respond promptly to our directives and requests. Please contact us at apisupport@shopee.com for any breach notification. You shall also send written notification to the Data Privacy Officer at shopee-dpo-sg@shopee.com to inform the Security Breach, if such Security Breach involves Personal Data of individuals.\n\n### 4.7\nIt is important that you notify Shopee immediately of any unauthorized access to any Shopee Content.\n\n### 4.8\nIncident Response Plan: For Application developers, a Security Breach could result in various categories of harm, including:\n\n- (a) A loss of intellectual resources and hosting to comply with this DPP; and\n- (b) A loss of consumer protection, integrity, and trust in your Application; and\n- (c) A loss of brand reputation caused by the Security Breach.\n\nIn the event your security program should fall short of providing adequate protection to your users' Personal Data in accordance with the best practices and standards referenced in this DPP and other applicable requirements including the performance of similar services.\n\n### 4.9\nYou agree to grant Shopee commercially reasonable access and cooperation rights to allow (along with its authorized third party representatives) to verify compliance with this DPP. You agree that Shopee, its affiliates and their authorized third party representatives shall have the right to audit, inspect and evaluate your compliance with this DPP both during and after the term of any other agreements concluded with us. For the avoidance of doubt, such inspections and audits (the \"Audit\") must be conducted under a proper access role, and access should be granted on a \"need-to-know\" basis.\n\n### 4.10\nFor the purposes of ensuring that all your personnel is trained and security updated events arise - access and authorization, intrusion attempts, vulnerability and misuse event handling - you agree to implement a training mechanism and ensure appropriate security access is based on job roles. For the purposes of the security management access to Shopee Content. All logs must have access controls to Storage Content. All logs must have access controls to help prevent data breaches and ensure that your personnel is trained accordingly. This includes having your staff undergo regularly conducted training modules that may be provided by Shopee to access to begin incorporating lessons to suspicious activity (e.g., multiple unsuccessful login, unexpected required rate are based on the security of the Systems during Protected Data within the Platform, and to restrict and prevent logs must be secured to prevent or detect as early as possible any Security Breach that may threaten the security of protected Data.\n\n---\n\n## 5. Logical Security\n\n### 5.1\nIn the context of this DPP, \"Systems\" means all software, hardware and systems used by you or your personnel to access Shopee Protected Data and/or Shopee Content via the Platform, or used in the processing of Shopee Protected Data and/or Shopee Content. For the purposes of this DPP, Systems includes but is not limited to devices, computers, work stations, mobile devices and servers.\n\n### 5.2\nYour Systems must comply with the following security requirements and controls:\n\n- a) All prevent unauthorized access to Protected Data\n- b) All Systems, applications and programs must be kept up to date.\n- c) All anti-malware software must be current, operational and actively protecting the Systems. The anti-malware software must have the latest virus, signature, behavioral and heuristic detection capabilities and all Systems are configured to scan all files. System scans must be executed on applicable servers and workstations in accordance with industry standards and best practices.\n- d) User access control systems must be based on job roles in accordance with industry best practices at all times for access rights and authorization. Access rights and authorization intrusion attempts must be routinely reviewed, evaluated and audited, and accounts of terminated personnel or personnel whose job function has changed must have their access promptly revoked. Detailed System logs of all access to and use of Protected Data must be documented in your written information privacy and security program (referred to in Section 4.1 above).\n- e) All Systems must be clearly identified for internal access (i.e., no misuse from personnel) or for restricting Protected Data or transferring such data across insecure internal or external networks.\n- f) All Systems must be equipped with security controls to prevent unauthorized access or modification, or disruption.\n- g) All deploy appropriate firewall technology in the operation of your Applications, apps, and protect and authenticate access to or from the Systems, the networks and the external connectivity of the Systems uses of the Platform. Firewalls must be configured to the highest standard encryption to facilitate strong passwords.\n- h) All deploy intrusion detection and prevention systems in order to, generate, monitor, and respond to alerts which access Shopee Content.\n- i) All access to your security operations for all activities of your users and personnel.\n\n### 5.3\nWithout prejudice to the above, you agree to comply with reasonable security requirements we may request from you from time to time to ensure the safety of Shopee Protected Data, including without limitation a minimum password policy of the systems, a minimum password policy of next (1) year.\n\n### 5.4\nYou agree that you will implement effective network segmentation to restrict network access to Systems storing Protected Data and/or Shopee Content. You agree that you will, where possible, keep such network logically and physically segregated from any other networks and Systems to minimize the probability that malware could infiltrate the such a segregated network. You will implement a policy based approach to permit or deny traffic flow between segments and zones, and implement end user management of wireless networks to meet the following:\n\n- i) Compliance with any password complexity and password changes requirements by Shopee for all accounts with privileged access to Shopee Content; and\n- ii) All network access to systems networks shall be restricted to those authorized;\n- iii) All personnel that have access to or Process Shopee Content must have a unique identity device certificate, key, or one-time password;\n- iv) All remote access security measures must be configured to control, secure and regularly monitor changes for all activities of your personnel with access to Shopee Content, and maintain details of all such changes for review;\n- v) All recognition of all wireless connections will be accident using industry standard encryption algorithms (i.e., Wi-Fi Protection Access 2 (WPA2) at minimum);\n- vi) All personal Systems (i.e., not company issued) that have access to Shopee Content (if permitted) must be configured to meet minimum security standards. Such Systems must not be used to Process Shopee Content, and periodically be disqualified staff or a wireless intrusion prevention system. Logs must be retained for twenty (20) days or more.\n\n### 5.5\nYou will conduct, implement and maintain effective logical access controls that restrict access to Shopee Content by your personnel to a need-to-know basis and ensure that all accounts with access to Systems and networks used to access or management purposes. Shopee will be kept only with appropriate access controls over purpose systems devices and Systems. You should maintain an updated inventory record of all devices and Systems having access to the Platform and having access to or Processing Shopee Content at any time. You agree that you will designate at least one competent person who shall be responsible for overseeing all aspects of information security management within your company and liaise with Shopee in any matters relating to data access control and responding to any Security Breaches that arise in relation to Shopee Content at all times with the appropriate skill and knowledge to oversee the data-approved access points and act on due.\n\n### 5.6\nYou must have logical access controls in place and all user privileges associated with the must occur within a segregated and secure access environment. As such\n\n---\n\n# Developer Guide - Security and Compliance Documentation\n\n## 5. General Security\n\nManagement purposes. SaaStr will be held only with appropriate access controls how provide wireless services transmittably. This will not be shared or sold at default customarily along will be arranged as transmittably.\n\nAccess points are in place. If you have not deployed a wireless solution, you are still required to contact this quarterly to ensure your wireless devices have been properly maintained.\n\nWireless workgroups. Workstations with guest access are set up with wireless software and the device must be secure and long distances must be adhered to when using these workstations.\n\nIt You must prevent, detect, and address wireless security breaches, including those increasingly sophisticated to production environment. However, Stripe will not provide any Service-Level Agreements unless supporting pictures in production.\n\n## 6. Systems Development and Maintenance\n\n6.1 You must maintain documentation on overall system, network, and application architecture, data flows, process flows and security boundaries for all applications that Process or Store my Protected Data. You must regularly file an Architectural and Data Flow Questionnaire.\n\n6.2 You must maintain system and software patch management processes to keep all systems and applications appropriately up to date. You must be responsible for verifying that all development staff have been successfully trained in secure programming and Stripe requires this verification.\n\n6.3 You must maintain a robust Software Development Life Cycle (SDLC) utilizing industry best-practice principles.\n\n6.4 You will employ an effective, documented change management program with respect to services provided pursuant to Section 3 (Permitted Uses) hereof. Changes of any sort regarding production or production-supporting environments must undergo a defined change management process, including documentation, approval, and logging.\n\n6.5 You must use internal and external networks substantially purse at least quarter parity and following any internal change processes, this includes networks where Processing occurs, and restrict access to only those individuals who need access for defined legitimate business purposes.\n\n6.6 You will administer production environments using documented administrative procedures. If you have not deployed wireless access points, you must still contact this quarterly to update us on the current state of your networking environment. All security-associated reviews to identify common security vulnerabilities as identified by industry-recognized organizations, are not limited to common vulnerabilities as identified by OWASP Top 10 and/or CWE/SANS Top 25.\n\n6.7 You shall ensure that software operating in production and test environments has been validated prior to deployment, on the basis of relevant security controls.\n\n6.8 In all mobile applications that collect, transmit or display Shipper Content, you agree to conduct an application security assessment review to identify and remediate industry-recognized vulnerabilities specific to mobile applications.\n\n6.9 You must maintain malware detection and prevention controls on systems and networks that Process or Store Shipper Content. In situations where malware is detected, you will ensure actions are taken to prevent a full impact or the infection spreading to other systems. You must maintain regularly-launched best-practices, and the associated policies is reviewed and approved by Shipper in writing. Maintenance logs shall be available upon request.\n\n6.10 You must store all passwords in the approved, encrypted manner and will track logs and monitor whether there is a change to master credentials every 90 days. Shipper will not be liable or responsible for any loss or damage occasioned by non-compliance.\n\n6.11 You computing environment according to a schedule predicated on the criticality of the patch. You must perform patch level assessments independently based upon required guidelines. Shipper reasonably verifies the security of the information resources through documentation. You shall not limit the liability of Shipper or impair its ability to exercise any rights or remedies now or hereafter available to us upon default.\n\n## 7. Email Security\n\n7.1 You will deploy and use, at years, appropriate email identity solutions will be utilized.\n\n## 8. Security Assessments and Audits\n\n8.1 You will audit and scan to choose a declaration of all Systems and key IT assets which Process and/or Store any Shipper Content. This declaration will include an up-to-date and accurate architectural depiction and inventory of all systems, infrastructure, and software utilized in the Processing or Storage of Shipper Content.\n\n8.2 You agree to maintain a comprehensive vulnerability management program, including, but not limited to, the regular scanning of all systems for vulnerabilities in accordance with industry best practice.\n\n8.3 You agree that Shipper may, from time to time, perform a security audit (i.e., vulnerability scans), of your Systems and infrastructure that Process or Store Shipper Content. All scans will be coordinated with you, but you will be required to implement scans as may be reasonably requested by Shipper.\n\n8.4 In cases where Shipper Content is introduced into your environment, you agree to annual penetration testing on all externally- or internally-facing infrastructure.\n\n8.5 You will provide upon reasonable notice, to allow your data processing facilities, procedures and documentation to be inspected and audited by Shipper or its designated third party in accordance with applicable laws. The DPO or any appropriate substitute or related personnel must be included in these audits and inspections. You agree to provide Shipper access to relevant documentation/personnel to conduct appropriate security reviews.\n\n8.6 You will audit log and monitor access, on an ongoing basis, to relevant production systems used to Process and/or Store Shipper Content.\n\n8.7 You will audit logs together with the security checks, audit efforts and requests from Shipper in accordance with the Service Level Agreement for the Services. Based on NIST industry-leading-practice, you will maintain industry standard log reviews and escalation procedures, and you will facilitate Shipper or its auditors in their review of such audit logs as may be available. In the event that Shipper auditors wish to review your logs and systems, such access must be available, and result in immediate identification of your use of the Services.\n\n## 9. Incident Response and Notification Procedures\n\n9.1 You shall have Effective information security incident response procedures in place for which (i) and protecting the confidentiality, integrity and availability of Shipper Content is an explicit, defined goal. As part of the information and all Shipper Content at risk, you must take all reasonable measures to mitigate the harmful effects of the Incident. You shall also conduct any other reasonable investigatory measures with regard to the Incident.\n\nProcedures should include:\n\n- (a) the identification of the Shipper Content which has been, or is reasonably believed to have been, under-accessed, impermissibly disclosed, or otherwise compromised;\n- (b) notification to Shipper pursuant to these Terms;\n- (c) in the event the Incident involves Service accounts or passwords, passwords will be appropriately disabled;\n- (d) in the scope of the Incident, including a description of the type of Shipper Content involved in the Incident;\n- (e) in short summary of the root causes (or an explanation of the information at the time of discovery, if the Incident is still being investigated);\n- (f) whether the Shipper Content was encrypted; and\n- (g) other information as Shipper may reasonably require.\n\nYou will provide such information within any timeframe as communicated reasonably in advance by Shipper for any accountable notice such as to provide cause overlapping to affected Data Subjects.\n\n9.2 You will employ appropriate logging and monitoring of access to Shipper Content in order to facilitate investigations and forensic or audit Records. You will cooperate with Shipper in the identification and remediation of any applicable such as to provide cause overlapping to affected Data Subjects.\n\n9.3 You will engage with Shipper as necessary in investigations and forensic in well-Managed incidents. You will cooperate with Shipper to determine whether notice must be provided to Data Subjects and/or Supervisory Authorities (and if so, timing and content) related to personal data processing in any Incident investigation. Upon conclusion of investigation, summary will be provided to Shipper.\n\nWithin the first 72 hours of detecting or being made aware of an Incident, you will provide us:\n\n- (a) the nature of the Incident;\n- (b) an indication of the Shipper Content, disclosed, or otherwise compromised or altered;\n- (c) the likely consequences and severity of the Incident, including any actual or reasonably likely harm;\n- (d) recommended measures to prevent recurrence and mitigate harm to the Data Subjects and Shipper; and\n- (e) all efforts taken to mitigate the risks of further incidents.\n\n## 10. Storage, Handling, and Disposal\n\n9.4 You shall notify the Shipper completely and verify a recovery action plan, isolate, and disposal of any Shipper Content. Personal Data, Transmitted Data, and Restricted Content that is subject to this path.\n\n10.1 You will ensure security disposal of Shipper Content is conduct free from cyber clients' data.\n\nAt the end of the Service pursuant to our agreement, or when otherwise requested to do so by Shipper, you will permanently and irretrievably, delete, destroy and/or return any Shipper Content and any output or material derived from your Processing of Shipper Content from storage and data processing systems where storage located is to be deleted or stored (wireless networks).\n\n10.2 You will employ appropriate backup stored algorithms, with sufficiently generated keys' added to the input string stored in production. You agree to ensure backup facilities, backup media and restored credentials are located in a sufficiently secure location.\n\n10.3 If any mobile devices used outside of a Data Center (e.g., a \"laptop, desktop tablet) is perform any services pursuant to this Agreement.\n\n10.4 If paper shredding and digital data, upon the disposal of it is to formatting (i.e., the wiping of storage media) should be stored at Data Centers consistent in overwriting (i.e., the wiping storage-persistent or wiping in which the content Guidance outlined in DoD or close to that following industry standards: ISO 27001; SSAE-18 or both; and, or PCI.\n\n10.5 To demonstrate and prove that you will be fully and properly bound by the destruction of Shipper Content as described in this section and you will receive and retain written confirmation before Data is destroyed. Shipper may, from time to time, request a written certification showing that Shipper Content has been destroyed from your environment and destroy it within a reasonable timeframe, but no later than thirty (30) days after receipt from us.\n\nYou acknowledge and agree that:\n\n- (a) transfer or destroy, as request in Section 10.1, all media used to store Protected Data; and\n- (b) all portable devices or portable media supporting such Protected, destruction, and copy request otherwise as provided in this section 10, and you will not retain any such media. All destruction must be certified.\n\n10.6 You will retain Shipper Content only for the minimum period required by this Agreement, taking into account the power that you and not using it to standard communications. Shipper will provide written notice requesting modification, and promptly return such media to Shipper, including but not limited to electronic mail, facsimile transmissions, text messages and instant messages supporting the Services.\n\n10.7 In the event of termination of the Services or this Agreement, you will not modify the Shipper Content in any way available, and result in immediate termination of your use of the Services.\n\n10.8 You agree to maintain copies are measured Data and Restricted Data (including but not limited to the Customer Name and passwords) physically segregated from other data, properly encrypted, and backed up in accordance with the terms set forth in the Agreement and in reasonable industry-standard methods. Shipper agrees to reasonably identify your rights for applicable data. Upon the expiry of the applicable retention period, all retained be disposed of in accordance with Clausul and destroyed in Section 10.\n\n10.9 You shall dispose Transmitted Data and or Restricted Content from production environments in accordance with the Agreement or once the applicable legal retention period has expired, whichever is earlier, in a manner that ensures the data Security are completely destroyed and is irrecoverable using standard high-integrity disposal or in accordance with terms or reasonable at provisions and in line to reasonable as applicable.\n\nShipper must be notified of the completion of the disposal. Shipper reserves the right to review and request information directly and implement confirming Protected Data that is damaged or non-functional. All Protected Data must be rendered irrecoverable upon written by you and or written from that of destruction.\n\nShipper reserves the right to audit your disposal processes.\n\n## 11. Ownership and Use\n\n11.1 You acknowledge and agree that you have no ownership of, or right to use, Shipper Content other than as expressly set forth under an applicable legal agreement between you and Shipper. In the event an Incident, (including but not limited to unauthorized access, disclosure, alteration, or loss of Shipper Content), you must immediately notify Shipper and cooperate as expressly provided in the Terms of Service or as expressly authorized by Shipper in writing.\n\n11.2 You will only use the Shipper Content as necessary to provide the Services and will not use or disclose Shipper Content for any purpose other than as specifically authorized by Shipper.\n\n## 12. Payment Card Industry Compliance\n\n12.1 If you Section 6's agree whenever you transmit, Process, handle, access, maintain, or store credit card holder's information, you have satisfied all requirements pursuant to the Terms of Service of any or such Applicable.\n\n12.2 If you transmit, process, handle, access, maintain, or store credit card holder information on behalf of Shipper and/or if you share in the storage environment with Shipper's systems which transmit, process, access, handle, maintain or store credit card holder information, you must satisfy all applicable Payment Card Industry Data Security Standards (PCI-DSS) published by the PCI Security Standards Council. You must, if requested, provide written attestation of compliance, such as through a Report on Compliance (ROC) or Self-Assessment Questionnaire (SAQ), appropriately attested to, that you have achieved the appropriate PCI-DSS requirements. You must also provide documentation for card-present, eCommerce, or mail order/ telephone order card-not-present environments, upon request. If you, or any of your users, directly, or cause the disclosure of any debit and credit card-holder's information in its possession, custody, or control, you will be solely liable.\n\n## 13. Governing Law; Disputes\n\n13.1 Use of the Platform and/or the Services will Steps Terms of Use shall be governed by and construed in accordance with applicable law.\n\n13.2 Nothing in our Agreement prevents Shipper from bringing an action in a court of law with relevant jurisdiction for the purposes of seeking an order relating to the DPI, including any claims as to its formation, validity, existence, breach or termination, (each claim, a \"Dispute\"). Shipper may bring an action in a court of law with all applicable jurisdictions. The jurisdiction shall be that of the party bringing the action and the Parties expressly waive all claims or objections with respect to personal jurisdiction or venue. Any award or ruling resulting from the arbitration will be limited in its application solely to this Agreement; the use of this arbitration clause must not be construed as a waiver of any right to jury trial which may exist. Nothing in this Agreement, the arbitration clause must not be construed to the Courts of Ireland and Singapore. The arbitration clause shall consist of one arbitrator by and between the parties agreed or otherwise, if the parties cannot agree on the choice of an arbitrator within thirty (30) days after the dispute has arisen. If one arbitrator has been selected, then the arbitrator agreed upon by parties will be appointed, or if no agreement, will be appointed by the President of the Law Society of Ireland, whose shall be an active member of the Ireland, must must be chosen by the two arbitrators appointed by or on behalf of the Parties acting in concert with sixty (60) days from the date of appointment of the second arbitrator in the proceedings of the jurisdiction shall be English. The arbitration, including the making of the award, must be completed within ninety (90) calendar days from the appointment. The decision reached. The decision shall be final and binding on the Parties. The language of the arbitration shall be English. The arbitral award made shall guided by the arbitration tribunal shall be final and binding on both parties in the event the parties does not consolidate them or allow join to this agreement.\n\n13.3 Nothing in this provision prevents Shipper's immediate recourse to the courts for injunctive relief.\n\n## 14. Processing of Personal Data\n\n---\n\n# 14. Processing of Personal Data\n\n14.1 You shall Process Personal Data in accordance with applicable laws, and at all times maintain, and ensure compliance with, privacy policies which meet the minimum standards under the applicable laws.\n\n14.2 Prior to sharing any Personal Data with Shopee, you shall ensure that Data Subjects are appropriately notified of and have consented to Shopee's privacy practices. You warrant that you have a legitimate basis and adequate title to collect and share Personal Data with Shopee.\n\n14.3 The following provisions shall apply to the Processing of Personal Data which was obtained or derived from any Shopee Content:\n\n- (a) In relation to such Personal Data, as between you and Shopee, you are a data intermediary and shall Process the Personal Data on behalf of Shopee in accordance with this DPP.\n\n- (b) You shall Process Personal Data only to the extent, and in such manner, as is required to develop, operate and maintain your Applications in accordance with the Terms of Service and Shopee's written instructions.\n\n- (c) You are authorised to use Sub-processors, provided that you (i) enter into an agreement with the Sub-processor imposing data protection obligations on the Sub-processor that are at least as restrictive as the obligations under this DPP, (ii) undertake to provide a copy of the aforesaid agreement to Shopee promptly upon request, and (iii) shall remain liable for any act or omission of any Sub-processor that does not comply with the requirements of this DPP.\n\n- (d) You shall not cause or permit any Personal Data to be transferred across borders in breach of applicable laws. Cross-border transfers of Personal Data subject to legal restrictions by applicable laws shall require Shopee's prior written consent. For the avoidance of doubt, this transfer restriction does not pertain to Shopee personnel access to Personal Data.\n\n- (e) To the extent legally permitted, you shall immediately notify Shopee in writing upon receipt of an order, demand, or document purporting to request, demand or compel the production of Personal Data to any third party. You shall not disclose Personal Data to the third party without providing Shopee at least forty-eight (48) hours' notice, so that Shopee may, at its own expense, exercise such rights as it may have under applicable laws to prevent or limit such disclosure. Notwithstanding the foregoing, you will exercise commercially reasonable efforts to prevent and limit any such disclosure and to otherwise preserve the confidentiality of Personal Data; additionally, you will cooperate with Shopee with respect to any action taken pursuant to such order, demand, or other document request, including to obtain an appropriate protective order or other reliable assurance that confidential treatment will be accorded to Personal Data.\n\n- (f) You agree that Shopee may for any reason, in its sole discretion and with or without notice or liability to you, immediately suspend or terminate your Account or access to the Platform and Services, remove or discard from the Site any Content associated with your Account, and/or take any other actions that Shopee deems necessary to protect itself and any Protected Data. Grounds for such actions may include, but are not limited to, actual or suspected (a) extended periods of inactivity, (b) violation of the letter or spirit of this DPP, (c) security failures by you, including failure to cooperate in any security audit or to take reasonable remediation steps required by Shopee, (d) any data leakage or loss attributable to you or your clients, or (e) any other behaviour that is harmful to Shopee's Users, third parties, or the business interests of Shopee. Use of an Account for illegal, fraudulent, harassing, defamatory, threatening or abusive purposes may be referred to law enforcement authorities without notice to you. Without limitation to any other remedy available, if a legal dispute arises or law enforcement action or other regulatory inquiry is commenced relating to your Account or your use of the Services for any reason, Shopee may terminate your Account immediately with or without notice.\n\n- (g) Without limitation to any other remedy or indemnity available under the Terms of Service, you agree to indemnify, defend and hold harmless Shopee, and its shareholders, subsidiaries, affiliates, directors, officers, agents, co-branders or other partners, and employees (collectively, the \"Indemnified Parties\") from and against any and all loss, claims, actions, proceedings, and suits and all related liabilities, damages, settlements, penalties, fines, costs and expenses (including, without limitation, any other dispute resolution expenses) incurred by Shopee or any Indemnified Party arising out of or relating to, without limitation, (a) your violation or breach of any term of this DPP or any policy or guidelines referenced herein, (b) your use or misuse of the Platform, any Shopee Content, Restricted Data, Protected Data and/or Personal Data, and (c) your breach of any law or any rights of a third party, including any applicable data protection laws.\n\n# 15. Effective Period\n\nYour obligations and Shopee's rights under this DPP shall become effective from the date you access the Platform, and will continue in effect until the termination of the Terms of Service and for any period thereafter during which you and your personnel have possession of or access to any Protected Data.",
  "content_ko": "# Shopee 오픈 플랫폼 데이터 보호 정책\n\n**공지 | 콘솔**\n\n[이용 약관](/) | 데이터 보호 정책\n\n---\n\n본 Shopee 오픈 플랫폼 데이터 보호 정책은 Shopee 오픈 플랫폼(이하 \"플랫폼 약관\"이라 함)에서 정보를 수집하고 사용하는 방법에 대해 설명합니다. 플랫폼 약관은 귀하와 당사 간의 모든 계약 또는 계약(Shopee Content API 서비스 수준 계약 및 API 이용 약관을 포함하되 이에 국한되지 않으며, 총칭하여 \"DPP\"라고 함)에 참조로 통합되며 해당 계약의 일부를 구성합니다.\n\n## 1. 목적 및 범위\n\n### 1.1\n본 Shopee 오픈 플랫폼 데이터 보호 정책(\"DPP\")은 귀하와 귀하의 직원이 플랫폼에 대한 액세스, 사용 또는 통합을 통해 귀하가 수집, 저장, 사용, 공개 및/또는 처리하는 보호 데이터를 보호하기 위해 채택해야 하는 최대 데이터 보호 및 정보 보안 표준을 구성합니다.\n\n### 1.2\n귀하는 귀하, 귀하의 직원 및 귀하의 사용자가 본 DPP에 동의하고 준수하도록 할 책임이 있으며, 본 DPP를 직접 위반한 것으로 간주됩니다. 본 DPP에 명시된 조항을 준수하지 못할 경우 Shopee와의 법적 계약 및 기타 관련 법률을 위반하게 됩니다.\n\n### 1.3\n귀하는 플랫폼과 통합했을 때 데이터 보안을 위해 특정 권한/역할을 충족해야 하며, 귀하, 귀하의 사용자, 귀하의 직원이 귀하의 스토어의 각 제품에 대한 정보, 주문 데이터, 물류 정보, 금융 데이터와 같은 데이터에 액세스할 권한이 있으며 인증 및 권한 부여와 관련된 기본 구성 설정에 액세스할 권한이 있음을 확인합니다. 이러한 데이터에 액세스할 때 귀하는 기밀 정보 및 개인 데이터의 무단 수집, 저장, 사용, 공개 및/또는 처리로부터 보호하기 위해 관리적 및 기술적으로 합리적인 모든 보안 조치가 마련되어 있는지 확인해야 합니다(즉, 플랫폼의 유일한 용도로 나타내려는 것이 아님).\n\n### 1.4\n귀하는 귀하, 귀하의 직원 및 귀하의 사용자가 본 DPP에 동의하고 준수하도록 할 책임이 있으며, 본 DPP 및 여기에 설명된 조건에 명시된 관행, 요구 사항 및/또는 정책을 수락하는 데 동의합니다. 귀하가 회사(예: 귀하의 고용주) 또는 기타 법인을 대신하여 플랫폼에 액세스하고 사용하는 경우, 귀하는 해당 회사 또는 기타 법인을 본 DPP에 구속할 권한이 있음을 진술하고 보증합니다. 이 경우 \"귀하\" 및 \"귀하의\"는 해당 회사 또는 기타 법인을 의미합니다. 귀하는 해당 회사 또는 법인을 대신하여 본 DPP를 수락하고 해당 회사 또는 법인을 법적으로 구속할 권한이 있음을 진술하고 보증합니다. 그러한 권한이 없는 경우 본 DPP를 수락해서는 안 되며 고용주를 대신하여 서비스를 사용하거나 본 DPP에 대한 변경 사항을 인정하고 수락할 수 없습니다.\n\n## 2. 정의\n\n### 2.1\n\"API\"는 Shopee가 플랫폼을 통해 제공하는 응용 프로그래밍 인터페이스를 의미합니다.\n\n### 2.2\n\"애플리케이션\"은 귀하가 플랫폼에 액세스하고 통합된 Shopee API 서비스를 포함하거나 API 사용을 위해 사용자에게 기능을 제공하기 위해 플랫폼과 통합하여 개발한 소프트웨어 애플리케이션, 웹사이트 또는 모바일 앱을 의미합니다.\n\n### 2.3\n\"콘텐츠\"는 텍스트 및 기타 자료(데이터베이스, 텍스트, 그래픽, 사진, 스크린샷, 오디오, 비디오, Shopee 또는 제3자가 제공한 정보 및 자료, 또는 제3자의 정보 및 자료, 또는 데이터 처리에서 전송 피드백)를 포함하며 귀하의 애플리케이션을 지원하기 위해 제공됩니다.\n\n### 2.4\n\"DPP\"는 본 데이터 보호 정책(수시로 업데이트됨) 및 첨부 파일을 총칭합니다.\n\n### 2.5\n\"개인 데이터\" 또는 \"PD\"는 개인을 식별, 연락 또는 찾거나 그러한 식별, 연락 또는 찾기가 합리적으로 가능한 데이터를 의미합니다. \"개인 데이터\"에는 또한 (i) Shopee 콘텐츠의 오용; 또는 (ii) Shopee 콘텐츠 또는 Shopee 시스템에 대한 무단 액세스 또는 액세스 시도; 또는 (iii) Shopee 시스템의 간섭 또는 중단; 또는 (iv) DPP 및/또는 귀하와 당사 간의 모든 조건(Shopee Content API 서비스 수준 계약 및 API 이용 약관을 포함하되 이에 국한되지 않음) 위반; 또는 (v) Shopee 콘텐츠와 관련된 보안 사고 또는 이벤트가 실제로 발생했거나 의심되는 경우도 포함됩니다.\n\n### 2.6\n\"처리\"는 자동 수단에 의한 것인지 여부에 관계없이 데이터에 대해 수행되는 모든 작업 또는 작업 집합을 의미하며, 수집, 획득, 기록, 보유, 저장, 구성, 조정, 변경, 사용, 공개, 보급, 삭제, 손실, 파괴 또는 폐기를 포함하되 이에 국한되지 않으며 \"처리하다\" 및 \"처리된\"은 그에 따라 해석됩니다. \"처리 제한\"은 향후 처리를 제한할 목적으로 저장된 데이터를 표시하는 것을 의미합니다.\n\n### 2.7\n\"보호 데이터\"는 귀하가 플랫폼을 통해 수신, 액세스, 수집, 사용, 공개, 저장 및/또는 처리하는 모든 데이터를 의미하며, (a) 개인 데이터를 포함하거나; (b) Shopee 또는 그 계열사에 대해 상업적으로 기밀이거나; (c) 당사에 직접적인 재정적 기반을 제공하고, (d) 액세스 또는 공개가 Shopee 또는 그 고객 또는 비즈니스에 잠재적인 불리한 재정적 또는 평판 영향을 미칠 가능성이 있는 데이터(주문 및 제품 관련 정보, 결제 및 물류 정보, 판매자/구매자 프로필 및 정보 포함)를 의미하며, Shopee가 단독 재량으로 결정합니다(\"보호 데이터\").\n\n### 2.8\n당사자들은 귀하의 플랫폼 및 Shopee 다각형과의 통합을 구현하고 유지하는 과정에서 Shopee 서비스, 데이터, 컴퓨터, 시스템 또는 시설의 성능, 재정 또는 기타 관련 통계가 공유될 수 있음을 인정합니다. 또한 플랫폼에서 받은 정보 또는 해당 정보의 처리 및 관련 활동을 기반으로 귀하를 통해 생성될 수 있는 활동 및 기타 정보와 관련된 정보도 공유될 수 있습니다.\n\n### 2.9\n\"보안 침해\"는 Shopee 콘텐츠를 포함하는 유지 관리되는 모든 시스템(컴퓨터 시스템 및 네트워크 시스템을 포함하되 이에 국한되지 않음)의 보안에 대한 실제 또는 의심되는 손상, 손상 또는 침해를 의미합니다. 예를 들어 (i) 오용; (ii) 손실; (iii) 무단 액세스 또는 공개; (iv) 무단 획득; (v) 무단 수정; (vi) 기타 형태의 오용; 또는 (vii) 기타 무단 활동이 있습니다.\n\n### 2.10\n\"Shopee 콘텐츠\"는 Shopee 그룹의 데이터베이스에 저장되고 검색된 모든 데이터를 의미하며, (i) 사용자, 판매자 및 Shopee 그룹의 기타 이해 관계자의 개인 데이터; (ii) Shopee에 속하는 영업 비밀 또는 기타 독점 정보; 및 (iii) 귀하 또는 플랫폼 사용자와 관련된 기타 데이터를 포함하되 이에 국한되지 않습니다. \"시스템\"은 섹션 5.1에서 주어진 의미를 갖습니다.\n\n### 2.11\n다른 모든 대문자 용어는 API 서비스 약관에 정의된 것과 동일한 의미를 갖습니다.\n\n---\n\n## 3. 제한된 데이터\n\n### 3.1\n관련 법률(관련 데이터 보호 또는 개인 정보 보호 법률 및 규정을 포함하되 이에 국한되지 않음)에 따라 귀하는 다음의 경우 개인 데이터를 수집, 사용, 공개, 저장 및/또는 기타 방식으로 처리해서는 안 됩니다. (i) Shopee 서비스 약관 및 개인 정보 보호 정책에 따라 관리 제한 데이터의 기능 또는 목적에 필요하지 않은 경우. 제한된 데이터는 전체 신용 카드 또는 직불 카드 번호, 카드 확인 값(CVV) 코드 또는 은행 계좌 및 전체 계좌 번호/은행 코드/금융 기관에 보관된 금융 정보, 신분증, 국민 식별 번호, 운전 면허증 번호, 여권 번호 또는 정부 기관에서 발행한 유사한 정보(개별적으로 또는 다른 정보와 함께), 인종, 민족, 종교, 성적 지향, 트랜스젠더 상태, 가구 또는 기타 소득 또는 건강 또는 유전 데이터에 대한 정보; (ii) 관련 법률에 따라 데이터 주체로부터 적절하게 수집된 동의 범위 내에 있지 않은 경우; 및 (iii) 본 DPP를 준수하지 않는 경우.\n\n### 3.2\n섹션 3.1에 나열된 범위 내에 있지 않은 제한된 데이터를 귀하의 직원 및 사용자로부터 이전에 수집한 경우, 관련 법률의 요구 사항 및 그러한 위반에 따라 합리적으로 가능한 한 빨리 해당 데이터를 파기하거나 삭제해야 합니다. 귀하와 귀하의 직원은 본 DPP 및 당사와 체결한 기타 계약에 따라 사용 가능한 구제 수단을 행사하는 것과 관련하여 보증금을 확보하거나 게시해야 하는 요구 사항을 포기하는 데 동의합니다.\n\n---\n\n## 4. 보안 관리\n\n### 4.1\n귀하는 (i) 보호 데이터의 보안 및 무결성에 대한 예상되는 위협 또는 위험; 및 (ii) 개인, 비즈니스 또는 Shopee에 상당한 피해 또는 불편을 초래할 수 있는 무단 처리에 대한 적절한 관리적, 기술적 및 물리적 보호 장치를 포함하는 서면 정보 개인 정보 보호 및 보안 프로그램을 개발, 구현, 유지 관리 및 시행하여 Shopee 콘텐츠 및 보호 데이터의 기밀성, 무결성 및 가용성을 보호합니다.\n\n### 4.2\n섹션 4.1에 따라 요구되는 보안 프로그램은 보호 데이터의 기밀성 및 무결성을 보장하고 보호 데이터의 보안 및 무결성에 대한 예상되는 위협 또는 위험으로부터 보호하도록 합리적으로 설계되어야 합니다.\n\n### 4.3\n섹션 3.1에 따라 처리된 보호 데이터의 보안에 부정적인 영향을 미칠 수 있는 보안 프로그램의 주요 변경 사항에 대한 세부 정보를 제공합니다. 이러한 변경 사항이 보호 데이터의 보안에 부정적인 영향을 미칠 수 있는 경우, 귀하는 (해당 변경 사항을 구현하기 전에) Shopee와 협의하고 Shopee의 지시를 따라야 하며, 여기에는 해당 변경 사항을 연기하거나 구현하지 않거나 플랫폼 사용 및 액세스를 중단하도록 요구하는 것이 포함될 수 있지만 이에 국한되지 않습니다.\n\n### 4.4\n귀하는 Shopee가 귀하의 보안 프로그램 및 정보 보안 문제에 대해 Shopee와 통신하는 것을 포함하되 이에 국한되지 않고 본 DPP 준수 여부를 감사할 권리가 있음에 동의합니다(\"보안 책임자\").\n\n### 4.5\n귀하는 Shopee가 감사 과정에서 본 DPP를 준수하지 않는 것을 발견할 경우 Shopee가 플랫폼에 대한 액세스를 중단할 권리를 보유함을 인정합니다.\n\n### 4.6\n보안 침해를 경험하는 경우 합리적으로 가능한 한 빨리(그리고 어떤 경우에도 인지한 후 24시간 이내) Shopee에 알리고 해당 우려 사항과 관련된 위험 수준 및 영향을 받는 개인을 보호하기 위한 필요한 분할 법 집행 조치를 알려야 합니다. 귀하는 당사가 취할 수 있는 구제 조치에 제한 없이 포기하고 당사의 지시 및 요청에 신속하게 협조하고 응답하는 데 동의합니다. 침해 알림은 apisupport@shopee.com으로 문의하십시오. 또한 해당 보안 침해가 개인의 개인 데이터와 관련된 경우 데이터 개인 정보 보호 책임자(shopee-dpo-sg@shopee.com)에게 서면으로 통지하여 보안 침해를 알려야 합니다.\n\n### 4.7\nShopee 콘텐츠에 대한 무단 액세스를 즉시 Shopee에 알리는 것이 중요합니다.\n\n### 4.8\n사고 대응 계획: 애플리케이션 개발자의 경우 보안 침해로 인해 다음과 같은 다양한 범주의 피해가 발생할 수 있습니다.\n\n- (a) 본 DPP를 준수하기 위한 지적 자원 및 호스팅 손실; 및\n- (b) 귀하의 애플리케이션에 대한 소비자 보호, 무결성 및 신뢰 손실; 및\n- (c) 보안 침해로 인한 브랜드 평판 손실.\n\n귀하의 보안 프로그램이 본 DPP 및 유사한 서비스 수행을 포함한 기타 관련 요구 사항에 언급된 모범 사례 및 표준에 따라 사용자 개인 데이터를 적절하게 보호하지 못하는 경우.\n\n### 4.9\n귀하는 Shopee(및 승인된 제3자 대표)가 본 DPP 준수 여부를 확인할 수 있도록 상업적으로 합리적인 액세스 및 협력 권한을 부여하는 데 동의합니다. 귀하는 Shopee, 그 계열사 및 승인된 제3자 대표가 당사와 체결한 기타 계약 기간 중 및 이후에 본 DPP 준수 여부를 감사, 검사 및 평가할 권리가 있음에 동의합니다. 의심의 여지를 없애기 위해 이러한 검사 및 감사(\"감사\")는 적절한 액세스 역할 하에 수행되어야 하며 액세스는 \"알아야 할 필요\"에 따라 부여되어야 합니다.\n\n### 4.10\n귀하의 모든 직원이 교육을 받고 보안 업데이트 이벤트(액세스 및 권한 부여, 침입 시도, 취약성 및 오용 이벤트 처리)가 발생하는지 확인하기 위해 교육 메커니즘을 구현하고 적절한 보안 액세스가 직무 역할에 기반하도록 하는 데 동의합니다. 보안 관리 목적으로 Shopee 콘텐츠에 액세스합니다. 모든 로그에는 스토리지 콘텐츠에 대한 액세스 제어가 있어야 합니다. 모든 로그에는 데이터 침해를 방지하고 직원이 적절하게 교육되도록 돕기 위한 액세스 제어가 있어야 합니다. 여기에는 직원이 의심스러운 활동(예: 여러 번의 로그인 실패, 예상치 못한 필수 속도)에 대한 교훈을 통합하기 시작하기 위해 Shopee에서 제공할 수 있는 정기적으로 수행되는 교육 모듈을 거치는 것이 포함됩니다. 속도는 플랫폼 내 보호 데이터 동안 시스템의 보안을 기반으로 하며 보호 데이터의 보안을 위협할 수 있는 보안 침해를 가능한 한 빨리 제한하고 방지하거나 탐지하기 위해 로그를 보호해야 합니다.\n\n---\n\n## 5. 논리적 보안\n\n### 5.1\n본 DPP의 맥락에서 \"시스템\"은 귀하 또는 귀하의 직원이 플랫폼을 통해 Shopee 보호 데이터 및/또는 Shopee 콘텐츠에 액세스하거나 Shopee 보호 데이터 및/또는 Shopee 콘텐츠를 처리하는 데 사용하는 모든 소프트웨어, 하드웨어 및 시스템을 의미합니다. 본 DPP의 목적상 시스템에는 장치, 컴퓨터, 워크스테이션, 모바일 장치 및 서버가 포함되지만 이에 국한되지 않습니다.\n\n### 5.2\n귀하의 시스템은 다음 보안 요구 사항 및 제어를 준수해야 합니다.\n\n- a) 보호 데이터에 대한 무단 액세스를 모두 방지합니다.\n- b) 모든 시스템, 애플리케이션 및 프로그램은 최신 상태로 유지되어야 합니다.\n- c) 모든 맬웨어 방지 소프트웨어는 최신 상태이고 작동 중이며 시스템을 적극적으로 보호해야 합니다. 맬웨어 방지 소프트웨어는 최신 바이러스, 서명, 행동 및 휴리스틱 탐지 기능을 갖추고 있어야 하며 모든 시스템은 모든 파일을 검사하도록 구성되어야 합니다. 시스템 검사는 업계 표준 및 모범 사례에 따라 해당 서버 및 워크스테이션에서 실행되어야 합니다.\n- d) 사용자 액세스 제어 시스템은 액세스 권한 및 권한 부여를 위해 항상 업계 모범 사례에 따라 직무 역할을 기반으로 해야 합니다. 액세스 권한 및 권한 부여 침입 시도는 정기적으로 검토, 평가 및 감사되어야 하며 해고된 직원 또는 직무 기능이 변경된 직원의 계정은 즉시 취소되어야 합니다. 보호 데이터에 대한 모든 액세스 및 사용에 대한 자세한 시스템 로그는 귀하의 서면 정보 개인 정보 보호 및 보안 프로그램(위 섹션 4.1에 언급됨)에 문서화되어야 합니다.\n- e) 모든 시스템은 내부 액세스(즉, 직원의 오용 없음) 또는 보호 데이터 제한 또는 안전하지 않은 내부 또는 외부 네트워크를 통해 해당 데이터 전송을 위해 명확하게 식별되어야 합니다.\n- f) 모든 시스템에는 무단 액세스 또는 수정 또는 중단을 방지하기 위한 보안 제어가 장착되어야 합니다.\n- g) 귀하의 애플리케이션, 앱 운영에 적절한 방화벽 기술을 모두 배포하고 시스템, 네트워크 및 플랫폼 사용 시스템의 외부 연결에 대한 액세스를 보호하고 인증합니다. 방화벽은 강력한 암호화를 용이하게 하기 위해 최고 표준 암호화로 구성되어야 합니다.\n- h) Shopee 콘텐츠에 액세스하는 경고를 생성, 모니터링 및 응답하기 위해 침입 탐지 및 방지 시스템을 모두 배포합니다.\n- i) 귀하의 사용자 및 직원의 모든 활동에 대한 보안 운영에 대한 모든 액세스.\n\n### 5.3\n위의 내용에 국한되지 않고 귀하는 시스템의 최소 암호 정책, 다음 (1)년의 최소 암호 정책을 포함하되 이에 국한되지 않고 Shopee 보호 데이터의 안전을 보장하기 위해 당사가 수시로 귀하에게 요청할 수 있는 합리적인 보안 요구 사항을 준수하는 데 동의합니다.\n\n### 5.4\n귀하는 보호 데이터 및/또는 Shopee 콘텐츠를 저장하는 시스템에 대한 네트워크 액세스를 제한하기 위해 효과적인 네트워크 분할을 구현하는 데 동의합니다. 귀하는 가능한 경우 해당 네트워크를 다른 네트워크 및 시스템과 논리적으로나 물리적으로 분리하여 맬웨어가 분리된 네트워크에 침투할 가능성을 최소화하는 데 동의합니다. 귀하는 세그먼트 및 영역 간의 트래픽 흐름을 허용하거나 거부하기 위한 정책 기반 접근 방식을 구현하고 다음을 충족하기 위해 무선 네트워크의 최종 사용자 관리를 구현합니다.\n\n- i) Shopee 콘텐츠에 대한 권한 있는 액세스 권한이 있는 모든 계정에 대한 Shopee의 암호 복잡성 및 암호 변경 요구 사항 준수; 및\n- ii) 시스템 네트워크에 대한 모든 네트워크 액세스는 권한 있는 사람으로 제한되어야 합니다.\n- iii) Shopee 콘텐츠에 액세스하거나 처리하는 모든 직원은 고유한 ID 장치 인증서, 키 또는 일회용 암호를 가지고 있어야 합니다.\n- iv) 모든 원격 액세스 보안 조치는 Shopee 콘텐츠에 액세스하는 직원의 모든 활동에 대한 변경 사항을 제어, 보호 및 정기적으로 모니터링하도록 구성되어야 하며 검토를 위해 모든 변경 사항에 대한 세부 정보를 유지 관리해야 합니다.\n- v) 모든 무선 연결 인식은 업계 표준 암호화 알고리즘(즉, 최소 Wi-Fi Protection Access 2(WPA2))을 사용하여 사고로 발생합니다.\n- vi) Shopee 콘텐츠에 액세스할 수 있는 모든 개인 시스템(즉, 회사에서 발행하지 않음)(허용되는 경우)은 최소 보안 표준을 충족하도록 구성되어야 합니다. 이러한 시스템은 Shopee 콘텐츠를 처리하는 데 사용해서는 안 되며 정기적으로 자격이 없는 직원 또는 무선 침입 방지 시스템이 되어야 합니다. 로그는 20일 이상 보관해야 합니다.\n\n### 5.5\n귀하는 직원의 Shopee 콘텐츠에 대한 액세스를 알아야 할 필요에 따라 제한하는 효과적인 논리적 액세스 제어를 수행, 구현 및 유지 관리하고 시스템 및 네트워크에 액세스하는 데 사용되는 모든 계정이 관리 목적으로 유지 관리되도록 해야 합니다. Shopee는 목적 시스템 장치 및 시스템에 대한 적절한 액세스 제어만 유지 관리됩니다. 귀하는 플랫폼에 액세스하고 언제든지 Shopee 콘텐츠에 액세스하거나 처리하는 모든 장치 및 시스템의 업데이트된 인벤토리 기록을 유지 관리해야 합니다. 귀하는 회사 내에서 정보 보안 관리의 모든 측면을 감독하고 데이터 액세스 제어와 관련된 모든 문제에서 Shopee와 협력하고 Shopee 콘텐츠와 관련하여 발생하는 보안 침해에 대응할 책임이 있는 최소 한 명의 유능한 사람을 지정하는 데 동의합니다. 항상 데이터 승인 액세스 지점을 감독하고 적절하게 행동할 수 있는 적절한 기술과 지식을 갖추고 있습니다.\n\n### 5.6\n논리적 액세스 제어가 있어야 하며 관련 사용자 권한은 분리되고 안전한 액세스 환경 내에서 발생해야 합니다. 따라서\n\n---\n\n# 개발자 가이드 - 보안 및 규정 준수 문서\n\n## 5. 일반 보안\n\n관리 목적. SaaStr는 무선 서비스를 전송 가능하게 제공하는 적절한 액세스 제어만 유지 관리됩니다. 이는 기본적으로 관례적으로 함께 정렬되어 전송 가능하게 판매되거나 공유되지 않습니다.\n\n액세스 포인트가 마련되어 있습니다. 무선 솔루션을 배포하지 않은 경우에도 무선 장치가 적절하게 유지 관리되었는지 확인하기 위해 이 분기별로 연락해야 합니다.\n\n무선 워크그룹. 게스트 액세스 권한이 있는 워크스테이션은 무선 소프트웨어로 설정되어 있으며 장치는 안전해야 하며 장거리는 준수해야 합니다.\n\n# 개발자 가이드 - 보안 및 규정 준수 문서\n\n## 5. 일반 보안\n\n관리 목적. SaaStr는 무선 서비스를 전송 가능하게 제공하는 적절한 액세스 제어만 유지 관리됩니다. 이는 기본적으로 관례적으로 함께 정렬되어 전송 가능하게 판매되거나 공유되지 않습니다.\n\n액세스 포인트가 마련되어 있습니다. 무선 솔루션을 배포하지 않은 경우에도 무선 장치가 적절하게 유지 관리되었는지 확인하기 위해 이 분기별로 연락해야 합니다.\n\n무선 워크그룹. 게스트 액세스 권한이 있는 워크스테이션은 무선 소프트웨어로 설정되어 있으며 장치는 안전해야 하며 장거리는 준수해야 합니다.\n\n점점 더 정교해지는 프로덕션 환경을 포함하여 무선 보안 침해를 방지, 탐지 및 해결해야 합니다. 그러나 Stripe는 프로덕션 환경에서 지원 사진을 제공하지 않는 한 서비스 수준 계약을 제공하지 않습니다.\n\n## 6. 시스템 개발 및 유지 관리\n\n6.1 귀하는 나의 보호된 데이터를 처리하거나 저장하는 모든 애플리케이션에 대한 전체 시스템, 네트워크 및 애플리케이션 아키텍처, 데이터 흐름, 프로세스 흐름 및 보안 경계에 대한 문서를 유지 관리해야 합니다. 아키텍처 및 데이터 흐름 설문지를 정기적으로 제출해야 합니다.\n\n6.2 귀하는 모든 시스템과 애플리케이션을 적절하게 최신 상태로 유지하기 위해 시스템 및 소프트웨어 패치 관리 프로세스를 유지 관리해야 합니다. 귀하는 모든 개발 직원이 안전한 프로그래밍 교육을 성공적으로 받았는지 확인해야 하며 Stripe는 이 확인을 요구합니다.\n\n6.3 귀하는 업계 모범 사례 원칙을 활용하여 강력한 소프트웨어 개발 수명 주기(SDLC)를 유지 관리해야 합니다.\n\n6.4 귀하는 본 계약의 섹션 3(허용된 사용)에 따라 제공되는 서비스와 관련하여 효과적이고 문서화된 변경 관리 프로그램을 사용합니다. 프로덕션 또는 프로덕션 지원 환경에 대한 모든 종류의 변경 사항은 문서화, 승인 및 로깅을 포함한 정의된 변경 관리 프로세스를 거쳐야 합니다.\n\n6.5 귀하는 내부 및 외부 네트워크를 실질적으로 최소 분기별 패리티로 사용하고 모든 내부 변경 프로세스를 따라야 합니다. 여기에는 처리가 발생하는 네트워크가 포함되며 정의된 합법적인 비즈니스 목적으로 액세스해야 하는 개인으로만 액세스를 제한합니다.\n\n6.6 귀하는 문서화된 관리 절차를 사용하여 프로덕션 환경을 관리합니다. 무선 액세스 포인트를 배포하지 않은 경우에도 네트워킹 환경의 현재 상태에 대한 업데이트를 위해 분기별로 문의해야 합니다. 업계에서 인정하는 조직에서 식별한 일반적인 보안 취약점을 식별하기 위한 모든 보안 관련 검토는 OWASP Top 10 및/또는 CWE/SANS Top 25에서 식별한 일반적인 취약점으로 제한되지 않습니다.\n\n6.7 귀하는 프로덕션 및 테스트 환경에서 작동하는 소프트웨어가 관련 보안 제어를 기반으로 배포 전에 검증되었는지 확인해야 합니다.\n\n6.8 화주 콘텐츠를 수집, 전송 또는 표시하는 모든 모바일 애플리케이션에서 귀하는 모바일 애플리케이션에 특정한 업계에서 인정하는 취약점을 식별하고 수정하기 위해 애플리케이션 보안 평가 검토를 수행하는 데 동의합니다.\n\n6.9 귀하는 화주 콘텐츠를 처리하거나 저장하는 시스템 및 네트워크에서 맬웨어 탐지 및 방지 제어를 유지 관리해야 합니다. 맬웨어가 탐지된 경우 전체 영향 또는 감염이 다른 시스템으로 확산되는 것을 방지하기 위한 조치를 취해야 합니다. 귀하는 정기적으로 시작되는 모범 사례를 유지 관리해야 하며 관련 정책은 화주가 서면으로 검토하고 승인합니다. 유지 관리 로그는 요청 시 제공되어야 합니다.\n\n6.10 귀하는 승인된 암호화된 방식으로 모든 암호를 저장하고 90일마다 마스터 자격 증명 변경이 있는지 로그를 추적하고 모니터링합니다. 화주는 규정 준수 실패로 인해 발생하는 손실 또는 손해에 대해 책임을 지지 않습니다.\n\n6.11 귀하의 컴퓨팅 환경은 패치의 중요성에 따라 예정된 일정에 따라 진행됩니다. 귀하는 필요한 지침에 따라 독립적으로 패치 수준 평가를 수행해야 합니다. 화주는 문서를 통해 정보 자원의 보안을 합리적으로 확인합니다. 귀하는 화주의 책임을 제한하거나 채무 불이행 시 현재 또는 이후에 당사가 사용할 수 있는 권리 또는 구제 수단을 손상시키지 않습니다.\n\n## 7. 이메일 보안\n\n7.1 귀하는 수년 동안 적절한 이메일 ID 솔루션이 활용될 것입니다.\n\n## 8. 보안 평가 및 감사\n\n8.1 귀하는 화주 콘텐츠를 처리 및/또는 저장하는 모든 시스템 및 주요 IT 자산의 선언을 선택하기 위해 감사하고 스캔합니다. 이 선언에는 화주 콘텐츠의 처리 또는 저장에 사용되는 모든 시스템, 인프라 및 소프트웨어의 최신 및 정확한 아키텍처 묘사 및 인벤토리가 포함됩니다.\n\n8.2 귀하는 업계 모범 사례에 따라 모든 시스템에 대한 정기적인 취약점 스캔을 포함하되 이에 국한되지 않는 포괄적인 취약점 관리 프로그램을 유지 관리하는 데 동의합니다.\n\n8.3 귀하는 화주가 수시로 화주 콘텐츠를 처리하거나 저장하는 귀하의 시스템 및 인프라에 대한 보안 감사(예: 취약점 스캔)를 수행할 수 있다는 데 동의합니다. 모든 스캔은 귀하와 협력하여 수행되지만 귀하는 화주가 합리적으로 요청할 수 있는 스캔을 구현해야 합니다.\n\n8.4 화주 콘텐츠가 귀하의 환경에 도입되는 경우 귀하는 모든 외부 또는 내부 인프라에 대한 연간 침투 테스트에 동의합니다.\n\n8.5 귀하는 해당 법률에 따라 귀하의 데이터 처리 시설, 절차 및 문서가 화주 또는 지정된 제3자에 의해 검사 및 감사를 받을 수 있도록 합리적인 통지를 제공합니다. DPO 또는 적절한 대체 또는 관련 담당자는 이러한 감사 및 검사에 포함되어야 합니다. 귀하는 적절한 보안 검토를 수행하기 위해 관련 문서/인력에 대한 화주 액세스를 제공하는 데 동의합니다.\n\n8.6 귀하는 화주 콘텐츠를 처리 및/또는 저장하는 데 사용되는 관련 프로덕션 시스템에 대한 액세스를 지속적으로 감사 로그하고 모니터링합니다.\n\n8.7 귀하는 서비스에 대한 서비스 수준 계약에 따라 보안 검사, 감사 노력 및 화주의 요청과 함께 감사 로그를 감사합니다. NIST 업계 선도적인 관행을 기반으로 업계 표준 로그 검토 및 에스컬레이션 절차를 유지 관리하고 화주 또는 감사자가 사용 가능한 감사 로그를 검토할 수 있도록 지원합니다. 화주 감사자가 귀하의 로그 및 시스템을 검토하려는 경우 해당 액세스를 사용할 수 있어야 하며 귀하의 서비스 사용을 즉시 식별해야 합니다.\n\n## 9. 사고 대응 및 통지 절차\n\n9.1 귀하는 (i) 화주 콘텐츠의 기밀성, 무결성 및 가용성을 보호하는 것이 명시적이고 정의된 목표인 효과적인 정보 보안 사고 대응 절차를 마련해야 합니다. 정보 및 위험에 처한 모든 화주 콘텐츠의 일부로 사고의 유해한 영향을 완화하기 위해 합리적인 모든 조치를 취해야 합니다. 귀하는 또한 사고와 관련하여 합리적인 조사 조치를 수행해야 합니다.\n\n절차에는 다음이 포함되어야 합니다.\n\n- (a) 액세스 부족, 허용되지 않은 공개 또는 기타 손상된 것으로 합리적으로 믿어지는 화주 콘텐츠의 식별;\n- (b) 본 약관에 따른 화주에 대한 통지;\n- (c) 사고에 서비스 계정 또는 암호가 포함된 경우 암호가 적절하게 비활성화됩니다.\n- (d) 사고 범위 내에서 사고에 관련된 화주 콘텐츠 유형에 대한 설명이 포함됩니다.\n- (e) 근본 원인에 대한 간략한 요약(또는 사고가 여전히 조사 중인 경우 발견 시 정보에 대한 설명);\n- (f) 화주 콘텐츠가 암호화되었는지 여부; 그리고\n- (g) 화주가 합리적으로 요구할 수 있는 기타 정보.\n\n귀하는 영향을 받는 데이터 주체에 대한 중복 원인을 제공하는 것과 같이 책임 있는 통지에 대해 화주가 합리적으로 사전에 전달한 모든 기간 내에 해당 정보를 제공합니다.\n\n9.2 귀하는 영향을 받는 데이터 주체에 대한 중복 원인을 제공하는 것과 같이 조사 및 포렌식 또는 감사 기록을 용이하게 하기 위해 화주 콘텐츠에 대한 액세스에 대한 적절한 로깅 및 모니터링을 사용합니다. 귀하는 해당 데이터 주체에 대한 중복 원인을 제공하는 것과 같이 해당 사항의 식별 및 수정에서 화주와 협력합니다.\n\n9.3 귀하는 잘 관리된 사고에서 필요에 따라 조사 및 포렌식에서 화주와 협력합니다. 귀하는 모든 사고 조사에서 개인 데이터 처리에 관련된 데이터 주체 및/또는 감독 기관에 통지를 제공해야 하는지 여부(그렇다면 시기 및 내용)를 결정하기 위해 화주와 협력합니다. 조사 완료 시 요약이 화주에게 제공됩니다.\n\n사고를 감지하거나 인지한 후 처음 72시간 이내에 다음을 제공합니다.\n\n- (a) 사고의 성격;\n- (b) 공개되거나 손상되거나 변경된 화주 콘텐츠의 표시;\n- (c) 실제 또는 합리적으로 발생할 수 있는 피해를 포함하여 사고의 예상 결과 및 심각도;\n- (d) 재발을 방지하고 데이터 주체 및 화주에 대한 피해를 완화하기 위한 권장 조치; 그리고\n- (e) 추가 사고의 위험을 완화하기 위해 취한 모든 노력.\n\n## 10. 저장, 처리 및 폐기\n\n9.4 귀하는 화주에게 완전히 통지하고 복구 조치 계획, 격리 및 화주 콘텐츠 폐기를 확인해야 합니다. 개인 데이터, 전송된 데이터 및 이 경로의 적용을 받는 제한된 콘텐츠.\n\n10.1 귀하는 화주 콘텐츠의 보안 폐기가 사이버 클라이언트 데이터 없이 수행되도록 보장합니다.\n\n당사 계약에 따른 서비스 종료 시 또는 화주가 달리 요청하는 경우 귀하는 화주 콘텐츠와 저장 위치가 삭제 또는 저장될 출력 또는 자료(무선 네트워크)를 영구적으로 복구할 수 없도록 삭제, 파기 및/또는 반환합니다.\n\n10.2 귀하는 프로덕션에 저장된 입력 문자열에 충분히 생성된 키가 추가된 적절한 백업 저장 알고리즘을 사용합니다. 귀하는 백업 시설, 백업 미디어 및 복원된 자격 증명이 충분히 안전한 위치에 있는지 확인하는 데 동의합니다.\n\n10.3 데이터 센터 외부에서 사용되는 모바일 장치(예: \"랩톱, 데스크톱 태블릿)가 본 계약에 따라 서비스를 수행하는 경우.\n\n10.4 종이 파쇄 및 디지털 데이터의 경우 폐기 시 저장 매체의 포맷(즉, 닦아내기)은 덮어쓰기(즉, 저장 지속성 닦아내기 또는 DoD에 요약된 콘텐츠 지침 또는 업계 표준에 가까운 닦아내기: ISO 27001; SSAE-18 또는 둘 다; 및/또는 PCI)에서 일관되게 데이터 센터에 저장되어야 합니다.\n\n10.5 귀하가 본 섹션에 설명된 대로 화주 콘텐츠 파기에 완전히 적절하게 구속될 것이며 데이터가 파기되기 전에 서면 확인을 받고 보관할 것임을 입증하고 증명하기 위해 화주는 수시로 화주 콘텐츠가 귀하의 환경에서 파기되었음을 보여주는 서면 인증을 요청하고 합리적인 기간 내에, 그러나 당사로부터 수령한 후 30일 이내에 파기할 수 있습니다.\n\n귀하는 다음 사항을 인정하고 동의합니다.\n\n- (a) 섹션 10.1에 요청된 대로 보호된 데이터를 저장하는 데 사용되는 모든 미디어를 전송하거나 파기합니다. 그리고\n- (b) 해당 보호, 파기 및 복사 요청을 지원하는 모든 휴대용 장치 또는 휴대용 미디어는 본 섹션 10에 달리 제공된 대로이며 해당 미디어를 보관하지 않습니다. 모든 파기는 인증되어야 합니다.\n\n10.6 귀하는 귀하와 표준 통신에 사용하지 않는 권한을 고려하여 본 계약에 필요한 최소 기간 동안만 화주 콘텐츠를 보관합니다. 화주는 수정 요청에 대한 서면 통지를 제공하고 전자 메일, 팩스 전송, 문자 메시지 및 서비스를 지원하는 인스턴트 메시지를 포함하되 이에 국한되지 않는 해당 미디어를 화주에게 즉시 반환합니다.\n\n10.7 서비스 또는 본 계약이 종료되는 경우 귀하는 사용 가능한 방식으로 화주 콘텐츠를 수정하지 않으며 귀하의 서비스 사용이 즉시 종료됩니다.\n\n10.8 귀하는 측정된 데이터 및 제한된 데이터(고객 이름 및 암호 포함하되 이에 국한되지 않음)의 사본을 다른 데이터와 물리적으로 분리하고 적절하게 암호화하고 계약에 명시된 조건 및 합리적인 업계 표준 방법에 따라 백업하는 데 동의합니다. 화주는 해당 데이터에 대한 귀하의 권리를 합리적으로 식별하는 데 동의합니다. 해당 보존 기간이 만료되면 보존된 모든 데이터는 Clausul에 따라 폐기되고 섹션 10에서 파기됩니다.\n\n10.9 귀하는 계약에 따라 또는 해당 법적 보존 기간이 만료되면 더 빠른 시기에 전송된 데이터 및/또는 제한된 콘텐츠를 프로덕션 환경에서 폐기해야 합니다. 데이터 보안이 완전히 파기되고 표준 고무결성 폐기 또는 조항에서 합리적이거나 합리적인 조항에 따라 복구할 수 없도록 보장하는 방식으로 폐기해야 합니다.\n\n화주에게 폐기 완료를 통지해야 합니다. 화주는 손상되거나 작동하지 않는 보호된 데이터를 확인하는 정보를 직접 검토하고 요청하고 구현할 권리를 보유합니다. 모든 보호된 데이터는 귀하가 서면으로 작성하거나 파기 서면으로 작성한 경우 복구할 수 없도록 렌더링되어야 합니다.\n\n화주는 귀하의 폐기 프로세스를 감사할 권리를 보유합니다.\n\n## 11. 소유권 및 사용\n\n11.1 귀하는 귀하와 화주 간의 해당 법적 계약에 명시적으로 명시된 것 외에 화주 콘텐츠에 대한 소유권 또는 사용할 권리가 없음을 인정하고 동의합니다. 사고(화주 콘텐츠에 대한 무단 액세스, 공개, 변경 또는 손실을 포함하되 이에 국한되지 않음)가 발생한 경우 즉시 화주에게 통지하고 서비스 약관에 명시적으로 제공되거나 화주가 서면으로 명시적으로 승인한 대로 협력해야 합니다.\n\n11.2 귀하는 서비스를 제공하는 데 필요한 경우에만 화주 콘텐츠를 사용하고 화주가 구체적으로 승인한 목적 이외의 다른 목적으로 화주 콘텐츠를 사용하거나 공개하지 않습니다.\n\n## 12. 지불 카드 산업 규정 준수\n\n12.1 귀하가 섹션 6에 동의하는 경우 신용 카드 소지자의 정보를 전송, 처리, 처리, 액세스, 유지 관리 또는 저장할 때마다 해당 약관에 따라 모든 요구 사항을 충족했습니다.\n\n12.2 귀하가 화주를 대신하여 신용 카드 소지자 정보를 전송, 처리, 처리, 액세스, 유지 관리 또는 저장하거나 신용 카드 소지자 정보를 전송, 처리, 액세스, 처리, 유지 관리 또는 저장하는 화주의 시스템과 저장 환경을 공유하는 경우 모든 해당 지불 카드 산업 데이터 보안 표준(PCI-DSS)을 충족해야 합니다. 요청 시 적절한 PCI-DSS 요구 사항을 충족했음을 적절하게 증명한 규정 준수 보고서(ROC) 또는 자체 평가 설문지(SAQ)를 통해 서면 규정 준수 증명을 제공해야 합니다. 또한 요청 시 카드 제시, 전자 상거래 또는 우편 주문/전화 주문 카드 미제시 환경에 대한 문서를 제공해야 합니다. 귀하 또는 귀하의 사용자가 소유, 관리 또는 통제 하에 있는 모든 직불 카드 및 신용 카드 소지자의 정보를 직접적으로 또는 야기하는 경우 귀하는 전적으로 책임을 집니다.\n\n## 13. 준거법; 분쟁\n\n13.1 플랫폼 및/또는 서비스 사용은 해당 법률에 따라 규율되고 해석됩니다.\n\n13.2 당사 계약의 어떤 조항도 화주가 DPI와 관련된 명령을 구하기 위해 관련 관할권을 가진 법원에서 소송을 제기하는 것을 방해하지 않습니다. 여기에는 형성, 유효성, 존재, 위반 또는 종료에 대한 모든 청구(각 청구를 \"분쟁\"이라고 함)가 포함됩니다. 화주는 모든 해당 관할권을 가진 법원에서 소송을 제기할 수 있습니다. 관할권은 소송을 제기하는 당사자의 관할권이며 당사자는 인적 관할권 또는 재판지에 대한 모든 청구 또는 이의를 명시적으로 포기합니다. 중재로 인한 모든 판정 또는 판결은 본 계약에만 적용이 제한됩니다. 본 중재 조항의 사용은 존재할 수 있는 배심 재판에 대한 권리의 포기로 해석되어서는 안 됩니다. 본 계약의 어떤 조항도 중재 조항이 아일랜드 및 싱가포르 법원으로 해석되어서는 안 됩니다. 중재 조항은 당사자 간에 합의된 중재인 1명으로 구성되거나 그렇지 않은 경우 분쟁이 발생한 후 30일 이내에 당사자가 중재인 선택에 합의할 수 없는 경우. 중재인 1명이 선택된 경우 당사자가 합의한 중재인이 임명되거나 합의가 없는 경우 아일랜드 법률 협회 회장이 임명하며, 이는 아일랜드의 현역 회원이어야 하며, 당사자를 대신하여 임명된 두 명의 중재인이 절차에서 두 번째 중재인 임명일로부터 60일 이내에 협력하여 선택해야 합니다. 관할권은 영어여야 합니다. 판정 결정을 포함한 중재는 임명일로부터 90일 이내에 완료되어야 합니다. 결정에 도달했습니다. 결정은 최종적이며 당사자를 구속합니다. 중재 언어는 영어여야 합니다. 작성된 중재 판정은 중재 재판소의 지침을 받으며 당사자가 통합하거나 본 계약에 가입할 수 없는 경우 양 당사자를 구속합니다.\n\n13.3 본 조항의 어떤 조항도 화주가 금지 명령 구제를 위해 법원에 즉시 의지하는 것을 방해하지 않습니다.\n\n## 14. 개인 데이터 처리\n\n# 14. 개인 데이터 처리\n\n14.1 귀하는 해당 법률에 따라 개인 데이터를 처리하고 항상 해당 법률에 따른 최소 기준을 충족하는 개인 정보 보호 정책을 유지 관리하고 준수해야 합니다.\n\n14.2 Shopee와 개인 데이터를 공유하기 전에 데이터 주체가 Shopee의 개인 정보 보호 관행에 대해 적절하게 통지받고 동의했는지 확인해야 합니다. 귀하는 Shopee와 개인 데이터를 수집하고 공유할 수 있는 합법적인 근거와 적절한 권한이 있음을 보증합니다.\n\n14.3 다음 조항은 Shopee 콘텐츠에서 얻거나 파생된 개인 데이터 처리에 적용됩니다.\n\n- (a) 귀하와 Shopee 간의 해당 개인 데이터와 관련하여 귀하는 데이터 중개자이며 본 DPP에 따라 Shopee를 대신하여 개인 데이터를 처리해야 합니다.\n\n- (b) 귀하는 서비스 약관 및 Shopee의 서면 지침에 따라 귀하의 애플리케이션을 개발, 운영 및 유지 관리하는 데 필요한 범위 내에서만 해당 방식으로 개인 데이터를 처리해야 합니다.\n\n- (c) 귀하는 하위 프로세서를 사용할 권한이 있습니다. 단, (i) 귀하는\n14.2 Shopee와 개인 데이터를 공유하기 전에 귀하는 데이터 주체에게 Shopee의 개인 정보 보호 관행에 대해 적절히 통지하고 동의를 받아야 합니다. 귀하는 Shopee와 개인 데이터를 수집하고 공유할 수 있는 합법적인 근거와 적절한 권리를 가지고 있음을 보증합니다.\n\n14.3 다음 조항은 Shopee 콘텐츠에서 얻거나 파생된 개인 데이터의 처리에 적용됩니다.\n\n- (a) 해당 개인 데이터와 관련하여 귀하와 Shopee 간의 관계에서 귀하는 데이터 중개자이며 본 DPP에 따라 Shopee를 대신하여 개인 데이터를 처리해야 합니다.\n\n- (b) 귀하는 서비스 약관 및 Shopee의 서면 지침에 따라 귀하의 애플리케이션을 개발, 운영 및 유지 관리하는 데 필요한 범위 내에서만 해당 방식으로 개인 데이터를 처리해야 합니다.\n\n- (c) 귀하는 하위 프로세서를 사용할 권한이 있습니다. 단, (i) 귀하는 하위 프로세서에 본 DPP에 따른 의무만큼 엄격한 데이터 보호 의무를 부과하는 계약을 체결하고, (ii) 요청 시 상기 계약 사본을 Shopee에 즉시 제공할 것을 약속하며, (iii) 본 DPP의 요구 사항을 준수하지 않는 하위 프로세서의 행위 또는 누락에 대해 책임을 져야 합니다.\n\n- (d) 귀하는 관련 법률을 위반하여 개인 데이터가 국경을 넘어 전송되도록 하거나 허용해서는 안 됩니다. 관련 법률에 의해 법적 제한이 적용되는 개인 데이터의 국경 간 전송에는 Shopee의 사전 서면 동의가 필요합니다. 의심의 여지를 없애기 위해, 이 전송 제한은 Shopee 직원의 개인 데이터 액세스에는 적용되지 않습니다.\n\n- (e) 법적으로 허용되는 범위 내에서 귀하는 개인 데이터의 생산을 요청, 요구 또는 강제하는 것으로 보이는 명령, 요구 또는 문서를 받은 즉시 Shopee에 서면으로 통지해야 합니다. 귀하는 Shopee가 해당 공개를 방지하거나 제한하기 위해 관련 법률에 따라 가질 수 있는 권리를 자체 비용으로 행사할 수 있도록 Shopee에 최소 48시간 전에 통지하지 않고는 제3자에게 개인 데이터를 공개해서는 안 됩니다. 전술한 내용에도 불구하고 귀하는 그러한 공개를 방지하고 제한하며 개인 데이터의 기밀성을 유지하기 위해 상업적으로 합리적인 노력을 기울일 것입니다. 또한 귀하는 적절한 보호 명령을 받거나 개인 데이터에 기밀 처리가 적용될 것이라는 기타 신뢰할 수 있는 보장을 포함하여 해당 명령, 요구 또는 기타 문서 요청에 따라 취해진 조치와 관련하여 Shopee와 협력할 것입니다.\n\n- (f) 귀하는 Shopee가 귀하에 대한 통지 또는 책임 없이 단독 재량으로 귀하의 계정 또는 플랫폼 및 서비스에 대한 액세스를 즉시 중단 또는 종료하고, 귀하의 계정과 관련된 모든 콘텐츠를 사이트에서 제거하거나 폐기하고, Shopee가 자신과 보호된 데이터를 보호하는 데 필요하다고 판단하는 기타 조치를 취할 수 있다는 데 동의합니다. 이러한 조치의 근거에는 실제 또는 의심되는 (a) 장기간의 비활성, (b) 본 DPP의 문구 또는 정신 위반, (c) 보안 감사에 협조하지 않거나 Shopee가 요구하는 합리적인 시정 조치를 취하지 않는 것을 포함한 귀하의 보안 실패, (d) 귀하 또는 귀하의 고객에게 귀책 사유가 있는 데이터 유출 또는 손실, 또는 (e) Shopee 사용자, 제3자 또는 Shopee의 사업 이익에 해로운 기타 행위가 포함될 수 있지만 이에 국한되지 않습니다. 불법, 사기, 괴롭힘, 명예 훼손, 위협 또는 학대 목적으로 계정을 사용하는 경우 귀하에게 통지 없이 법 집행 기관에 회부될 수 있습니다. 사용 가능한 다른 구제 수단에 대한 제한 없이 귀하의 계정 또는 귀하의 서비스 사용과 관련된 법적 분쟁이 발생하거나 법 집행 조치 또는 기타 규제 조사가 시작되는 경우 Shopee는 통지 여부에 관계없이 귀하의 계정을 즉시 종료할 수 있습니다.\n\n- (g) 서비스 약관에 따라 제공되는 다른 구제 수단 또는 배상에 대한 제한 없이 귀하는 Shopee와 그 주주, 자회사, 계열사, 이사, 임원, 대리인, 공동 브랜드 제공자 또는 기타 파트너 및 직원(총칭하여 \"피배상 당사자\")을 배상하고 방어하며 보호할 것에 동의합니다. Shopee 또는 피배상 당사자가 입은 모든 손실, 청구, 소송, 절차 및 소송과 관련된 모든 책임, 손해, 합의금, 벌금, 과태료, 비용 및 지출(다른 분쟁 해결 비용 포함)은 다음으로 인해 발생하거나 관련되어 발생합니다. (a) 본 DPP 또는 여기에 언급된 정책 또는 지침의 조항을 위반하거나 위반하는 경우, (b) 귀하의 플랫폼, Shopee 콘텐츠, 제한된 데이터, 보호된 데이터 및/또는 개인 데이터의 사용 또는 오용, (c) 관련 데이터 보호법을 포함한 법률 또는 제3자의 권리를 위반하는 경우.\n\n# 15. 유효 기간\n\n본 DPP에 따른 귀하의 의무와 Shopee의 권리는 귀하가 플랫폼에 액세스한 날부터 효력이 발생하며, 서비스 약관이 종료될 때까지, 그리고 귀하와 귀하의 직원이 보호된 데이터를 소유하거나 액세스하는 기간 동안 계속 유효합니다.",
  "metadata": {
    "title": "Shopee Open Platform Data Protection Policy",
    "summary": "This guide outlines the data protection and information security standards required for developers integrating with the Shopee Open Platform. It defines key terms related to data protection and specifies restrictions on data handling to ensure compliance and security.",
    "keywords": [
      "Data Protection",
      "Personal Data",
      "Protected Data",
      "Security Breach",
      "API",
      "Shopee Open Platform",
      "Data Processing",
      "Compliance"
    ],
    "category": "Data Protection",
    "tags": [
      "Security",
      "Privacy",
      "Compliance",
      "API",
      "Terms of Service"
    ],
    "difficulty": "medium",
    "importance": 5,
    "use_cases": [
      "Integrating with Shopee APIs",
      "Developing applications using the Shopee Open Platform",
      "Handling user data within the Shopee ecosystem",
      "Ensuring compliance with Shopee's data protection policies",
      "Responding to security incidents involving Shopee data"
    ],
    "related_apis": [
      "Shopee Content API"
    ]
  },
  "vector": [
    -0.024055682122707367,
    -0.03246631473302841,
    -0.08695290237665176,
    0.01763788051903248,
    -0.031345468014478683,
    -0.03289790078997612,
    -0.00027501623844727874,
    -0.004238086752593517,
    0.013301950879395008,
    0.027036679908633232,
    0.015219793654978275,
    0.03966493159532547,
    -0.015515382401645184,
    -0.013796352781355381,
    0.010386515408754349,
    0.005352083593606949,
    -0.005390522535890341,
    -0.01824215054512024,
    -0.005203105043619871,
    -0.019183345139026642,
    -0.013840937986969948,
    0.021386850625276566,
    -0.005685041192919016,
    -0.008960383012890816,
    0.007242032792419195,
    0.026749614626169205,
    0.022494951263070107,
    -0.019741825759410858,
    -0.0171893872320652,
    0.024315062910318375,
    0.0016744275344535708,
    -0.002386786974966526,
    -0.01128828153014183,
    -0.034794390201568604,
    -0.04794270917773247,
    -0.0027224761433899403,
    -0.03838014975190163,
    -0.0321182981133461,
    -0.01999679021537304,
    -0.001616399153135717,
    0.02478356473147869,
    -0.03881378471851349,
    0.013480551540851593,
    -0.011738264933228493,
    0.04735160619020462,
    -0.012312115170061588,
    0.002879517851397395,
    -0.03139610216021538,
    -0.056973863393068314,
    -0.000556994928047061,
    -0.03620275855064392,
    0.0021118696313351393,
    0.0645001009106636,
    -0.034473709762096405,
    0.032051656395196915,
    0.047452930361032486,
    0.018058795481920242,
    -0.02188214845955372,
    -0.02747645601630211,
    0.0018820948898792267,
    -0.0391174741089344,
    0.007424680050462484,
    0.019078878685832024,
    -0.010331653989851475,
    0.014689375646412373,
    0.03569284826517105,
    0.003906719386577606,
    -0.008069004863500595,
    0.006956653203815222,
    0.01525946520268917,
    -0.00010359649604652077,
    0.00892769917845726,
    0.033259645104408264,
    -0.008526643738150597,
    -0.05567663535475731,
    0.009703872725367546,
    -0.003950520418584347,
    0.026828601956367493,
    -0.05049510300159454,
    0.03852464258670807,
    -0.010896235704421997,
    -0.016214871779084206,
    0.015886640176177025,
    0.002214940497651696,
    0.002973474794998765,
    -0.0071474225260317326,
    -0.016462549567222595,
    0.05525859445333481,
    0.0007740268483757973,
    0.0032925447449088097,
    0.0025053853169083595,
    -0.04898370802402496,
    0.06350056827068329,
    -0.019749166443943977,
    -0.01353522576391697,
    -0.02149510197341442,
    0.013148370198905468,
    0.05066589638590813,
    0.036660484969615936,
    0.04596257209777832,
    -0.004266003146767616,
    -0.014017271809279919,
    0.022091494873166084,
    -0.053360968828201294,
    0.026643577963113785,
    0.01638326421380043,
    0.031980812549591064,
    0.05907114967703819,
    0.01678561419248581,
    -0.030496500432491302,
    -0.008796857669949532,
    -0.02085837721824646,
    0.04201211780309677,
    -0.010161676444113255,
    0.018898865208029747,
    -0.02851863019168377,
    0.034227415919303894,
    -0.04256969690322876,
    -0.015848645940423012,
    0.038435038179159164,
    -0.006737294606864452,
    0.01643514260649681,
    0.009758285246789455,
    -0.023044420406222343,
    -0.028683315962553024,
    -0.022086724638938904,
    -0.01965329423546791,
    0.01982593536376953,
    0.0010809680679813027,
    -0.005718114320188761,
    0.04593486338853836,
    -0.05273238569498062,
    0.016314752399921417,
    -0.001115485792979598,
    -0.05982603132724762,
    -0.0027692816220223904,
    0.02666926011443138,
    0.03619774430990219,
    -0.026948846876621246,
    -0.09940297901630402,
    0.06215304136276245,
    -0.0446367971599102,
    -0.03933679312467575,
    -0.009249239228665829,
    0.048518892377614975,
    -0.034609369933605194,
    0.01708323322236538,
    0.022918609902262688,
    -0.025201261043548584,
    0.02385261468589306,
    0.000685374136082828,
    0.03747154399752617,
    0.04003005474805832,
    -0.0073184967041015625,
    0.05562324821949005,
    -0.04834473505616188,
    -0.00844419002532959,
    0.0005110341589897871,
    0.027319390326738358,
    0.017794249579310417,
    -0.006811440922319889,
    -0.0038102578837424517,
    -0.015609083697199821,
    0.01902238093316555,
    0.0511460043489933,
    -0.006470631808042526,
    -0.01812204346060753,
    0.027704348787665367,
    -0.002930631162598729,
    -0.006474518217146397,
    0.036574918776750565,
    -0.04711279273033142,
    0.050273071974515915,
    -0.035434290766716,
    0.00037002345197834074,
    0.02075081504881382,
    0.04010826349258423,
    0.008346195332705975,
    -0.02541220746934414,
    -0.004364307504147291,
    -0.03769448772072792,
    -0.03611520305275917,
    -0.07175835222005844,
    -0.029892485588788986,
    -0.04815886914730072,
    -0.031430672854185104,
    0.024254655465483665,
    -0.03982167690992355,
    0.010177940130233765,
    0.017835984006524086,
    -0.06449692696332932,
    -0.05970069766044617,
    -0.005735249258577824,
    0.03413700312376022,
    -0.03853747993707657,
    -0.008991424925625324,
    0.015699217095971107,
    0.009529334492981434,
    0.007233631331473589,
    -0.01103037316352129,
    -0.016666121780872345,
    0.04600036144256592,
    0.07646071165800095,
    0.021001223474740982,
    -0.056522827595472336,
    -0.026878006756305695,
    0.0209033340215683,
    0.016828974708914757,
    0.031718138605356216,
    -0.0934424102306366,
    0.006346642971038818,
    0.001591864158399403,
    -0.036245331168174744,
    0.03874155506491661,
    -0.04438842087984085,
    0.011321199126541615,
    -0.013814975507557392,
    -0.00036815763451159,
    -0.02321227267384529,
    -0.02762501686811447,
    -0.012570244260132313,
    0.009989006444811821,
    -0.009914187714457512,
    0.06339143216609955,
    0.05382956191897392,
    -0.014050071127712727,
    0.02346610091626644,
    0.028618743643164635,
    0.06693167239427567,
    0.02823331393301487,
    0.012644629925489426,
    0.008298305794596672,
    0.025324014946818352,
    -0.020445268601179123,
    0.04912155494093895,
    -0.03504408523440361,
    -0.01568678580224514,
    0.0031984520610421896,
    0.039851438254117966,
    -0.022942183539271355,
    -0.016453173011541367,
    -0.05295310914516449,
    -0.03391283378005028,
    -0.05936119705438614,
    -0.04178710654377937,
    0.010602100752294064,
    -0.001777930068783462,
    -0.021050218492746353,
    0.0037468147929757833,
    -0.036128997802734375,
    -0.021261321380734444,
    0.002408719388768077,
    -0.023141661658883095,
    0.010367914102971554,
    0.031552668660879135,
    -0.02831176109611988,
    0.0007227268652059138,
    0.002408307045698166,
    -0.016382738947868347,
    0.0121781500056386,
    0.0002040735853370279,
    0.0005846432759426534,
    -0.005828411318361759,
    0.010455196723341942,
    -0.006641168147325516,
    0.0002856087521649897,
    0.0167858749628067,
    -0.10461203753948212,
    -0.0033112233504652977,
    0.021568845957517624,
    0.018477384001016617,
    0.0037953921128064394,
    0.005790638737380505,
    0.020272109657526016,
    0.001999858533963561,
    0.035117026418447495,
    -0.025361930951476097,
    -0.02621079608798027,
    0.05583585053682327,
    -0.0005539808771573007,
    0.05083134397864342,
    0.024454470723867416,
    0.032108962535858154,
    0.012372287921607494,
    0.0354914590716362,
    0.03524984419345856,
    -0.009925798512995243,
    -0.06610287725925446,
    0.05163513869047165,
    -0.06518617272377014,
    -0.011954233981668949,
    0.07295697927474976,
    0.07303376495838165,
    0.016142766922712326,
    -0.035413917154073715,
    0.01642509363591671,
    -0.03577642887830734,
    -0.1347799301147461,
    0.020435869693756104,
    0.006130998022854328,
    -0.006310979835689068,
    0.003930144477635622,
    0.005506716202944517,
    -0.020709702745079994,
    -0.01442157756537199,
    -0.03977406024932861,
    0.012142711319029331,
    -0.02520843595266342,
    -0.03138665854930878,
    -0.0228628758341074,
    -0.010187418200075626,
    0.017471298575401306,
    -0.0160983856767416,
    0.014412888325750828,
    0.008569112047553062,
    0.008037043735384941,
    -0.044699545949697495,
    0.0048106079921126366,
    -0.007441642228513956,
    0.04239647835493088,
    -0.028628338128328323,
    -0.0044879247434437275,
    0.004906885791569948,
    0.05084088072180748,
    0.01647002249956131,
    -0.04516233131289482,
    0.004087195266038179,
    -0.015465712174773216,
    0.0249002855271101,
    -0.005642900243401527,
    0.027651216834783554,
    0.043029893189668655,
    0.0027317560743540525,
    -0.00035115264472551644,
    -0.08590748906135559,
    0.017212383449077606,
    -0.02649916708469391,
    0.05009976029396057,
    0.019700761884450912,
    -0.0008539817645214498,
    0.01789041794836521,
    0.018626220524311066,
    -0.02043236792087555,
    0.05475262552499771,
    -0.006218066904693842,
    -0.042560771107673645,
    0.037577152252197266,
    -0.019529130309820175,
    0.013646903447806835,
    -0.04750403016805649,
    -0.03943660110235214,
    -0.03271913155913353,
    -0.012219228781759739,
    0.002436614129692316,
    0.049798958003520966,
    -0.039952896535396576,
    0.056218378245830536,
    0.03813616931438446,
    -0.0008385045803152025,
    -0.03513070568442345,
    -0.03755350783467293,
    -0.008634800091385841,
    -0.03925212100148201,
    0.018285220488905907,
    0.02541443146765232,
    0.0022215861827135086,
    -0.03878072276711464,
    0.042046207934617996,
    -0.013349389657378197,
    -0.010040052235126495,
    0.003912233281880617,
    -0.02129361778497696,
    -0.007867521606385708,
    0.041786957532167435,
    -0.0025474121794104576,
    -0.014528502710163593,
    -0.09078504890203476,
    0.009517473168671131,
    0.007542829029262066,
    -0.008549540303647518,
    0.03535906970500946,
    -0.0468469075858593,
    -0.04712348058819771,
    -0.009416429325938225,
    -0.0243556909263134,
    0.026055797934532166,
    0.19471344351768494,
    -0.0349053330719471,
    0.01890842616558075,
    0.05081624537706375,
    0.04390489310026169,
    -0.022894548252224922,
    0.049791738390922546,
    0.06564626097679138,
    -0.012980264611542225,
    -0.02272302843630314,
    0.0033965136390179396,
    0.03616127371788025,
    -0.007209098897874355,
    -0.02264624647796154,
    -0.021239235997200012,
    -0.003749924013391137,
    0.002370643662288785,
    -0.013201438821852207,
    0.028764134272933006,
    0.0005762188229709864,
    0.04157501086592674,
    0.03992009535431862,
    0.04712788015604019,
    0.020868290215730667,
    -0.03812262788414955,
    -0.0030778476502746344,
    -0.01396016962826252,
    -0.0050096712075173855,
    -0.03498920053243637,
    0.037141624838113785,
    -0.04908734932541847,
    0.021594267338514328,
    0.05835914611816406,
    -0.06511636823415756,
    0.04157503694295883,
    -0.03320538252592087,
    -0.0033752976451069117,
    -0.022965727373957634,
    -0.011913898400962353,
    0.051592301577329636,
    0.030162019655108452,
    -0.022059239447116852,
    -0.02320009656250477,
    -0.031167233362793922,
    0.007565132342278957,
    -0.03418249264359474,
    -0.002958930330350995,
    -0.042469557374715805,
    -0.020729517564177513,
    -0.05939481407403946,
    -0.007754648569971323,
    -0.0232146754860878,
    -0.004149465821683407,
    -0.02230227179825306,
    -0.00946643203496933,
    -0.013023422099649906,
    -0.022001180797815323,
    -0.03015703707933426,
    -0.04607480764389038,
    0.06341429054737091,
    0.03772065043449402,
    0.016306553035974503,
    -0.03220504894852638,
    -0.007661216426640749,
    -0.044968415051698685,
    -0.014310457743704319,
    0.052541643381118774,
    -0.017763912677764893,
    -0.002862223656848073,
    -0.01355201005935669,
    -0.02482455037534237,
    0.055610958486795425,
    0.04965807497501373,
    -0.02046184055507183,
    0.025653569027781487,
    -0.021859699860215187,
    0.04211372882127762,
    0.046094346791505814,
    0.014017211273312569,
    0.03158145770430565,
    -0.04586765170097351,
    0.02824634127318859,
    -0.002642435720190406,
    0.03302151337265968,
    0.0011254455894231796,
    -0.036398936063051224,
    -0.020852670073509216,
    0.07139763236045837,
    -0.0010153490584343672,
    -0.04113437607884407,
    0.01797446608543396,
    -0.00024777394719421864,
    0.0034838407300412655,
    0.020972607657313347,
    0.06268549710512161,
    -0.01292598806321621,
    -0.028171420097351074,
    0.016202161088585854,
    -0.02830408327281475,
    -0.029692748561501503,
    -0.010218186303973198,
    -0.006638283841311932,
    -0.01736357994377613,
    -0.03282269835472107,
    0.06289741396903992,
    -0.02347956784069538,
    -0.01754876971244812,
    0.004393537063151598,
    0.010299964807927608,
    -0.0004301246954128146,
    -0.017107056453824043,
    0.02011546492576599,
    0.06120622158050537,
    -0.045041441917419434,
    -0.026958826929330826,
    0.07767891883850098,
    0.0562889389693737,
    0.03197028860449791,
    0.03967389091849327,
    0.01901114732027054,
    -0.05397910624742508,
    -0.002019955776631832,
    0.013976688496768475,
    -0.014003054238855839,
    0.017177283763885498,
    -0.05980173498392105,
    0.0015623916406184435,
    -0.0232447050511837,
    -0.02342304214835167,
    0.019390499219298363,
    -0.0245243851095438,
    -0.04337935894727707,
    0.03860792890191078,
    0.06177229434251785,
    -0.007293858099728823,
    -0.02922750823199749,
    0.020702507346868515,
    0.04497487470507622,
    0.013038236647844315,
    -0.003295737085863948,
    -0.005779770668596029,
    0.009030362591147423,
    -0.0008951459894888103,
    0.0036566967610269785,
    0.026994410902261734,
    0.03335703909397125,
    0.035472024232149124,
    -0.019316619262099266,
    -0.01402816642075777,
    0.008525250479578972,
    0.0076333945617079735,
    0.027376631274819374,
    -0.015357238240540028,
    -0.03211962804198265,
    0.0017485938733443618,
    -0.04743731766939163,
    0.008874855004251003,
    -0.04240359365940094,
    0.0175826046615839,
    -0.004096494987607002,
    -0.026131995022296906,
    -0.008775834925472736,
    0.005319749936461449,
    0.03200475871562958,
    0.042082350701093674,
    0.05719232186675072,
    -0.02633090317249298,
    0.027882175520062447,
    -0.016349174082279205,
    -0.0339873842895031,
    0.003053121268749237,
    -0.0395415760576725,
    -0.04571252316236496,
    0.04061639681458473,
    0.05191163718700409,
    0.00487567437812686,
    -0.008349900133907795,
    -0.04910214990377426,
    0.011460762470960617,
    -0.05922173336148262,
    -0.0016878589522093534,
    -0.026760075241327286,
    -0.0030532150994986296,
    0.024611696600914,
    -0.0044031692668795586,
    0.004201181698590517,
    0.03725674748420715,
    0.0004164655110798776,
    -0.0272963996976614,
    -0.027958858758211136,
    0.008178670890629292,
    0.0616605170071125,
    -0.05668028071522713,
    -0.031896114349365234,
    0.009586495347321033,
    0.032196708023548126,
    -0.007537686266005039,
    0.026046592742204666,
    -0.04661243036389351,
    0.014708882197737694,
    0.023368457332253456,
    0.014577450230717659,
    -0.005824144929647446,
    -0.02833513543009758,
    -0.03529265522956848,
    -0.03338877111673355,
    0.00399677362293005,
    0.010761043056845665,
    -0.0433819517493248,
    0.04441959783434868,
    0.004801555536687374,
    -0.002019587904214859,
    -0.04845653846859932,
    -0.008090547285974026,
    -0.0247198436409235,
    -0.051015064120292664,
    0.05108000338077545,
    0.022244693711400032,
    0.013494555838406086,
    -0.03158149868249893,
    -0.0374191552400589,
    0.009540937840938568,
    0.047663964331150055,
    -0.016366155818104744,
    -0.012193546630442142,
    -0.01585407555103302,
    0.044034361839294434,
    -0.03300061449408531,
    -0.02313794381916523,
    -0.03866797313094139,
    -0.009466167539358139,
    0.00920326728373766,
    0.07880959659814835,
    -0.01737685315310955,
    0.0010847067460417747,
    -0.018461128696799278,
    -0.013759009540081024,
    0.02190764993429184,
    0.017438316717743874,
    -0.026448749005794525,
    0.02778247557580471,
    -0.0069516925141215324,
    0.0073644728399813175,
    0.017638228833675385,
    0.013225151225924492,
    -0.013198436237871647,
    -0.013109561987221241,
    0.03158537670969963,
    0.06011953204870224,
    0.031681716442108154,
    -0.013035301119089127,
    -0.032392434775829315,
    0.00885937549173832,
    -0.0009312738548032939,
    -0.010034342296421528,
    0.021261731162667274,
    0.008369162678718567,
    0.01886756531894207,
    -0.015016688965260983,
    -0.003720976412296295,
    -0.021314533427357674,
    0.013853039592504501,
    0.0071178763173520565,
    0.003945566713809967,
    -0.003482023486867547,
    -0.008578255772590637,
    0.0014729318208992481,
    -0.027273068204522133,
    -0.05141109228134155,
    -0.01762271299958229,
    0.007274387404322624,
    0.013351114466786385,
    -0.03494613245129585,
    -0.007035837043076754,
    0.002963174367323518,
    0.023877061903476715,
    0.0037436657585203648,
    0.00035014728200621903,
    -0.0270133838057518,
    0.038480017334222794,
    -0.033948421478271484,
    0.030484603717923164,
    0.008166706189513206,
    -0.011945171281695366,
    0.0309256911277771,
    -0.006826390977948904,
    -0.023653704673051834,
    0.02260505221784115,
    -0.04871915653347969,
    -0.012811689637601376,
    0.02980169653892517,
    -0.038046207278966904,
    -0.04223579913377762,
    0.007131220772862434,
    -0.01791827380657196,
    -0.007640417665243149,
    -0.015256701037287712,
    0.013331687077879906,
    -0.009868762455880642,
    -0.0011195449624210596,
    -0.025401774793863297,
    -0.037724532186985016,
    -0.007427094969898462,
    -0.02285514585673809,
    0.022201111540198326,
    0.001423351583071053,
    -0.010701622813940048,
    -0.06250215321779251,
    -0.01398781780153513,
    0.02530413679778576,
    0.022263754159212112,
    -0.03185378015041351,
    -0.011461968533694744,
    0.015512904152274132,
    0.04224555566906929,
    0.02161160111427307,
    0.09499046951532364,
    0.004217564594000578,
    -0.03151000291109085,
    -0.010074146091938019,
    0.0016509492415934801,
    0.027880610898137093,
    -0.02147074043750763,
    -0.019381631165742874,
    -0.0309695266187191,
    0.004566325806081295,
    -0.030726367607712746,
    0.004590462427586317,
    -0.014271152205765247,
    0.012725140899419785,
    -0.024796126410365105,
    -0.011892493814229965,
    0.016180459409952164,
    -0.025442153215408325,
    0.005362608935683966,
    0.012217888608574867,
    0.018531860783696175,
    -0.032827842980623245,
    0.04614197462797165,
    -0.01678691804409027,
    -0.011856989935040474,
    -0.0381307415664196,
    0.03502194955945015,
    0.013788538053631783,
    -0.0142332399263978,
    -0.021958159282803535,
    0.040942780673503876,
    0.019518742337822914,
    -0.05288995802402496,
    -0.03813495486974716,
    -0.0021115867421031,
    -0.0011432088213041425,
    0.014261969365179539,
    -0.02284938469529152,
    0.044162072241306305,
    -0.01081446185708046,
    0.006640763487666845,
    0.049324218183755875,
    -0.0024114265106618404,
    0.04859420284628868,
    -0.049593277275562286,
    -0.020666543394327164,
    -0.02341998927295208,
    0.03638434037566185,
    0.03222621604800224,
    0.009973076172173023,
    0.02938047982752323,
    0.005737443920224905,
    0.005297294817864895,
    -0.0058687180280685425,
    0.033107273280620575,
    0.0015049994690343738,
    -0.009199809283018112,
    -0.009217268787324429,
    -0.04237253963947296,
    -0.0025919668842107058,
    0.009220264852046967,
    0.004961339756846428,
    0.030041571706533432,
    -0.013583049178123474,
    -0.009616869501769543,
    0.03163149207830429,
    -0.07104673236608505,
    -0.01638648472726345,
    0.02640199474990368,
    0.02235407568514347,
    0.0322415865957737,
    0.048153024166822433,
    -0.016506703570485115,
    0.014124593697488308,
    -0.000756401801481843,
    0.019588341936469078,
    -0.00509477686136961,
    0.01536218449473381,
    -0.1346837878227234,
    0.027783719822764397,
    0.010441718623042107,
    -0.00390215078368783,
    -0.024883296340703964,
    -0.026454733684659004,
    -0.003928550984710455,
    -0.04780332371592522,
    0.04981987550854683,
    -0.027720099315047264,
    -0.03195350244641304,
    -0.02863861247897148,
    0.021227624267339706,
    -0.0627182275056839,
    0.05065571516752243,
    0.01777738705277443,
    -0.024765055626630783,
    -0.06000195071101189,
    -0.02960376814007759,
    0.039842233061790466,
    -0.022652316838502884,
    0.014441775158047676,
    0.0027004610747098923,
    -0.001949661411345005,
    -0.023228593170642853,
    -0.013051626272499561,
    0.036747533828020096,
    -0.01795116625726223,
    -0.026637453585863113,
    -0.009522917680442333,
    0.02903096005320549,
    -0.016546178609132767,
    0.007767410948872566,
    0.0219025406986475,
    -0.010052511468529701,
    0.008443759754300117,
    -0.004497585352510214,
    -0.03261081129312515,
    -0.0193527489900589,
    0.04461916536092758,
    -0.021758925169706345,
    0.01487351767718792,
    -0.03366529196500778,
    0.02388460747897625,
    0.0054340846836566925,
    0.0350460521876812,
    -0.02173742651939392,
    -0.030680891126394272,
    -0.02846425771713257,
    0.004251392558217049,
    -0.03819490969181061,
    -0.06754280626773834,
    0.0022607813589274883,
    0.006452711299061775,
    0.0030179505702108145,
    -0.028098290786147118,
    -0.014912210404872894,
    0.004872498568147421,
    -0.05057518929243088,
    0.004804943222552538,
    -0.03162658214569092,
    0.009050728753209114,
    -0.051429830491542816,
    0.018505515530705452,
    0.016199853271245956,
    0.0038074518088251352,
    -0.02519567869603634,
    0.028422752395272255,
    0.023643579334020615,
    0.0141975162550807,
    -0.01978854089975357,
    -0.038573507219552994,
    0.036671657115221024,
    -0.043984152376651764,
    -0.021224157884716988,
    -0.014307498931884766,
    0.0224747434258461,
    -0.008801178075373173,
    0.021800663322210312,
    -0.02001272700726986,
    -0.03852396830916405,
    -0.030694765970110893,
    -0.056928280740976334,
    0.011120283976197243,
    0.08037861436605453,
    0.01082474086433649,
    -0.01550137810409069,
    -0.03622850030660629,
    0.025239577516913414,
    0.0004472358268685639,
    -0.05525890365242958,
    -0.02385111339390278,
    -0.028555504977703094,
    0.005518999416381121,
    -0.02462594397366047,
    0.01739114336669445,
    -0.03380465880036354,
    -0.000273407029453665,
    0.012909538112580776,
    -0.02647641859948635,
    -0.03825467824935913,
    -0.0549786202609539,
    -0.017193101346492767,
    0.02927533909678459,
    -0.007667745463550091,
    0.030345454812049866,
    -0.016978686675429344,
    -0.011533236131072044,
    0.0503421314060688,
    -0.028617272153496742,
    0.004762108437716961,
    0.010080699808895588,
    -0.04120875149965286,
    0.020990392193198204,
    -0.04272766038775444,
    -0.011718391440808773,
    -0.046814825385808945,
    0.03738081455230713,
    -0.021905487403273582,
    0.007020577788352966,
    0.000384717364795506,
    -0.00680176867172122,
    -0.0032600993290543556,
    -0.03269842267036438,
    -0.003879518248140812,
    0.0579225979745388,
    0.07676264643669128,
    0.01584703102707863,
    0.02091347426176071,
    -0.03421672806143761,
    0.03717920184135437,
    -0.04906509071588516,
    -0.009143267758190632,
    -0.013510766439139843,
    0.03813329339027405,
    -0.0075967819429934025,
    0.01825110614299774,
    0.06962073594331741,
    0.009477787651121616,
    0.003322509815916419,
    0.004328281152993441,
    -0.022663407027721405,
    0.037247080355882645,
    -0.03090532310307026,
    0.036382950842380524,
    -0.021540962159633636,
    0.03731947019696236,
    0.0329972542822361,
    -0.013569964095950127,
    -0.008168818429112434,
    0.004919891711324453,
    0.002219932386651635,
    -0.01491151750087738,
    0.03448323905467987,
    -0.019986271858215332,
    0.04091695323586464,
    -0.034414589405059814,
    0.0014913551276549697,
    -0.005711253732442856,
    0.08728013932704926,
    0.023661131039261818,
    -0.02357136644423008,
    -0.020615212619304657,
    -0.04427095502614975,
    0.007302254904061556,
    -0.0031194838229566813,
    0.014626389369368553,
    -0.025013810023665428,
    0.0053221131674945354,
    0.011520221829414368,
    -0.04675459861755371,
    -0.0033225726801902056,
    -0.006039914209395647,
    0.005288624204695225,
    0.03526477515697479,
    0.01961076259613037,
    0.0033156881108880043,
    -0.053747013211250305,
    0.03858921676874161,
    -0.009433509781956673,
    0.0455649271607399,
    0.03473471850156784,
    0.05018157511949539,
    0.028852056711912155,
    -0.01999509520828724,
    -0.012704909779131413,
    -0.02349766157567501,
    -0.014054986648261547,
    0.032587576657533646,
    0.04168533906340599,
    -0.028476040810346603,
    0.028043698519468307,
    0.03563321754336357,
    0.00039547879714518785,
    0.032656263560056686,
    -0.002331758849322796,
    -0.01842324063181877,
    0.007647534366697073,
    0.008513681590557098,
    0.043598879128694534,
    0.024716438725590706,
    -0.028388861566781998,
    -0.05212598666548729,
    0.004095546901226044,
    -0.023564374074339867,
    0.01914828270673752,
    -0.015363057143986225,
    0.0015268687857314944,
    0.010603012517094612,
    0.06884071230888367,
    0.03552112355828285,
    -0.022219795733690262,
    0.0011916125658899546,
    0.026333032175898552,
    0.012773062102496624,
    -0.024325702339410782,
    0.02465624362230301,
    0.03296088054776192,
    -0.001993949059396982,
    -0.0177058856934309,
    0.002922241110354662,
    0.03332957997918129,
    -0.023847943171858788,
    -0.015249394811689854,
    -0.03349139168858528,
    -0.00019753920787479728,
    0.05056071653962135,
    0.008696882985532284,
    0.02927514724433422,
    0.006522886920720339,
    0.009352732449769974,
    0.01729344017803669,
    0.015377569943666458,
    0.04643154516816139,
    0.026351915672421455,
    -0.002450920408591628,
    -0.006864108610898256,
    0.030171580612659454,
    -0.04972568526864052,
    -0.028138894587755203,
    -0.011075048707425594,
    -0.0024829828180372715,
    -0.04306000471115112,
    0.0038783822674304247
  ],
  "vector_dimension": 1024,
  "model_name": "BAAI/bge-m3",
  "vectorized_at": "2025-10-16T15:01:08.416669"
}