{
  "document_id": "developer-guide.384",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T09:20:29",
  "extracted_text": "# Shopee Open API Platform - Developer Guide\n\n## API best Practice → Read Open API best Prac... → Shopee Open API Pastry\n\n### Third Party Platform (3PP)\n\n1. O que é Third party Platform?\n2. Third party Platform Platform (3PPIs, Hubs, Integrators, soluos softwares): Contata os empresas com fomecaa \n   Para reduzir annual cost development\n\nPara reduzir annual cost development ou moda API e necessário realizar a migração do perfil em \nThird party Platform para consolar dirétament dados em massa dos demais compradores...\n\n#### Third Party Platform Benefits:\n\n1. Simplified Business Seller: Vendedor empresarial casa CNP, com documentos da empresa válidos no Brasil, e com \n   Prossimo a signi do com as demais do Brasil\n\n2. Third party Platform Platform:\n   - No ano CNP J registrado, esses realizador os documentos da empresa salários durante sua inscrição\n   - Obtém o Partner Authorisation Token com o Partner ID (is) que comparados de e-commerce existentes que no fornecedos ser \n     regulator somente de tempo salários e autoresde\n   - Suuck serviços de podem reunir elevados sugeridas, como a versão de contas internacionais, ou provisão de \n     autorização de produtos para partes designades Para os Shopee. Vocé pode verificar ab suas no 0 entregue \n     registró aqui (Shiper ID) 1 2.3.4.4 mercado com \"Brazil\"\n   - Enviar vendidos direta de ús URLs dos produtos via versão do registres da contra tanto com interrupção de login e habilitar \n     vendedores distintos para abrir da livra de Shoppe\n\n3. Os negócios de Consolidate dirétament em dados em massa que empresa conseguem 1.3.1.4.4 mercado com \"Brazil\" \n   Caso o vendedor que desejou o necessário funcionar tem de um valor dados de politicas no mesmo \"Sencomdi\"\n\n### CRIAÇÃO DE CONTA NO OPEN PLATFORM\n\nA Acesse uma\n\n[Shopee Open Platform - Sign Up Page description]\n\n---\n\n## Shopee Open Platform\n\n### Sign Up Page\n\n[Sign up interface details]\n\nVocê será redirecionado para a página de Autenticação de Email\n\n---\n\n## Shopee Open Platform\n\n### Email Authentication\n\nA confirmation Email has been sent to\nyour email\n\n[Email confirmation details]\n\nGet resent the validation email?\n\n[Resend option]\n\n5. Verifique sua caixa de contida co spam, um email comm o dados esta enviado para o email cadastrado acrima. Clique no \n   botão \"Verify your email\"\n\n---\n\n## [Shopee Open Platform] Please verify your email\n\n**Shopee Open Platform Team** info@open.shopee.sg    3:00 PM (22 minutes ago)\n\nOpen Platform\n\n### Dear developer,\n\nYou have successfully created your Shopee Open Platform Account.\nTo verify your email address, please click the button\n\n**[Verify your email]**\n\nBest regards,\nShopee Open Platform\n\n[Reply options: Reply all, Reply, Forward]\n\n---\n\n6. Você será redirecionado para a página de Criação de Senha. Digite e sua senha que deve ter de 8 a 16 caracteres e \n   pressionare \"Submit\" Clique em \"Next\".\n\n---\n\n## Shopee Open Platform\n\n### Setting Password\n\n**Password**\n- Password must have 8-16\n- At least 1 number\n- At least 1 uppercase letter\n- At least 1 lowercase character (a-z/A-Z)\n\n[Next button]\n\n---\n\n8. Você será redirecionado para a página de Login. Digite o email e senha cadastrados nos passos anteriores. \n   Clique no botão \"Sign in\"\n\n---\n\n## Shopee Open Platform\n\n### Sign in\n\n**Email Address**\n[Input field: Please input your email]\n\n**Password**\n[Input field]\n\n[Forgot password?]\n\n**[Sign in]**\n\n---\n\n## 3. SOLICITAÇÃO DO ACESSO PARA DESENVOLVIMENTO DA INTEGRAÇÃO\n\n9. Você será redirecionado para a página inicial da Open Platform. Clique em \"Get Active Now\" ou em \"Personal Settings\" \n   e mude de \"Sandbox\" para \"Live\". É neste momento que os dados do CNPJ serão solicitados.\n\n---\n\n# Shopee Open Platform - Developer Guide\n\n## Page Navigation\n- **Home**\n- **Documentation**\n- **Announcement**\n- **Console**\n- **English** 🌐\n- **Notification** 🔔\n\n---\n\n## About Shopee\n\n*Você será redirecionado para a página inicial do Open Platform, clique em \"Get Access Now!\" no seu \"Personal Center\" no menu superior que será exibir no canto superior à direita de esta da sua tela. Em seguida, faça com que três...*\n\n---\n\n## Account Setup\n\n### Choose an account type to add your profile\n\n#### 🛍️ Shopee Seller\n*For Shopee Sellers*\n- Any app created under this account can only be used for your own shops.\n\n#### 🏢 Thirdparty Partner Platform\n*For Retail/Independent*\n- Any app created under this account can be used by all Shopee shops.\n\n---\n\n*B. Você será redirecionado para a página de Perfil de Conta de Conta. Por favor, verifique se você está criando uma conta no modelo correto. Todas os campos são obrigatórios e você deve preencher de forma que.*\n\n**Informações adicionais para modelo Shopee Seller:**\n\n---\n\n## 🏪 Shopee Seller →\n\n**Select this if you are a Shopee seller with app development capabilities. Any app created under this account can only be used for your own shops.**\n\n---\n\n## 🛍️ Shopee\n### Log in to verify that you are a Shopee Seller\n\n**SG** ▼ | Email / Phone / Username\n\n**Password**\n\n[Forgot Password?](#)\n\n**[Log in]**\n\n**OR**\n\n**[Switch to Sub Account]**\n\n**English** ▼\n\n---\n\n### Required Information\n\n*Você deverá logar com as informações da sua cabecelareira do Shopee e ser id possuire vienda:*\n\n1. **Company's Legal Name**: Nome da empresa/Razão Social\n2. **Registered Business Name**: Não não uma carta *individual* não não será aplicáve\n3. **Tax / Accent Number Number**: Número do CNPJ da sua empresa (Nome CNPJ) ou CpF (Venda individual)\n4. **Company Registration Number**: Número do RG (Inscrição Estadual) ou CPF (Venda individual)\n5. **Business Registration Number**: Número CNO, se sua empresa\n6. **Business Location (Legal)**: Local de domicílio jurídico da empresa (Cópia da inscrição e da Situação Estadual)\n7. **Company Official Website**: Endereço da aplicativo web se sua empresa\n8. **Address**: Logradouro, Número Complemento, Bairro e Estado de sede da sua empresa\n9. **City**: Cidade de sede da sua empresa\n10. **Postal Code**: CEP da sua empresa\n11. **Email**: E-mail empresarial\n12. **Registered Contact Email**: E-mail principal (para usar e-mail verá enviado toda as comunicações)\n13. **Phone number and SMS**: Tel. do titular para casos (para usar e-mail verá enviado toda contratante e auxiliar verificação por SMS. Muito que cumprir o requisito de validação de SMS para seguir adiante) verifique nossa *Privacy Policy*\n\n---\n\n**Informações adicionais para modelo Third-party Partner Platform**\n\n---\n\n## 🏢 Third-party Partner Platform →\n\n**Select this if you are an independent software vendor (ISV) registered as a business. Any app created under this account can be used by all Shopee shops.**\n\n---\n\n### Required Information\n\n*Você deverá preencher com as seguintes informações da sua empresa:*\n\n1. **Company's Legal Name**: Nome da empresa/Razão Social\n2. **Registered Business Name**: Não não uma carta *individual* não não será aplicáve\n3. **Tax / Accent Number Number**: Número do CNPJ da sua empresa (Nome CNPJ) ou CpF (Venda individual)\n4. **Company Registration Number**: Número do RG (Inscrição Estadual) ou CPF (Venda individual)\n5. **Business Registration Number**: Número CNO, se sua empresa\n6. **Business Location (Legal)**: Local de domicílio jurídico da empresa (Cópia da inscrição e da Situação Estadual)\n7. **Company Official Website**: Endereço da aplicativo web se sua empresa\n8. **Address**: Logradouro, Número Complemento, Bairro e Estado de sede da sua empresa\n9. **City**: Cidade de sede da sua empresa\n10. **Phone Number**: Telefone de desenvolvedor responsável\n11. **Registered Contact Email**: E-mail principal (para usar e-mail verá enviado toda as comunicações)\n12. **Phone number and SMS**: Tel. do titular para casos (para usar e-mail verá enviado toda contratante e auxiliar verificação por SMS. Muito que cumprir o requisito de validação de SMS para seguir adiante) verifique nossa *Privacy Policy*\n\n---\n\n### Additional Requirements\n\n*C. Você também sera é preenchendo com os dados do Third-party Partner Platform Profile e terá provedora de form:*\n\n1. What service do you app provide: Principal funcionalidade/serviço fornecida por selecionado por\n2. Function you want apply Shopee API: Funcionalidades da aplicativo (é possível precisas mais de um). A plataforma Shopee fazer fica o Brasil, e dependem fornecidas as credenciais dos a vários plataforma para acessar API. Veja. Se liga que o desfremesse de alguma fornecida ainda não é possivel para *third-party developers* neste estagio\n3. Which other platform have you integrated with: Quais outros foram que já integrou com. Quais tardes teriam o sistema esta integrado\n4. Fornecida: Quaisquer outras informações pertinentes, que desejado o processar da avaliar. Caso não terá informações a adicionar, basta deixar esta campo em branco (você terá a obrar preencher minimo) funcionalidades do sistema, nessa campo, para utilizador).\n\n---\n\n*D. Após clicar em \"Submit\", você será redirecionado para a página App List, que estará em revisar.*\n\n---\n\n**Footer Navigation:**\n- Home\n- Documentation  \n- Announcement\n- Console\n\n---\n\n# Developer Guide - App Registration and OAuth Setup\n\n## Introduction\n\n⚠️ **Important Notes:**\n- User count varies based on supporting accounts (Quantitative vs clientele)\n- Watch other platforms have you integrated with: Sales claims (Sales is incorporated)\n- According to your documentation, using OAuth provider setup should handle authentication, but older platform domains like Store via Formulário e link as um único denominação do acesso e funcionalidades do sistema, never campo intitulado\n\n## Example: Component Registration and Managing Execution\n\nClick on \"Submit\" - you'll have a registration form for a page App List, which starts on the reverse.\n\n---\n\n## App Management Interface\n\n### Screenshot 1: Initial App List View\n\n**Navigation:** Documentation > App List\n\n**App List**\n\n⚠️ **Profile Under Verification**\n```\nYour profile is under review. We'll continue to verify your information. This will allow you to send other functionality on the Shopee Open Platform.\n```\n\n---\n\n## Email Notification Example\n\n### Shopee Open Platform - Profile Audit Result\n\n**From:** Shopee Open Platform Team (@shopee.sg e da entrega: ativos)\n**Sent:** 24/8 PM (4 minutes ago)\n\n**Subject:** Your profile verification failed for reasons below:\n\n**Information Incorrect**\n\nPlease sign in to Shopee Open Platform to resubmit your profile.\nAny other questions please email: [partner@support.shopee.com](mailto:partner@support.shopee.com)\n\n**Best regards,**\nShopee Open Platform\n\n**Actions:**\n- ↩️ Reply all\n- ↩️ Reply  \n- ➡️ Forward\n\n---\n\n⚠️ **Note:** After email, access App List and go through the error message process. For successful testing, you need to analyze revision, then proceed with system analysis review.\n\n---\n\n## App List - Profile Warning\n\n### Screenshot 2: App List with Warning\n\n**Navigation:** Documentation > App List > English\n\n**App List**\n\n⚠️ **Profile Under Verification - Warning**\n```\nYour profile is under review. Note: Please review this information. Please review this line to verify it and it will work again. Up to limit.\n```\n\n---\n\n## PRINCIPAL STEPS FOR VALUE REGISTRATION ON PROFILE\n\n1. **Basic Information Required:** Name/CNPJ developer provides certain information reversed\n2. **Payment Declaration:** In this section you should declare if application will collect or store application data, such as customer data or other sensitive information\n3. **Incorrect Documents Included:** Documents CNPJ informed should align information related\n4. **Location Claims not Accessed:** In case APIs integrated to access system database information, these must be declared. Not declared APIs will not have access\n5. **Special Claims:** Certain claims on the system and solution business requirement. For example, the development system for store person documentation, such as examples: systems for receiving documentation, file API (which will be part of system declaration), type of integration, such as fulfillment, logistics, advertisements\n6. **Access Limit on App Logo / Name Claims:** Limit API which cannot be accessed based on your product/solution\n7. **Specific Functions:** May require protection. Example: Push v2 version includes special functions like order retrieval. Have specific Policies and requirements. For special access specific functions like policies protection Help on 1.1.3, 1.2\n\n---\n\n## ON-LIST CREATION\n\nAfter extension is approved, proceed to menu Time Register, in App List page. Select \"Submit\" according to image below. Select a builder App icon called with image icon from your application.\n\n---\n\n## Creating Your First App\n\n### Screenshot 3: Empty App List State\n\n**Navigation:** Management > API v2 > Create App\n\n**App List**\n\n**Haven't you created an application?**\n```\nYour Create how to build more with application.\n```\n\n[Visual: Mobile phone icon with \"My App\" label and building blocks]\n\n**[+ Create an application]** (Button)\n\n⚠️ **Note:** You will be redirected to creation submit page \"Create App\" here: [https://open.shopee.com/documents/v2/v2/app-ui/app-register/create-and]\n\n---\n\n## Create App Form\n\n### Screenshot 4: Application Creation Form\n\n**Navigation:** Management > API v2 > Create App\n\n**Create App**\n\n**App Icon**\n\n**App Name**\n\n**App Description**\n\n**App Website**\n\n**App Redirect URL(s)**\n\n**App Business Region**\n- Brazil\n\n**App Permissions**\n```\nYour app's can access a merchant's Shopee user data and impact as app\n```\n\n**App Logo**\n\n☑️ Agree\n\n**[Cancel]** **[Submit]** (Buttons)\n\n---\n\n## All Form Fields Summary\n\nAll Campos List that must be filled from:\n\n### Required Fields:\n\n1. **App Type:** Choose a type of access, basic information\n2. **App Name:** App name, which can be changed later. Important: it should contain the brand reference\n3. **App Icon:** Icon representing your app\n4. **App Description:** Describe what it does from your company, how it works with users used\n5. **App Website:** URL of your website or app installation page\n6. **App Logo:** Application brand logo (recommended: click on App Logo field module immediately)\n\n---\n\n## After Submit\n\nClick on \"Submit\" in the App field to be ready immediately.\n\nAfter clicking submit, you'll have two paths: to create a test environment, in page for Sandbox, simply click in the button \"Go Live\"\n\nAfter clicking \"Go Live\", you must fill the request form for release from QA List. These store information lets validate user required access to Shopee systems. On request, see developer instructions. Once it is approved with certificates and Login access in system, application is ready with active code.\n\n---\n\n**App Management > App List > Ad Live**\n\n---\n\n## Please Review Information\n\n📝 **Please provide the following information to go live**\n\n⚠️ **You will select the same(s) - that may be the first environment after go live is successful.**\n\n---\n\n## All Required Fields Summary for Submission\n\nAll campos that desejados e você deve preparam da forma que:\n\n1. **Basic Information:** In this App for Live mode, do not put testing data on fields like: Name do Shopee, Link de acesso do files systems\n2. **Test Account Request:** Name da conta teste, or campo extension\n3. **Brief Business Description:** Brief description of what your business does\n4. **Target Audience:** Describe who your target audience is\n\n---\n\nThe response is Go Live will be received automatically within, a maximum of 24 hours. Check the data status on App List page.\n\n---\n\n## DOCUMENTATIONS\n\n📚 **Documentation Reference: Shopee API Resources V2.0**\n\n---\n\n# Developer Guide Documentation\n\n## All fields are mandatory and you must fill them in so that:\n\n1. **Please provide your client user login link for test account for Shopee:** Link de acesso ao seu sistema;\n2. **Test Account Username:** Conta teste para acesso ao seu sistema;\n3. **Test Account Password:** Senha da conta teste do campo anterior;\n4. **Brief Introduction:** Breve explicação de como usar o seu sistema;\n5. **Your client user interface screenshot:** De 1 a 10 imagens do seu sistema.\n\n---\n\nA resposta sobre o Go Live será recebida automaticamente, em torno de 24 horas. Confira a alteração do status do App na [página de detalhes](#) do App.\n\n---\n\n## 6. DOCUMENTAÇÕES\n\n1. [Documentação de desenvolvimento V2.0](#)\n2. [Termos de Serviço](#)\n3. [Política de Proteção de Dados](#)\n4. [Políticas e Regras de Venda](#)\n\n---\n\nEm caso de dúvidas, abra um chamado em nosso [Sistema de Ticket](#).\n\n---\n\n### ⚠️ Important Note\n\n*Não envie mensagens em outros canais, como Whatsapp, ou outros endereços de email, porque a nossa equipe não irá recebê-los e assim você poderá ficar sem a nossa ajuda.",
  "metadata": {
    "title": "Shopee Open API Platform - Developer Guide",
    "summary": "This developer guide provides information on the Shopee Open API Platform, focusing on Third Party Platforms and account setup. It covers the benefits of using the platform, the process of creating an account, and the required information for both Shopee Seller and Third-party Partner Platform account types.",
    "keywords": [
      "Shopee Open API",
      "Third Party Platform",
      "Account Setup",
      "Seller Account",
      "Partner Account",
      "API Integration",
      "Email Authentication",
      "Password Setting"
    ],
    "category": "Integration",
    "tags": [
      "Open API",
      "Developer Guide",
      "Shopee",
      "Platform",
      "Integration",
      "Account Management"
    ],
    "difficulty": "medium",
    "importance": 4,
    "use_cases": [
      "Integrating with Shopee as a third-party platform",
      "Setting up a developer account on the Shopee Open Platform",
      "Managing Shopee seller accounts through the API",
      "Automating product listing and order management",
      "Building applications for Shopee sellers"
    ],
    "related_apis": []
  }
}