{
  "document_id": "developer-guide.12",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T08:03:44",
  "extracted_text": "# Developer account registration\n\n**Getting Started** > Developer account registration\n\nRead more about the steps below\n\n---\n\n## 1. Signing up\n\nIt is free to register as a Shopee Open Platform homepage, select **Log in**, select **Sign up** + fill in your email address\n\n### Sign Up\n\nBy submitting, I understand and accept Shopee Open Platform's **Terms of Service** and **Privacy Policy**\n\nAlready have an account? **Log In**\n\n---\n\n⚠️ **Note:** Account's email cannot be changed once registered\n\n---\n\n### Steps:\n\n1. Check the inbox of your submitted email address for a verification code email from us\n2. Enter the request code in the email; once your code is validated, if step 2 was successful, select Request Verification Code button\n\n---\n\n## Enter Verification Code\n\nYour verification code is sent by email to\n\n**@163.com**\n\n**NEXT**\n\nPlease wait **60 seconds** to resend\n\n---\n\n3. Input the verification code that you got from the email and set your password\n\n---\n\n## Set Your Password\n\n**Password:**\n\nPassword must be 8-16 characters long, and contain one uppercase and one lowercase letter\n\n**Sign Up**\n\n---\n\n4. Once the password is set successfully, the page will automatically skip to to your account, and you can view the open platform console page\n\n---\n\n⚠️ **Note:** Before you can submit your profile details for approval (Section 2), you need to understand which account type and what plan (Shopee / Third-party Partner) would suit your business, and the eligibility criteria for that.\n\n---\n\n## 2. Understanding Shopee account types\n\n- **Individual Seller** - Accounts of individuals who sell on Shopee without a business license (Only support service countries: MY, TH, TW, VN, PH, BR)\n\n- **Registered Business Seller** - Accounts of businesses selling on Shopee with a registered license (Only support service country: SG)\n\n- **Managed Business Seller (3PV)** - Accounts of businesses with registered licenses providing services to sellers on Shopee\n\nYou can use the Account Type Selection table below to see which account type you should choose. Note that businesses that wish to operate on Shopee Open Platform depends on the account type you apply for. (Refer to the **categorization page** for details)\n\nAdditionally, for brands that have on Shopee Open Platform Eligibility Criteria based on the markets you're operating in, please refer to **Section 3** below.\n\n---\n\n## Account Type Selection\n\n| Are you an individual seller? | Are you an individual or business on Shopee? | Which Account Type should you select? | Description |\n|-------------------------------|---------------------------------------------|--------------------------------------|-------------|\n| Yes | Individual | Shopee Seller + Third-party Platform | Accounts of individuals who sell on Shopee (Note: You can only provide fulfillment services to sellers on Shopee only.) |\n| Yes | Enterprise | Shopee Seller + Registered Business Seller | Accounts of enterprises selling on Shopee with a registered license (Note: You can only provide fulfillment services to sellers on Shopee only.) |\n| No | - | Third-party Partner Platform (3PV) | Accounts of enterprises with registered licenses providing services to sellers on Shopee |\n\n---\n\n## 3. Shopee Open Platform Eligibility Criteria\n\n**Eligibility to access Shopee Open Platform APIs:**\n\n- Shopee Seller\n- Third-party Partner Platform\n\nIf not noted below, Third-party Partner Platforms do not need to meet the criteria of the market(s) you're operating in. Once your application is reviewed by Shopee Open Platform, you have to meet the criteria of the market(s) you're operating in.\n\n---\n\n## 3.1 Shopee Sellers\n\nfor sellers on Shopee Open Platform, you have to meet the criteria of the market(s) you're operating in:\n\n| Market | Seller Criteria |\n|--------|----------------|\n| **MY (Singapore)** | - Individual Seller to provide valid personal identification documents during their application<br>- Registered Business Seller to provide valid business documents during their application | Mail Gift managed seller in SG orders in the last 30 days |\n| **MY (Malaysia)** | - Registered Business Seller to provide valid business documents during their application | Sellers with at least 30 orders in the last 30 days |\n| **PH (Thailand)** | - | Mail Sellers OR Managed Sellers |\n| **TW (Taiwan)** | - | Mail Sellers |\n| **ID (Indonesia)** | - | Mail Sellers OR Managed Sellers OR Sellers with at least 100 orders in the last 30 days |\n| **VN (Vietnam)** | - | Sellers with at least 3 OR Mail Sellers |\n| **PH (Philippines)** | - | Mail Sellers OR Managed Sellers OR Sellers with at least 400 orders in the last 30 days |\n| **BR (Brazil)** | - | N/A |\n| **MX (Mexico)** | - | N/A |\n\n---\n\n# Shopee Open Platform Developer Guide\n\n## VN (Vietnam)\n- Registered business sellers with at least 30 orders in the last 30 days\n- **Platforms:** Preferred Sellers, CR Seller Sellers\n\n## PH (Philippines)\n- **Platforms:** Mall Sellers, CR Managed Sellers, CR Sellers with at least 30 orders in the last 30 days\n\n## MY (Mexico)\n- **Status:** N/A\n\n## CO (Colombia)\n- **Status:** N/A\n\n## CL (Chile)\n- **Status:** N/A\n\n## CB-AR (Cross Border-Area)\n- **Status:** N/A\n\n## CB-JP (Cross Border-Japan)\n- **Status:** N/A\n\n## BR (Brazil)\nRegistered business sellers with valid business documents in Brazil, and at least 1 order in the last 30 days\n\n## CB-CN (Cross Border-China)\nRegistered business sellers with valid business documents in China with at least 30 orders in the last 30 days (only for apply for App Management > App List)\n\n---\n\n## 3.2 Third-party Partner Platforms\n\nTo gain access to the Shopee Open API Platform, you have to meet the following criteria:\n\n### Requirements:\n- Your business should be more than 90 days, with a trading volume of at least 100 orders in the last 30 days, or a provided side account.\n- Your account must include documents such as the mailing of cross-border accounts, processing of returns, and other relevant information.\n- Your Shopee account ID/User ID shall be at least 90 days.\n- You need to provide confirmation of your business platform's URL. (It) that Account login details and enable all features for Shopee Seller. Shopee will provide verification of the applications.\n- Your app chopbox (gh0xxx) URL must obtain a TLS 1.2 Protocol and begin with \"https://\".\n\nIf you are a business seller or CB Seller, you must also meet one of the additional criteria that applies to you:\n\n### PH (Taiwan)\n- You are a trading ecommerce integrations) must be with a major ecommerce platform that has regulations over user data and adheres to local regulations.\n\n### CB-CN (Cross Border-China)\n- The business model of your business license must not software development.\n- You should have at least 5 customers with valid Shopee Seller Accounts.\n- You should have notified your Account Manager regarding your application.\n\n### CB-AR (Cross Border-Area)\n- You should have notified your Account Manager regarding your application.\n\n---\n\n## 4. Submitting profile details for approval\n\n### 4.1 Log in to Shopee Open Platform\n1. Log in to Shopee Open Platform > Console > App Management > App List >\n2. Choose an account type depending on which description suits your business profile better.\n\n**Note:** See the Understanding Shopee Open Platform account types section below for more details on eligibility.\n\n---\n\n### Choose an account type to edit your profile\n\n**Shopee Seller**\n- Individual Seller\n- Registered business sellers with valid business documents\n\n**Shopee Open Partner**\n- Third-party partner platforms providing applications or services integrated with Shopee Open Platform\n\n---\n\n*\"Shopee Open Platform Console: Refers to the site for you to manage all Shopee Open Platform matters.\n\n---\n\n## 4.2 Fill in the details according to your account type\n\n### Account Types:\n- **A. Shopee Seller > Individual Seller**\n- **B. Shopee Seller > Registered Business Seller**\n- **C. Shopee Open Partner**\n\n### 4.2.1 Shopee Seller > Individual Seller\n\nAfter selecting Shopee Seller as your account type, you will be redirected to verify your Shopee Seller account (it) is the correct Shopee seller account credentials > select Log in to complete verification.\n\n---\n\n## Log in to verify that you are a Shopee Seller\n\n**Country Selection:** SG ▼\n\n**Email / Phone / Username**\n[Input field]\n\n**Password**\n[Input field]\n\n**Forgot Password?**\n\n[Log In Button]\n\n**OR**\n\n[Switch to Sub Account Button]\n\n**Language:** English ▼\n\n---\n\n**Note:** If your seller account verification is successful, you can continue to fill in other Shopee Seller identification details, (select) Individual Seller from the Seller Type dropdown menu > fill in your Key Account Manager's E-mail > select Next. (if) you Account Manager's E-mail email verification the same Shopee email profile with @shopee.com). (If) no Key Account Manager has been assigned to you, please fill in \"none\" in the Key Account Manager's E-mail box.\n\n---\n\n### Shopee Seller Identification\n\n**Shopee Open Partner URL:** [Input field]\n**Shopee Site:** [Dropdown]\n**Site Free Distribution Country:** [Checkbox]\n\n### Shopee Seller Identification\n\n**Seller Type:** [Dropdown with options including Individual]\n**Key Account Manager's Email:** [Input field]\n\n---\n\n[Cancel] [Submit]\n\n---\n\n## (6) Fill in all profile details > select Submit.\n\n[Cancel] [Submit]\n\n---\n\n# Shopee Seller Registration Guide\n\n## 4.2.2 Shopee Seller > Registered Business Seller\n\nAfter selecting Shopee Seller to your account type, you will be redirected to verify your Shopee seller account.Fill in the correct shopee seller account credentials > select Log in to complete verification.\n\n### Log in to verify that you are a Shopee Seller\n\n**Country Selection:** SG\n\n**Fields:**\n- Email / Phone / Username\n- Password\n\n**Links:**\n- Forget Password ?\n\n**Buttons:**\n- Log In (Orange button)\n\n**Alternative Option:**\nOR\n- Switch to Sub Account (White button with orange border)\n\n**Language Selection:** English\n\n---\n\n**Note:** If your seller verification is successful, you can continue to fill in other Shopee Seller Identification details.\n\n**Important:** Registered Business Seller must be listed 'type (registered store)'. Fill in your Key Account Manager's Email > select 'Next'\n\n**Note:** Your Key Account Manager Email should be of a valid Shopee email prefix with @shopee.com. If no Key Account Manager Email is assigned to your account, please contact Key Account Manager for assistance.\n\n### Step indicators shown:\n- ① Seller Type Selection (Orange)\n- ② Fill in Seller Information (Orange)\n\n---\n\n## 4.2.3 Third party Partner Platform\n\nAfter selecting Third-party Partner Platform as your account type, you will be redirected to the Business Information section.\n\nFill in all profile details > select Next.\n\n### In Under the Services Information section, fill in your software service details and select Submit\n\n**Note:** Provide any additional logo, software description and contact information. Once you complete this application, you will be granted a Shopee business account for Shopee's verification. Please note the email used with be the registered partner email in the system\n\n---\n\n## 4.3 Wait for your profile to be approved by Shopee\n\nOnce your application is approved, you will receive a notification email via your submitted email address.\n\nAccess to Shopee 'open' application will be provisioned if 7 working days, once Third-party Partner Platform have their application approved and have completed the authentication processes to access the Open API\n\nIf your application isn't approved, you can check the reason or the notification email sent to you or by selecting Go to Profile from the home page\n\n---\n\n# Shopee Open Platform Console - APP List Profile Verification Guide\n\n## Navigation\n- Documentation\n- 繁體中文 ▼\n\n### Left Sidebar Menu\n- **App Management**\n  - App List\n  - App Management ▼\n  - Push Notification\n  - Tools\n  - Invite System ⓘ\n  - Partner Center\n\n---\n\n## APP List\n\n### Profile Verification Unsuccessful\n\n⚠️ **Profile Verification Unsuccessful** - Profile verification unsuccessful. Check the reason on notice via email before you resubmit it for review. **Go To Profile**\n\n---\n\n## Instructions\n\nIf your application isn't approved, you can check the reason in the notification email sent to you or by selecting **Go to Profile** on the APP List page on Shopee Open Platform Console.\n\nSelect **Edit** to make the necessary changes before resubmitting.\n\n---\n\n## Business Information Edit Form\n\n### Notification Notice\n⚠️ **Notification failed**\n\nThe company name does not match the name of the business license. Please fill in the company name according to the name of the business license. The photo of the business license you uploaded is unidentifiable or expired. Please upload a new photo and resubmit it. **Learn More**\n\n### Business Information Section\n\n**Company/Legal Name**\n[Input field]\n\n**Business Registration Number**\n[Input field]\n\n**Business Registration Document**\n[Image upload area with blurred document preview]\n- Use fill color, 150 x 100mm\n- Accepted format: PDF, JPG, JPEG, PNG\n\n### Enterprise Address Section\n\n**City/Town**\n[Input field]\n\n**Address**\n[Input field]\n\n**Postal Code**\n[Input field]\n\n---\n\n### Footer Actions\n\n☐ I agree to the [Shopee Open Platform Data Protection Policy]\n\n[Change profile type] [Cancel] [**Save**]\n\n---\n\n## Additional Notes\n\n- Documentation available in multiple languages (English, 繁體中文)\n- Navigation includes breadcrumb: App Management > App List",
  "metadata": {
    "title": "Developer account registration",
    "summary": "This guide provides a step-by-step process for registering a developer account on the Shopee Open Platform. It covers account types, eligibility criteria, and the submission of profile details for approval, ensuring developers understand the requirements for accessing Shopee Open Platform APIs.",
    "keywords": [
      "Shopee Open Platform",
      "developer account",
      "registration",
      "account types",
      "eligibility criteria",
      "API access",
      "profile approval"
    ],
    "category": "Authentication",
    "tags": [
      "account registration",
      "developer guide",
      "Shopee API",
      "onboarding"
    ],
    "difficulty": "medium",
    "importance": 5,
    "use_cases": [
      "Registering as a new developer on Shopee Open Platform",
      "Understanding the different account types available",
      "Checking eligibility criteria for accessing Shopee APIs",
      "Submitting profile details for approval"
    ],
    "related_apis": []
  }
}