{
  "document_id": "developer-guide.4",
  "document_type": "guide",
  "platform": "shopee",
  "content_ko": "# 소개\n\n**최종 업데이트: 2024-11-11**\n\n**지원 언어:** English / 简体中文 / 繁體中文 / Português / ไทย\n\n## Shopee Open Platform이란 무엇인가요?\n\n다양한 이커머스 니즈를 가진 Shopee 판매자를 지원하는 개발자를 위해 만들어진 Shopee Open Platform은 Open API 및 서비스의 핵심 소스입니다.\n\n- **강력한 API:** 주문, 상품, 마케팅 등을 위한 Open API를 포함하여 Shopee Open Platform의 광범위한 Open API에 액세스하십시오. Shopee에서 릴리스한 Open API 및 푸시 알림 서비스를 활용하여 주문 처리, 상품 최적화, 상점 홍보 등과 같은 일반적인 판매자 요구 사항을 충족하는 맞춤형 소프트웨어 서비스를 만들 수 있습니다.\n\n- **종합적인 개발자 서비스:** 온보딩, APP 개발, APP 테스트, APP 릴리스 및 APP 유지 관리 단계에서 엔드 투 엔드 개발자 지원을 받으십시오. Shopee Open Platform 내에서 효율성을 위한 도구를 찾을 수 있습니다.\n  - APP 관리\n  - Open API 테스트 도구, 테스트 계정 및 샌드박스 테스트 환경에 액세스\n  - 최신 뉴스(공지 페이지), Open API 문서(Documentation), 문의 사항에 대한 답변(지원 센터)과 같은 중요한 정보를 얻고 기사를 검색\n\n## Shopee Open API 사용의 이점은 무엇입니까?\n\nShopee Open API는 판매자에게 Shopee에서 판매하기 위한 중요한 상점 데이터에 빠르고 쉽게 액세스할 수 있도록 합니다. 여기에는 무엇보다도 상품, 주문 및 캠페인 관리에 대한 정보가 포함됩니다. 모든 마켓에서 사용 가능한 Shopee Open Platform을 사용하면 둘 이상의 마켓에서 판매하거나 판매자를 지원하는 경우에도 단일 Open API 세트를 통합할 수 있습니다.\n\n## 누가 Shopee Open Platform에 액세스할 수 있습니까?\n\nShopee Open Platform, 특히 Shopee Open Platform Console은 각 비즈니스 요구 사항에 가장 적합한 솔루션을 제공하는 2가지 유형의 개발자를 대상으로 합니다.\n\n- **소프트웨어 서비스 제공업체:** 소프트웨어 비즈니스를 위한 Shopee의 주요 이커머스 프로세스 전체를 포괄하는 광범위한 Open API를 제공합니다. Shopee Open Platform을 활용하면 상점 운영, 마케팅 등을 위한 판매자의 요구 사항을 충족하는 다양한 APP을 제공할 수 있습니다.\n\n- **소프트웨어 개발 역량을 갖춘 판매자:** 비즈니스 요구 사항에 맞는 소프트웨어를 개발하고 시스템을 Shopee와 통합하여 운영 최적화 및 데이터 관리 영역에서 미개척 잠재력을 발견하려는 판매자인 경우.",
  "translated_at": "2025-10-16T08:01:40",
  "char_count": 1403,
  "metadata_ko": {
    "title": "Shopee Open Platform 소개",
    "summary": "본 가이드는 Shopee 판매자를 지원하는 개발자를 위한 리소스인 Shopee Open Platform을 소개합니다. 이 플랫폼은 Open API 및 개발자 서비스에 대한 액세스를 제공하여 전자 상거래 요구 사항에 맞는 맞춤형 소프트웨어 솔루션을 만들 수 있도록 지원합니다.",
    "keywords": [
      "Shopee Open Platform",
      "Open APIs",
      "개발자 서비스",
      "소프트웨어 서비스 제공업체",
      "판매자",
      "API 통합",
      "전자상거래",
      "쇼핑몰 운영"
    ],
    "category": "소개",
    "tags": [
      "Open API",
      "개발자 가이드",
      "플랫폼 개요"
    ],
    "difficulty": "쉬움",
    "importance": 5,
    "use_cases": [
      "주문 처리 앱 개발",
      "제품 최적화를 위한 소프트웨어 제작",
      "쇼핑몰 홍보 도구 구축",
      "판매자 시스템과 Shopee 통합",
      "데이터 관리를 위한 소프트웨어 개발"
    ],
    "related_apis": [
      "Orders API",
      "Products API",
      "Marketing API"
    ]
  },
  "metadata_translated_at": "2025-10-16T08:01:43"
}