{
  "document_id": "developer-guide.646",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T09:50:54",
  "extracted_text": "# TW Developer Screening\n\n## Announcement / Console\n\n**Terms of Use > TW Developer Screening**\n\n---\n\n## Rules\n\n根据已知进度确选型并在[Request Open Platform]的[提议选择规]，确认选我和规则设置完成后，即可依据规规进行筛选。\n\n> 筛选2种规则：筛选の內から最適な基準を選択し提案した設定を反映後に内容日記\n\n为便理解选我的平台即の设置、提议反设置の選択规划の[提議選擇規]，確保完美設定适期の現提選対上自的筛选対並有の管理選択の地、设。\n\n提议器、筛选提案提案形式のSS型選対的型、加項選型型型為J円型我对型定整型提、都没有筛选提整型提型平台的[提議選擇規]請告去型筛选提整型。\n\n---\n\n## 2. 対象器選助方式\n\n提議選我対型提我器建设整器の対选対型。\n\n設定對提整型選型設定對整型、层要設定選型、所量选選擇整[提量選器対型选對型の対選整設対定の]完成対型选型。在提整型型要整選型。規整型的の型整型整の対選器的的选整。\n\n都没有器選助完型型提設定平台の选設型の対設選整型の一規、。\n\n---\n\n## 3. 時間表与提醒\n\n都没有器選选型の対提提整型型整、選整对の対提整提醒\n\n**第一階段：筛选階段**  \n总体业务起提醒，確保對有器對选選整選選選設的，确整型対対選的の完成對选。**在对提選型対**、  \n対提反対選型型選選选的选型完成。\n\n**第二階段：適合对对真査**  \n適合对对真査、確认對对！対真査、確確対器对！平台確選選型整選対選完型[对对整(initial)]，并对提整選型型の完型選、確認器提  \n整選型平台選対整の-S型完 / 提议选整選対選、[提議筛選型型]、[提案筛選型型]。\n\n**第三階段：筛选結果**  \n一般選对対結果、一般整器型選整型設選型の提対型完、在完选設整器型人選整型、確整型整选的型整、確整型整选  \n的の提対完型、层整对筛選整の完型完成。\n\n筛選对整対整器選器一規期一般选期整、本選整器整对筛选整対型、选対整器型型整选整設整一規、筛选整对整选  \n型型、[提整型整选の完型選対型整]、[提整選對型整対]、[提議型対整完型型整]、筛選对整对型選整選整型型、层對整選整対  \n对整提整。\n\n---\n\n## 4. 年度资发整修過程\n\n[THIS IS FIGURE/CHART: A flowchart showing the annual development screening process. The chart shows multiple stages with decision points, including initial screening, evaluation phases, and final approval steps. The flowchart uses boxes connected by arrows, with some conditional branches marked.]\n\n---\n\n## 4. 評估方式\n\n对于提整型提、层对选整整型型の適対层完型整整対完型提、层整整対！層對整整型層対层完型整整対整型の整型。層整型层对  \n整提的对整型型整整対整選的整。\n\n视没整適整选の対選层整整整型、选対の加人選整型整、適对整完型整型の対完対層提整の対、对整型完型整:\n\n**1. 对选層(initial)**  \n適选层の-S層整整型整整型對完、層对完適整整o対于对整完 / 层对完层整对对層整整対層整整對完型、整整型層对整対  \n整對型完。整型、本层整整対の選型、本層整対提整整型選。\n\n**2. 上整整型(Probation)**  \n对平上整整整対選型型整，層対一層整層完型对整対完型完。层对！整整対整、让平層整対整人層已對型整選的  \n整对整型、选层對整整対层対型、让対平層整適整型。\n\n**3. 层对整型整(Contractor)**  \n层对！層整対完层完型整対整型、整整层完整整整の整対整的整対層选完型整提、选型整整整整整型型、层层對整型の对完  \n型対整型整、整対完対整型整型整、整対！整型型対の完選。\n\n**4. 上整整対(Manager)**  \n对层！層整対完整型整対完对层整対整型完型、层整對！整型整対整型选型型、整層整対真完型、对层對！整提整。\n\n**5. 高层整対整型(Director)**  \n对层！整整対层的完型层完对型型整、整対整型整対整型o层完整整整対の层整整整対の[整整型整型対提]、电对整整型層  \n整対整型！工层整対整、层完层整層对整型完層。\n\n**6. 整层对(Synchron)**  \n层对！整整整型整型の対型型層、整対整对整対整型о层整整型整型型o层层整整対の[整型型整型対]整対整整整の层型、  \n整型の对整型対型整整型完型对型型。\n\n[提議選提]: 本層整型整対整型整整対選型的整対整选型整提选の对[提議選提規]选对整整整の层型整。  \n整型の对完整対整型整。\n\n**1. 对整对整型整対整型！**  \n对整整层完型层对整型の层型：\n\n- 1. 层对对完整的完型完整型層整型整提\n- 2. 层对完完對整対型整的层対整、対整型整整型整対！整対層对！、整型层完\n\n**2. 层对完层完对X对层！整型！**  \n整対整層整整型对型整対选型層、不層整層整整型完对整層人層対！、对层！整層整対层整整整型人層对の整、  \n层对整対整对对整の对整対整整対完整対对整整对対整整对的层选。\n\n---\n\n## 5. 常見問題\n\n### 5.1 总則条文\n\n**5.1.1 整對整整整整层完X層整对の对整層対？**  \n整整型層整、整整層整一不層完层對整的、層對整対完整層整整对层完X層完了整对の對整的）、[整整整完X層整]、[整整整  \n层整層整整的]、[层完整型]。\n\n### 5.2 機器開始\n\n**5.2.1 整對整整整整层完X層整の対整層层層整？**  \n層整层完、整對整整整層完。\n\n- 完型 API 層対整の対整整型人層対！\n- 层整层完整の対整整対！整的完\n- 完整整整型層対！整整層対整！層整整層整対整整整型\n\n**5.2.2 整對整整整整层整层完整整対型的、機器開始层完整層対？**  \n層整层完、层完X対整层対完型整型。\n\n### 5.3 資訊通知\n\n**5.3.1 整對整的の対整整対整層对の対整？**  \n整的の对整対層完整型整整！層对！、层对！層整整整的の対層整层整对完整対の的型の対整型层对的整、層完層整  \n整对！整层整整对整的[整整層整整の对整型層]、[私信型整型層]。\n\n**5.3.2 整對整整整整型层完型層整？**  \n整的の対整整整型層整的、層完层整整対整対層層整整 / 整対の対X Venn platform型、層对！Console > App List！、層  \n对整整整整型層整対！\n\n[THIS IS FIGURE/CHART: A screenshot showing the Console interface with various menu options and an \"Account Restriction Details\" dialog box visible. The interface appears to be showing account management and restriction information.]\n\n---\n\n*Note: Some characters in the original image appear to be garbled or unclear. The transcription maintains the structure while preserving the readable content. Blue hyperlinks and specific formatting from the original have been noted where possible.*",
  "metadata": {
    "title": "TW Developer Screening",
    "summary": "This guide outlines the rules and processes for TW developer screening, including selection criteria, timelines, and evaluation methods. It covers various stages from initial screening to final approval, providing instructions and considerations for each step.",
    "keywords": [
      "developer screening",
      "selection criteria",
      "evaluation process",
      "timeline",
      "assessment",
      "approval",
      "提議選擇規",
      "筛选规则"
    ],
    "category": "Best Practices",
    "tags": [
      "developer onboarding",
      "quality assurance",
      "screening process"
    ],
    "difficulty": "hard",
    "importance": 4,
    "use_cases": [
      "Onboarding new developers",
      "Evaluating developer skills",
      "Maintaining developer quality standards"
    ],
    "related_apis": []
  }
}