{
  "document_id": "developer-guide.381",
  "document_type": "guide",
  "platform": "shopee",
  "extracted_at": "2025-10-16T09:10:56",
  "extracted_text": "# API Access Tools\n\n## Announcement | Console\n\n### Navigation\nAPI Best Practices > Brand Open API Best Prac... > Ferramentas de Log da Op...\n\n---\n\n## API Log Access\n\nAccess the tool by [clicking here](link)\n\nAccess to the API Log tool is the exclusive right of the Live Partner during the contract period. Requests to modify system attributes must be made with caution, as they may directly impact the operation of the API. Requests deemed appropriate can be forwarded accurately to the log.\n\n1. A separate query (split query) for each of the request and response fields, sorted by timestamp, can be sent accurately to the log.\n2. Keyword search by word. For example, you can search for the string of order_sn in the message record.\n3. You can view the complete details of each log entry.\n4. All relevant information related to the shop_id will be automatically copied to the ticket opening form.\n5. Hovering over the documentation will redirect the user to the View API Document page, where you can check if it's from this page.\n6. API documentation is provided on a single page.\n\n---\n\n## Opening a Call Through the API Log Tool\n\n1) After selecting a partner, you must verify the logs.\n2) If you have a Request ID, search directly using the Request ID field. If you don't have a Request ID, use the Keywords field to search for the desired field.\n3) The API Path field can be used to query historical logs.\n4) You can click on Search to find the desired results on all log parameter screening pages.\n5) Click on Raise a Ticket.\n6) If you've been redirected to our call opening form, you'll see more relevant information, such as:\n\n### Required Fields:\n1. Developer Email\n2. L1 Question Category\n3. L2 Question Category\n4. Question Description\n5. API Version\n6. API Category\n7. API Name\n8. Request\n9. Response\n10. Request ID\n\nBased on the presence of the Question Description field with its data.\n\n---\n\n## Raise Ticket to Shopee Open Platform\n\n**Please submit accurate information to help us troubleshoot the issue.**\n\n### Form Fields:\n\n**\\* Developer Email**\n[Input field]\n\n**\\* L1 Question Category**\n[Dropdown: Live API Issue]\n\n**\\* L2 Question Category**\n[Dropdown: Product]\n\n**\\* Question Description**\n[Large text area for input]\n\n---\n\n9) If necessary, you can attach relevant files to open the ticket, just add them in the File section:\n\n**\\* Developer Email**\n[Input field]\n\n**\\* L1 Question Category**\n[Dropdown: Live API Issue]\n\n**\\* L2 Question Category**\n[Dropdown: Product]\n\n**\\* Question Description**\n[Text area]\n\n**File**\n[Click to Upload (0/5)]\n\n---\n\n10) After performing these actions, click Submit and complete the Captcha.\n11) Your call will be successfully submitted.\n\n---\n\n## Push Log Access\n\nAccess the tool by [clicking here](link)\n\n1. You can query the Push logs corresponding to your Live Partner during the contract period, so that push requests are successful.\n2. If the push message was sent successfully, the error message and reason will be displayed.\n\n---\n\n### How the Selection Works:\n\n**Note:** If you don't receive a callback, the error message \"Shopee has sent the push to your callback url, but we didn't get an response with 2xx code within the requested timeout seconds, please check your API/V2.\"\n\n3) If you receive an error like \"The request sent to your callback url can't be completed successfully with 2xx code within the timeout seconds\", please check your API/V2.\n\n4) Other error messages: \"Receiving other error.\"\n\n---\n\n### Keyword Search:\n\nYou can search by word. For example, you can search for the string of order_sn in the push message to look for the Push log.\n\nEntities can describe all mandatory fields (fields marked with \"\\*\"):\n\n### Push Log Fields:\n1. Partner ID\n2. Push Mechanism\n3. Send Time (UTC+03:00) - after the date the data was sent (available from the last 7 days)\n\nTo search for a specific keyword field, use the Keywords field, for example order_sn or shop_id.\n\n---\n\n**End of Document**",
  "metadata": {
    "title": "API Access Tools",
    "summary": "This guide provides instructions on how to access and use the API Log and Push Log tools. It details the steps for querying logs, opening tickets for API-related issues, and troubleshooting push notification problems within the Shopee Open Platform.",
    "keywords": [
      "API Log",
      "Push Log",
      "API Access",
      "Troubleshooting",
      "Ticket Submission",
      "Log Query",
      "Error Messages",
      "Shopee Open Platform"
    ],
    "category": "Integration",
    "tags": [
      "API",
      "Logs",
      "Debugging",
      "Support"
    ],
    "difficulty": "medium",
    "importance": 4,
    "use_cases": [
      "Debugging API integration issues",
      "Troubleshooting push notification failures",
      "Querying historical API logs",
      "Submitting support tickets for API problems",
      "Verifying successful push requests"
    ],
    "related_apis": [
      "Live API",
      "API/V2"
    ]
  }
}