{
  "document_id": "developer-guide.36",
  "document_type": "guide",
  "platform": "shopee",
  "vector_type": "individual",
  "content_en": "# Terms of Service\n\n## Terms of Use - Terms of Service\n\n**Effective Date: April 13, 2023**\n\nThese Terms of Service (these \"Terms of Service\") explain the terms and conditions by which you may access and use the Products provided by Stripe (as defined below). \"Products\" means the various features, content, services and functions available through the Platform that enable you to use API Services (as defined below). These Products are provided by Stripe, Inc. and its affiliated companies (\"Stripe,\" \"we,\" \"our\" and \"us\").\n\nBy accessing or using any of the Products, you are entering into a binding contract with Stripe. You acknowledge that you have read, understood, and agree to be bound by the terms and conditions contained in these Terms of Service. These Terms of Service also include the Stripe Platform Privacy and Cookie Policy and any other applicable Terms in relation to your use of the API Services (each as may be amended or updated from time to time).\n\nIf you do not understand or do not wish to be bound by these Terms of Service, you should not access or use the Products. BY ACCESSING, BROWSING OR OTHERWISE USING THE PRODUCTS, YOU ACKNOWLEDGE THAT YOU HAVE READ, UNDERSTOOD AND AGREE TO BE BOUND BY THESE TERMS OF SERVICE. THE LEGAL AGE FOR ENTERING INTO A CONTRACT IN APPLICABLE LAW IS IN YOUR COUNTRY (THE \"LEGAL AGE\"). IF YOU DO NOT MEET THE MINIMUM AGE REQUIREMENT TO USE THE PLATFORM OR IF YOU HAVE PREVIOUSLY BEEN SUSPENDED OR REMOVED FROM THE PLATFORM BY LEGAL GUARDIAN MUST AGREE TO THE PLATFORM TERMS. IF YOU DO NOT KNOW WHETHER YOU HAVE THE LEGAL ABILITY TO ACCEPT THESE TERMS OF SERVICE, PLEASE ASK YOUR LEGAL GUARDIAN, OR DO NOT USE THE PRODUCTS OR ACCESS THE PLATFORM. BY USING ANY OF THE PRODUCTS, YOU REPRESENT AND WARRANT THAT: (A) ALL REGISTRATION INFORMATION YOU SUBMIT IS TRUTHFUL AND ACCURATE; (B) YOU WILL MAINTAIN THE ACCURACY OF SUCH INFORMATION; (C) YOUR USE OF THE PRODUCTS DOES NOT VIOLATE ANY APPLICABLE LAW OR REGULATION; AND (D) THAT YOU MEET THESE AGE REQUIREMENTS. IF YOUR USE OF THE ACCOUNT OR COMPANY'S SERVICE VIOLATES THESE TERMS OF SERVICE, STRIPE MAY IMMEDIATELY TERMINATE YOUR APPLICATION OR SUSPEND YOUR ACCOUNT.\n\n---\n\n## 2. ACCOUNT\n\n2.1 Usage of the Tools requires an account registered with Stripe in connection with the Platform (\"Account\"). By creating an Account through the Platform, you agree to: (a) maintain the security of your Account by not sharing your password with others and restricting access to your Account; (b) promptly notify Stripe if you discover or otherwise suspect any security breaches related to the Platform or your Account; and (c) take responsibility for all activities that occur under your Account and accept all risks of unauthorized access.\n\n2.2 Stripe may, in its sole and absolute discretion, accept or reject any application for an Account and/or suspend or terminate any Account that it deems to have violated any of these Terms of Service or the policies referenced herein. Stripe may do so at any time and for any reason, without prior notice to you. Account activity and access will be governed by these Terms of Service.\n\n2.3 You must at all times maintain the security and prevent the misuse of your Account, and any assigned keys or other credentials used to authenticate your Account access, as well as access to all of your systems, devices and communications. You agree to comply with and cause your Users to comply with, as applicable, the PCI Data Security Standard as it applies to you and your activities and to comply with applicable obligations under the Card Association and Network Rules (as applicable) for safeguarding the security of your Account, emergency keys or other credentials that have been provided to you.\n\n2.4 Each User of the Account is separately responsible for maintaining the confidentiality and appropriate use of any credentials provided to use the Account. You are fully responsible and liable for all uses of your Account and for any actions that take place using your Account, whether or not such actions were taken by you. Stripe has no obligation to verify that the person accessing or using your Account is you.\n\n2.5 You acknowledge and agree that: (i) you shall not be responsible for, and bound by, any and all actions and use of the Platform made using your Account, whether or not you have authorized such use; (ii) you will not sell, transfer or sublicense your Account rights to any other entity without Stripe's prior written consent; (iii) you are responsible for all activity associated with your Account; and (iv) you are responsible for maintaining the confidentiality of your Account and password (if enforcement, bans, ordinances, rules, laws, rules, regulations, notifications, guidelines, directives, directives and orders of all applicable United States federal, state and local governments and governmental agencies and bodies, and by the laws of and orders of the governments of any jurisdiction from which you access the Platform that may apply to you. Stripe may assume that any communications we receive under your Account have been made by you. If you become aware of any unauthorized use of your Account, you must notify Stripe immediately at the email address noted in Section 12 below.\n\n---\n\n## 3. PLATFORM\n\n3.1 The Platform provides you with the ability to access and use certain software, applications and services (collectively, the \"Platform\") in order to use the APIs offered by Stripe (the \"API Services\").\n\n3.2 You may only access and use the Platform and the Tools to create, distribute and use software applications, websites or online services (each, an \"Application\") that interacts with Stripe's API Services to provide payment-related functionality to persons who use Shopee Services in a manner which is in accordance with these Terms of Service, the Shopee Third-party Service Terms (https://shopee.sg/legaldoc/terms) and the Application Data, Use Policies as those Terms of Service are published to the Platform from time to time (together, the \"Developer Terms\").\n\n3.3 In connection with your use of the Platform, the API Services and/or any Application, you and any person acting on your behalf (including your employees, personnel, subcontractors, agents, principals, contractors and subcontractors (\"Users\"), as applicable) shall: (a) not directly or indirectly (i) reverse engineer, reverse compile, disassemble or otherwise attempt to discover the source code, object code or underlying structure, ideas, know-how or algorithms of the API Services or any API Documentation (defined below); (ii) modify, translate or create derivative works based on the API Services, the Platform or any API Documentation; or (iii) use the API Services in a manner that: (A) is contrary to applicable law or regulation; (B) violates the rights (including the rights of privacy or publicity, or Intellectual Property Rights) of others; (C) is harmful, fraudulent, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, invasive of another's privacy, or promotes discrimination, bigotry, racism, hatred, harassment or harm; or (D) transmits, displays, distributes or otherwise makes available any harmful, offensive or inappropriate content (including offensive or inappropriate material (\"Prohibited Material\").\n\n3.4 You will not access or use the Platform or the Tools for any purpose that is beyond the scope of the authorization and access granted to you or do anything which violates the terms set forth in these Terms of Service. In particular, you will not do, attempt to do or authorize or permit any third party to do any of the following, except as expressly permitted in these Terms of Service: (a) license, sell, rent, lease, transfer, distribute, publish, sublicense or otherwise make available the API Services or any API Documentation to any third party or allow any third party to use the same, except that you may permit the use of the API Services by your Users (as defined below); (b) reproduce or make unauthorized copies of the Platform or the Tools; (c) decompile, disassemble, reverse engineer or otherwise attempt to derive the source code for the Platform or the Tools; (d) access or use the Platform or the API Services in order to monitor their availability, performance or functionality or for any similar benchmarking purposes; (e) use the Platform, the Tools or any communications sent through or in connection with the Platform for transmission of any data, including personal data, and data sets that include personal links, and areas not include information that violate the Data Use Policy, any other Stripe terms or policies, or applicable data protection laws; (f) circumvent or disable any technological features or measures of the Platform or the Tools for security or protection of Intellectual Property Rights; (g) attempt to decipher, decompile, disassemble or reverse engineer any of the software used to provide the Platform or the Tools, or in any way alter, modify or create derivative works based on the Platform, the Tools or any communications sent through or in connection with the Platform; (h) use any robot, spider, site search/retrieval application or other manual or automatic device or process to retrieve, index, \"scrape,\" \"data mine\" or in any way reproduce or circumvent the navigational structure or presentation of the Platform; (i) use any meta tags or other \"hidden text\" utilizing Stripe's name, trademarks, or product names; (j) conduct any other activity that may damage, disable, overburden or impair the Platform; (k) harvest, collect or gather User data without the User's consent; (l) use the Application, the Platform and the Tools in a manner that overburdens or harms the Platform or the Stripe's systems or network, such as through denial-of-service-type attacks, including any attempt to probe, scan or test the vulnerability of a system or network or to breach security or authentication measures; or (m) access or use the Application, the API Services, the Platform or the Tools in order to build a competitive product or service, or copy any features, functions or graphics.\n\n3.5 You agree to cooperate with Stripe to prevent the unauthorized use of the Application and/or the Platform and you agree to promptly notify Stripe in the event any become aware of any unauthorized use. In the event that a circumstance arises including but not limited to (a) suspected fraudulent activity affecting your use of the API (for example, by making the number of API calls in excess of the limits communicated to you by Stripe for your Account), or (b) if Stripe discovers, or receives a report regarding actual or suspected unauthorized use or disclosure of data, Content or information derived from your use of the Platform or the API Services by your Users (such as usage through your Application (any such actual events called \"improper Activity\"), Stripe may (i) suspend access to the Application, the API Services, the Platform and/or the Tools immediately pending a full investigation; (ii) disable, suspend or close your Account; and/or (iii) remove any Content you made available (as applicable). You will reasonably cooperate with Stripe's investigation of any Improper Activity.\n\n3.6 You may not use, provide or permit use of the Platform or the Tools to access, or transmit through the Platform or the Tools, any data that is protected by law (for example, payment card data covered by the Payment Card Industry Data Security Standard (PCI DSS) or personal data governed by applicable data protection laws).\n\n3.7 Stripe reserves the right at any time to ensure such terms and conditions (i) it deems appropriate in relation to the use of any Application; (ii) it deems as necessary or desirable in order to maintain the safety, security and performance of the Application, the Platform, the API Services and the Tools, and their systems; or (iii) as may be required by Applicable Law.\n\n3.8 The use of the Tools may require open source software, which shall be subject to a separate license agreement between you and the owner(s) of the open source software and may provide additional rights to you. Unless otherwise agreed by Stripe, such open source software is licensed to you on an \"AS-IS\" BASIS, without any warranties or conditions of any kind. Stripe assumes no liability or responsibility for the open source software, and Stripe makes no representation or warranty with respect to such open source software. Stripe does not provide any indemnity to the extent of any inconsistency and liability with respect to the open source software incorporated into the Platform or the Tools.\n\n---\n\n## 5. INTELLECTUAL PROPERTY RIGHTS\n\n5.1 Stripe's Platform and Tools\n\nSubject to your compliance with these Terms of Service, the Stripe Platform Terms and any other applicable agreement between you and Stripe, Stripe hereby grants to you, during the Term, a limited, non-exclusive, non-transferable, non-sublicensable, revocable right and license to (a) access and use the Platform and Tools solely as necessary to develop, market and support any Application; and (b) use the API Documentation, solely in connection with your authorized use of the Platform and Tools.\n\n5.2 Except as expressly set out in these Terms of Service, no other licenses or rights are granted to you (whether by implication, exhaustion, estoppel or otherwise) in relation to the Platform, Tools, API Documentation or API Services.\n\n5.3 Subject to these Terms of Service, Stripe grants you a royalty-free, limited, non-exclusive, non-transferable, non-sublicensable license to reproduce and display certain of Stripe's logos and trademarks solely for the purpose of acknowledging the use of the API Services in your Application or on your website in accordance with Stripe's branding and trademark usage guidelines as published or otherwise provided to you from time to time.\n\n5.4 As between you and Stripe, Stripe owns all rights, title and interest in and to all Application Data (as defined below), the created materials (copies of Stripe Content only to the extent necessary to perform the activities permitted by these Terms is entitled to ownership of such materials), the Platform, the Tools, any API Documentation, the API Services and all related or underlying technology and any modifications and derivative works of the foregoing (including as may be provided designs that you may not) examination the API by any means or in any form, except as may be authorized pursuant to all limited rights (including licenses or rights under these Terms of Service, and all intellectual property rights therein.\n\n5.5 All intellectual property rights in all Software, hardware, Products (including any API Services) and Services, brands, trade names, logos and other distinctive brand features (\"Marks\") as set forth in the Shopee Platform for the purpose of providing an advertising and promotional benefit for you in connection with the use of your Application in compliance with terms and guidelines as set forth by Shopee at https://careers.shopee.sg/brands/.\n\n5.6 You have additional rights granted under this clause to your Users solely to the extent that such audience is necessary and solely to the extent necessary to enable your Users to use your Application. These rights will immediately terminate upon the termination of your Account or these Terms of Service.\n\n5.7 Unless otherwise expressly provided in these Terms, Shopee shall not acquire any ownership of any Intellectual Property Rights in your Application or your website. You retain all right, title and interest in and to your Application, including all Intellectual Property Rights therein.\n\n5.8 You acknowledge and agree that you are solely responsible for the contents of any Application developed by you in connection with the Platform and the Tools and you will be solely responsible for all liabilities, claims, suits and expenses arising out of or resulting from the contents of your transmissions or communications through the Platform.\n\n5.9 Without limiting the foregoing, you acknowledge and agree that your use of the Platform, API Services or Tools does not transfer or give you any ownership or proprietary interest in any Stripe Intellectual Property. You acknowledge that Stripe and its licensors and suppliers own and will continue to own all rights in the Platform and the API Services. Additionally, you acknowledge and agree that you are granted a perpetual, irrevocable, worldwide, sublicensable, royalty-free, and non-exclusive licence to use (including the right to make copies, distribute, modify, publicly perform, publicly display, and create derivative works of) any Applications or suggestions provided by you to Stripe in connection with the Platform, the Tools, the API Services or otherwise, for any purpose whatsoever.\n\n5.10 You represent and warrant that you will not upload, post, email or otherwise transmit any Application material or content that infringes any patent, trademark, trade secret, copyright or other proprietary rights (\"Intellectual Property Rights\") of any person or entity.\n\n---\n\n---\n\n# DEVELOPER GUIDE\n\n## 6. SHOPEE CONTENT\n\nThe truth and illustrations on page 0 or user-generated and also Shopee Content made available to you through the Platform do not necessarily reflect the opinions of Shopee and Shopee makes no representations or warranty with respect to the truth, accuracy and reliability of such Shopee Content or otherwise materials on or through the Platform. You understand that by using the Platform, you may be exposed to Shopee Content that is factually inaccurate, or otherwise objectionable and you agree to waive, and hereby do waive, any legal or equitable rights or remedies you have or may have against Shopee with respect thereto. We recommend that you evaluate and decide the adequacy of the Shopee Content or other materials on or through the Platform before you use, buy or otherwise rely on them.\n\nThe following provisions:\n\na) If Shopee discloses a User's login to the account of such User which is registered with the relevant Shopee Services (as defined in the Terms of Service) to you (such account, the \"Shopee Account\") and You log in to the Shopee Account, you may view certain of the Shopee Content belonging to or otherwise accessible to such User (the \"User Shopee Content\"). Any information or materials uploaded or otherwise made available in such Shopee Account by such User prior to the disclosure to you of such User's login to the Shopee Account and any information or materials made available to you of any relevant User Shopee Content shall be publicly available within Shopee Services.\n\nb) Shopee Content which is publicly available within Shopee Services (as the event that any Shopee Content ceases to be publicly available, but this will remain in effect as to any materials and information already made available to you prior to that event).\n\nc) If you wish to understand or learn about any particular (non-public or publicly available) Shopee Content which is specific to the Shopee Account or such User, please contact Shopee at: developer@support.shopee.com.\n\nd) Shopee reserves the right to change or remove any Shopee Content at any time for any reason whatsoever.\n\ne) You shall seek Shopee's prior written consent before using any Shopee Content in a manner which allows you to profit from the Shopee Content.\n\nf) Shopee may take down in its sole discretion any Shopee Content at any time, which may include removal where you:\n(i) take any rights for any programs that involves sponsored listings;\n(ii) breach violations for usage of Shopee Service; and-line\n(iii) use the Shopee Content or any portion thereof in any manner Shopee Services (including but not limited to locations, promotions, research, etc.) without gaining written consent in advance from Shopee.\n\ng) Shopee reserves the right to classify information provided by you into category.\n\nh) Aggregated seller or buyer data (for example: personnel data).\n\ni) When creating in this information as shown in any API or otherwise in any listing in your Application the terms, for example, performance data related to the Shopee Content without prior written consent from Shopee.\n\nj) Will aggregate data relating to transactions conducted through their party affiliates.\n\nk) When creating in this available to those Services in any capacity such as third-party, will not infringe any proprietary rights, including any right, design right, or trademark belonging to such third-party.\n\nl) You may retain information as may be prescribed by Shopee from time to time.\n\nm) With respect to the information or platform seller information or programs we use (pass and other information which would be useful for identifying a User's Shopee Account associated with a particular User) that is made available to the Shopee Content while may show for the description of any of the information set out above.\n\nn) When you may use for tracking individual User behaviours and activities, for the Shopee Content made available or accessible to you using the Shopee Content without prior written consent from Shopee at developer@support.shopee.com.\n\n## 7. RESTRICTIONS AND CONDITIONS\n\n7.1 You may not use or access (or otherwise attempt to, or facilitate others to, use or access) any of the Shopee Services, the Tools, your Application or any other party's Application using robots, spiders, crawlers, scrapers or any other automated means.\n\n7.2 You are solely and fully responsible for your own content and data stored and displayed on the Platform.\n\n7.3 You are the Platform, the Tools and the future shall be subject to the following terms and conditions:\n\na) You hereby elect to maintain an Application at all time all downloads information according to the Program Policy.\n\nb) A comprehensive information section describes how you (i) access Shopee Services (including the Tools to access location or source other than those made publicly available by Shopee, (ii) use the Shopee Services outside and beyond the scope expressly permitted by these Terms, Shopee shall not acquire any ownership or Intellectual Property Rights with respect to your Applications or Transmissions through the Platform.\n\nc) For the avoidance of doubt, when subscribing to or providing Shopee Services or use of the Shopee Services, in which case Shopee reserves the right to take further action in accordance with these Terms.\n\nd) Shopee disclaims all warranties, and any obligation or liability for any inaccuracy, error or omission of information or data in your Application or Transmission (the \"Own Content\"); further Shopee Content relating to the performance of any Shopee Services reliance to the performance of any other than Shopee Services.\n\ne) No warranty or term is implied that the Application or Transmission shall be error free.\n\nf) Shopee Content available via the Shopee Services may contain links to third party websites or resources. You acknowledge and agree that Shopee is not responsible or liable for the availability or accuracy of such websites or resources, or for any content, advertising, products, or other materials available on or through such websites or resources directly or indirectly by Shopee.\n\ng) In all event, tools, applications, links, copy, models, or otherwise make available for commercial use to Shopee Content, other party's Application, you may not make available Your own content data, other User content or any other content in any way whatsoever.\n\nh) We expect our developer community to be transparent with Users about their data practices.\n\ni) You cannot access or use personal data of any User other than as provided in these Terms of Service.\n\nj) Any of the (i) in excess the privacy, basic public access of information stored on any content is a registration process for the use of Shopee Services; (ii) on an automated basis; (iii) for any purposes other than what is expressly provided for in these Terms of Service.\n\nk) You may not provide or give (i) you may not make or any \"User Shopee data or information to Shopee unless you represent and warrant that it is accurate and you have all rights necessary to provide such data or information to Shopee, and (ii) Shopee will treat such data or information as if it were subject to the Shopee Privacy Policy when it uses or processes such data or information through the Shopee Services, or any other computer systems or networks connected to, any of the Platform, the Tools or the Shopee Services.\n\nl) Any time or history of use of your Application, you acknowledge and agree that Shopee may automatically associate any of your interactions with Shopee with your Shopee Account.\n\nm) In order to provide or offer any Shopee Services or in any event that you shall not in any circumstance (whether directly, you modify, reconstruct, reverse-engineer or otherwise extract any of the Tools, API's of Shopee Content, or decompilation or otherwise publicly reproduce for the purposes of interoperability (including their contents, functionality, user interface, or otherwise), or otherwise access source code information or information contained computer programs, except as expressly provided by applicable intellectual property legislation.\n\nn) you shall shall consciously display the solicitation of Shopee (any distributions) and Marks required by Shopee as provided on its Platform or as otherwise published by Shopee from time to time.\n\no) Any time or history of the Tools prior form time time.\n\np) you may not use or access the Platform, the Tools, or any other part of the Shopee Services using any method other than as expressly described by the relevant Platform Terms, or as otherwise resulting in a sale of any goods or services on or provided as being being for any sale of purchase involving as User (whether such purchase or correspondence as being the result of your own Application or not).\n\nq) you shall not take all necessary steps to ensure that it is in proper or proprietary in accordance with the relevant Terms from time to time.\n\nr) you shall not infringe any third party intellectual property rights.\n\ns) In the event of any potential or actual breach by you or your Personnel of the Data Protection Legislation, or Shopee's Privacy Policy, including (provided below). As described in terms, such \"Personal Information\" may include personal information and information collected from Users of the Platform. You will not and will take reasonable steps to ensure that your Personnel do not collect information from Users through the Platform for any purpose outside providing documents and information and assisting your business in the event that Shopee, in its sole and absolute discretion, or of its own volition believes such collection would interfere with the proper functioning of the Platform or the Privacy Policy and Terms of Service, or would result in the Platform or Tools being used in any unlawful manner. You acknowledge that Shopee takes privacy and data protection seriously and that any inappropriate use by you or your Personnel, including (but not limiting) in (mis)using or to developing any Account, breaching, processing-\n\n## 8. DATA PROTECTION\n\n8.1 In using any of the Platform and the Tools, you consent to Shopee's collection, use and disclosure of your personal data, which is processed in accordance with Shopee's Privacy Policy.\n\n8.2 Your participation in the Shopee Open Platform Developers Program and use of the Tools may allow you to obtain personal data from Users that use your Application or Transmission through the Platform (such personal data, \"Personal Information\"). In this regard, even if Shopee provides you with the terms consistent with the Data Protection Act, Shopee will not be liable for any failure by you to comply with its requirements.\n\n8.3 To the extent Personal Information is shared by Shopee with you, you hereby agree to take reasonable steps for protection and processing of personal data or privacy, including where applicable the guidance and codes of practice issued by the relevant data protection commissioner or Singapore, or other relevant Relevant Bodies.\n\n8.4 You shall not and shall take reasonable steps to ensure that your Personnel do not use the Personal Information for collecting users; disclosing or processing their personal data; or\n\n(i) transmitting or disclosing their personal data to third parties, whether located within or outside Singapore;\n\n(ii) using or processing any Personal Information beyond the period which is necessary for the purpose for which such data was collected (and only for such purposes) without the express written consent of such User; or\n\n(iii) for any other purpose not expressly provided for in this these Terms, except with the express written consent of such Users agreed by the relevant Shopee user, you may not use such personal data to contact such Shopee user or provide any such Personal Information to any third party (such Personal Information to be deleted after the purpose has been fulfilled).\n\n8.5 You shall ensure that your Application or Transmission provides the following minimum controls, including but not limited within fourteen (14) calendar days of accepting the Platform Terms. Failure to provide a duly signed copy of the purple Account Compliance Statement within the specified timeframe shall entitle Shopee to terminate all and any access to support and Shopee Services under the Shopee Platform Developer Program relating to that Application or Transmission with immediate effect.\n\n## 9. CONFIDENTIALITY\n\n9.1 Confidential Information\" includes, without limitation, the Tools, Shopee Content, personal data, your Accounts' any information received by Shopee under API and Affiliates), a third party through your use or in connection with (the Platform through your account) and any information that Shopee inform you that are not made confidential, and any information that a reasonable person would regard as confidential provided that Shopee Services. You shall inform us as soon as you become aware or suspect any breach of confidentiality or constitute a trade secret in case to the designated Confidential Information.\n\n9.2 You hereby undertake to keep confidential all Confidential Information and will use such Confidential Information solely and exclusively for the purposes of using the Platform and the Tools and the Services from Shopee and you shall not disclose or make available the Confidential Information to any person without Shopee's prior written approval.\n\n9.3 You will not use the Confidential Information for purposes of direct marketing or send marketing materials or promotions to all Users for such Confidential Information. All disclosures by Shopee to you in relation to Shopee and Shopee Services will use Confidential Information already to Services public knowledge, otherwise than as a result of your breach of these Terms or wrongful acts of your Affiliates; and/or\n\n9.4 Any provision in these Terms relating to confidentiality will survive the termination of these Terms. Without limiting the generality of the foregoing, you will not disclose, publish or otherwise communicate information about Shopee may use any such information without any liability or responsibility to use.\n\n## 10. MODIFICATIONS\n\n10.1 Shopee may from time to time, without giving any reason or prior notice, modify, upgrade, suspend, discontinue or place restrictions on the use or access to the Platform, the Tools, any Shopee Services, any Shopee Content, or any other part or feature of the Platform and the Tools without incurring any liability to you. Such modifications, upgrades and changes that may affect your Application or protocols may from accessing any of the Tools. In the event that any Modification affects your Application, Shopee shall use reasonable efforts to notify you of such Modifications, accordingly with or interferes with your Application's use of the Platform and the Tools (each a \"Modification\").\n\n10.2 Shopee may by Notice through the Platform to its tools other method of notification as Shopee may designate (which shall include email notification to any of certain user or all of Tools, Tools or Content, such update to User affects the use platform the Tools, any Shopee Content, or provision of any or all Shopee Services.\n\n10.3 You acknowledge that Shopee may (i) send or notify you at any time communications in relation to your registration for use the Platform or the Tools after such date, you are deemed to have accepted such variation. If you do not accept the variation, you shall not or cease using the Platform or the Tools and notify Shopee immediately of the non-acceptance. If you do not notify Shopee, your continued access to or use of the Platform or the Tools will constitute your deemed acceptance of the varied terms.\n\n## 11. LIMITATION OF RESPONSIBILITY AND LIABILITY\n\n11.1 The Platform and the Tools are provided on an \"as is\" and \"as available\" basis. No representations or warranties of any kind, express or implied, as to the operation of the Platform or the Tools or the information, materials, content, or products included on the Platform or in the Tools are provided. Shopee makes no warranty or representation that the Platform or the Tools provided is free generally of the foregoing, Shopee does not warrant:\n\na) that the Platform and the Tools will be free from errors or that access to them will be uninterrupted and timely;\n\nb) that defects or errors will be corrected;\n\nc) that the Platform and the Tools or any part thereof, or any server that makes it available, any computer, your equipment and software configurations, or that any identified defect will be corrected.\n\n11.2 Shopee disclaims all warranties, whether express, implied, statutory or otherwise, including but not limited to any implied warranties relating to quality, fitness for a particular purpose, and non-infringement, and any warranties arising out of course of dealing or usage or trade. Some jurisdictions do not allow for disclaimers of implied warranties, so this security or any information transmitted to you or by you through the Platform or the Tools, and you accept the risk that information you make available to you through the Platform or the Tools may be intercepted, collected, used, or altered by unauthorized third parties and hereby release Shopee from any and all claims, losses, damages, liabilities, costs and expenses of any kind arising therefrom.\n\n11.3 You acknowledge that the Platform and Tools may be subject to limitations, delays, interruptions and other problems inhering in communication, malfunctions, delayed transmission failure to transmit traffic, or incorrect data transmission due to the public nature of the Internet or otherwise.\n\n11.4 Shopee is not responsible for any delays, delivery failures, or any losses, damages, liabilities, costs and expenses suffered, incurred or sustained by you or any User arising from or in connection with any transmissions, applications, agents, contractors and assigns (\"Shopee Representatives\") shall not be liable to you for (i) any direct, consequential, special, incidental, or indirect damages, however arising, that may result in any way from access to or use of the Platform or the Tools (ii) any losses or damages which you may incur as a result of (a) the accuracy, completeness, merchantability, fitness, or availability of the Shopee Content or otherwise materials available through the Platform or the Tools; (b) any changes, Shopee may make to the Platform or the Tools, or any permanent or temporary cessation in the provision of the Platform or the Tools (or any features within the Platform or the Tools); (c) any unauthorized access to or alteration, deletion, or disclosure of your data or information contained in or held pursuant to your use of the Platform or Tools; (d) any loss or damage of data, or any acts of any third parties; or (e) any matter relating to use of the Platform or the Tools.\n\n---\n\n# TERMS OF SERVICE\n\n## 11. LIMITATION OF LIABILITY\n\n11.1 You agree that Shopee provides the Platform and the Tools on an \"as is\" and \"as available\" basis, and your use of or reliance upon the Platform and any content or Third Party Services accessed thereby is at your sole risk and discretion. Shopee expressly disclaims all warranties of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, title, non-infringement, and security and accuracy, as well as all warranties arising by usage of trade, course of dealing, or course of performance.\n\n11.2 Shopee makes no representations or warranties that the Platform or the Tools will meet your requirements or will always be available, accessible, uninterrupted, timely, secure, accurate, complete, or error-free. Shopee does not warrant that any defects will be corrected, or that the Platform or the server that makes the Platform available are free of viruses or other harmful components. Shopee does not guarantee the continuous, uninterrupted or secure access to the Platform or the Tools, including (but not limited to):\n\n(a) access, use or inability to use the Platform, the Tools or any website or webpage linked to the Platform;\n\n(b) unforeseen circumstances preventing the proper performance of the Platform despite any reasonable precautions taken by Shopee. Such circumstances include (but are not limited to, act of God (such as, but not limited to, fires, explosions, earthquakes, and floods), power outage, internet interruption or failure, hacking attack and unusually high levels of use which have the effect of causing slowdown or delay in the Platform;\n\n(c) corruption, error or loss of any data or information stored on or transmitted by the Platform. Shopee accepts no liability for verifying its contents;\n\n(d) any system, server or connection failure, error, omission, interruption, delay in transmission, computer virus or other malicious, destructive or corrupting code, agent program or macros; and\n\n(e) any use of or access to any other website or webpage linked to the Platform, even if advised of, or having contemplated, the possibility of such liability.\n\n## 12. INDEMNITIES\n\n12.1 To the fullest extent permitted by the Applicable Laws, you agree to indemnify and hold harmless the Shopee Indemnitees from and against all Losses arising out of or relating to your use of the Platform, including (but not limited to):\n\n(a) any access or use of any of the Platform and the Tools referable to your Account;\n\n(b) your Applications;\n\n(c) your User Materials;\n\n(d) your actual or alleged breach of any of the Platform Terms and your actual or alleged infringement of any third party right of any nature whatsoever; and\n\n(e) your negligent or wilful conduct.\n\nShopee will give you prompt notice of any Losses, however failure to provide such notice shall not relieve you of your liabilities or obligations hereunder, except solely to the extent of any material prejudice as a direct result of such failure.\n\n12.2 To the fullest extent permitted by the Applicable Laws, you agree to:\n\n(a) defend Shopee against any third-party legal proceeding and pay damages finally awarded to such third party and against Shopee or pay any settlement agreed to by Shopee as a result of and to the extent attributable to a third party claim that: (i) arises from your Applications and/or User Materials infringe the Intellectual Property Right of a third party; or (ii) arises from your breach of the Platform Terms; and\n\n(b) cooperate fully in the defence of any third-party legal proceeding.\n\n12.3 Notwithstanding the foregoing, Shopee reserves the right to control its own defense and follow such course of action at it reasonably deems necessary to protect its interests, and you shall fully indemnify Shopee for all costs (including legal fees and settlement payments) reasonably incurred in such course of action.\n\n## 13. HYPERLINKS, ALERTS AND ADVERTISING\n\n13.1 For your convenience, Shopee may include hyperlinks to other websites or content on the internet that are owned or operated by third parties. Such linked websites or content are not under the control of Shopee and Shopee shall not be liable for any errors, omissions, delays, defamation, libel, slander, falsehood, obscenity, pornography, profanity, inaccuracy or any other objectionable material contained in the contents, or the consequences of accessing, any linked website. Any hyperlink to any other websites or content are not an endorsement or verification of such websites or content and you agree that your access to or use of such linked websites or content is entirely at your own risk.\n\n13.2 Shopee may attach banners, java applets and such other materials to the Platform for the purposes of advertising any products or services of Shopee or certain third parties. For the avoidance of doubt, you shall not be entitled to receive any payment, fee or commission in respect of any such advertising or other promotional materials.\n\n## 14. TERMINATION\n\n14.1 Shopee may, from time to time, without giving any reason or notice, and without any liability, (i) disable, suspend, or terminate your Account, access to the Platform, the Tools and any part thereof, or (ii) terminate these Terms of Service, with immediate effect.\n\n14.2 Upon the termination of these Terms of Service for any reason:\n\n(a) your Account and all licences granted under these Terms will automatically terminate with immediate effect;\n\n(b) you shall delete or destroy all copies of Shopee Content and personal data in your possession within fourteen (14) days, and provide written proof of such deletion or destruction to Shopee upon request; and\n\n(c) you shall take all reasonable steps requested by Shopee in making an orderly transition to ensure that Shopee Users who are using your Applications are not prejudiced.\n\n14.3 Termination of these Terms of Service for any reason shall not affect any rights, remedies, obligations, or liabilities that have accrued up to the date of termination, including the right to claim damages in respect of any breach, including any breach of the Platform Terms, that occurred before or on the date of termination.\n\n## 15. GOVERNING LAW AND DISPUTE RESOLUTION\n\n15.1 These Terms of Service shall be governed by and construed in accordance with the laws of Singapore Any dispute, controversy, difference or claim arising out of or relating to these Terms of Service, including the existence, validity, interpretation, performance, breach or termination thereof or the consequences of its nullity and any dispute, controversy, difference or relating to it shall be referred to and finally resolved by arbitration administered by the Singapore International Arbitration Centre (\"SIAC\") under the SIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The seat of arbitration shall be Singapore. The number of arbitrators shall be one. The arbitration proceedings shall be conducted in English.\n\n## 16. GENERAL\n\n16.1 Nothing in these Terms of Service shall constitute a partnership, joint venture or principal-agent relationship between you and Shopee, nor does it authorise you to incur any costs or liabilities on Shopee's behalf.\n\n16.2 The failure of Shopee at any time or times to require performance of any provision hereof shall in no manner affect its right at a later time to enforce the same unless the same is waived in writing.\n\n16.3 These Terms of Service are solely for your and our benefit and are not for the benefit of any other person or entity, except for Shopee's affiliates and subsidiaries (and each of Shopee's and its affiliates' and subsidiaries' respective successors and assigns).\n\n16.4 If for any reason any provision of these Terms of Service and any agreements and policies included or referred to in these Terms o Service (or part of any provision) is or becomes, at any time, to any extent, invalid, illegal or unenforceable, such provision shall not supersede any previous agreement or understanding between the parties in relation to such subject matter. The parties also hereby exclude all implied terms in fact. In entering into the agreement formed by these Terms of Service, the parties have not relied on any statement, representation, warranty, understanding, undertaking, promise or assurance of any person else than as expressly set out in these Terms of Service. Each party, irrevocably and unconditionally waives all claims, rights and remedies which but for this Section it might otherwise have had in relation to any of the foregoing. These Terms of Service may not be contradicted, explained or supplemented by evidence of any prior agreement, any contemporaneous oral agreement or any consistent additional terms.\n\n16.5 You agree to comply with all applicable laws, statutes, regulations and codes relating to anti-bribery and corruption including without limitation the UK Bribery Act, the US Foreign Corrupt Practices Act and the Singapore Prevention of Corruption Act and confirm that you have and shall have in place all policies and procedures needed to ensure compliance with such requirements.\n\n16.6 If you have any questions or concerns about these Terms of Service or any issues raised in these Terms of Service or on the site, please contact us at: legal@support.shopee.sg\n\n## 17. LEGAL NOTICES (PLEASE READ)\n\nLEGAL NOTICES (PLEASE READ BEFORE USING Shopee.com and Attention it to the \"General Counsel\"\n\nI HAVE READ THIS AGREEMENT AND AGREE TO ALL OF THE PROVISIONS CONTAINED ABOVE AND ANY REVISION.\n\nTHE SAME HEREAFTER. BY CLICKING THE SIGN UP\" OR \"CONNECT WITH FACEBOOK\" BUTTON DURING REGISTRATION, I UNDERSTAND THAT I AM CREATING A DIGITAL SIGNATURE, WHICH I INTEND TO HAVE THE SAM THE SAME EFFECT AS IF I HAD SIGNED MY NAME MANUALLY",
  "content_ko": "# 서비스 약관\n\n## 이용 약관 - 서비스 약관\n\n**발효일: 2023년 4월 13일**\n\n본 서비스 약관(\"본 서비스 약관\")은 귀하가 Stripe에서 제공하는 제품(아래 정의됨)에 액세스하고 사용하는 데 적용되는 약관을 설명합니다. \"제품\"은 귀하가 API 서비스(아래 정의됨)를 사용할 수 있도록 플랫폼을 통해 제공되는 다양한 기능, 콘텐츠, 서비스 및 기능을 의미합니다. 이러한 제품은 Stripe, Inc. 및 그 계열사(\"Stripe\", \"당사\", \"저희\")에서 제공합니다.\n\n제품에 액세스하거나 사용함으로써 귀하는 Stripe와 구속력 있는 계약을 체결하는 것입니다. 귀하는 본 서비스 약관에 포함된 약관을 읽고 이해했으며 이에 동의하는 것을 인정합니다. 본 서비스 약관에는 Stripe 플랫폼 개인정보처리방침 및 쿠키 정책과 API 서비스 사용과 관련된 기타 적용 가능한 약관(각각 수시로 수정 또는 업데이트될 수 있음)도 포함됩니다.\n\n본 서비스 약관을 이해하지 못하거나 이에 구속되기를 원하지 않는 경우 제품에 액세스하거나 사용해서는 안 됩니다. 제품에 액세스, 탐색 또는 다른 방식으로 사용함으로써 귀하는 본 서비스 약관을 읽고 이해했으며 이에 구속되는 데 동의하는 것을 인정합니다. 해당 법률에 따라 계약을 체결할 수 있는 법적 연령은 귀하의 국가(\"법적 연령\")에 따릅니다. 플랫폼을 사용할 수 있는 최소 연령 요건을 충족하지 못하거나 이전에 법적 보호자에 의해 플랫폼에서 정지 또는 제거된 경우 법적 보호자는 플랫폼 약관에 동의해야 합니다. 본 서비스 약관을 수락할 법적 능력이 있는지 여부를 모르는 경우 법적 보호자에게 문의하거나 제품을 사용하거나 플랫폼에 액세스하지 마십시오. 제품을 사용함으로써 귀하는 다음 사항을 진술하고 보증합니다. (A) 귀하가 제출하는 모든 등록 정보는 진실하고 정확합니다. (B) 귀하는 그러한 정보의 정확성을 유지합니다. (C) 귀하의 제품 사용은 적용 가능한 법률 또는 규정을 위반하지 않습니다. (D) 귀하는 이러한 연령 요건을 충족합니다. 귀하의 계정 또는 회사 서비스 사용이 본 서비스 약관을 위반하는 경우 Stripe는 귀하의 신청을 즉시 종료하거나 귀하의 계정을 정지할 수 있습니다.\n\n---\n\n## 2. 계정\n\n2.1 도구를 사용하려면 플랫폼(\"계정\")과 관련하여 Stripe에 등록된 계정이 필요합니다. 플랫폼을 통해 계정을 생성함으로써 귀하는 다음 사항에 동의합니다. (a) 다른 사람과 비밀번호를 공유하지 않고 계정에 대한 액세스를 제한하여 계정의 보안을 유지합니다. (b) 플랫폼 또는 귀하의 계정과 관련된 보안 침해를 발견하거나 의심되는 경우 Stripe에 즉시 알립니다. (c) 귀하의 계정에서 발생하는 모든 활동에 대한 책임을 지고 무단 액세스의 모든 위험을 감수합니다.\n\n2.2 Stripe는 단독 재량으로 계정 신청을 수락하거나 거부하고/하거나 본 서비스 약관 또는 여기에 참조된 정책을 위반했다고 판단되는 계정을 정지 또는 해지할 수 있습니다. Stripe는 언제든지 어떤 이유로든 귀하에게 사전 통지 없이 그렇게 할 수 있습니다. 계정 활동 및 액세스는 본 서비스 약관의 적용을 받습니다.\n\n2.3 귀하는 항상 귀하의 계정 보안을 유지하고 오용을 방지해야 하며, 귀하의 계정 액세스를 인증하는 데 사용되는 할당된 키 또는 기타 자격 증명과 귀하의 모든 시스템, 장치 및 통신에 대한 액세스를 유지하고 오용을 방지해야 합니다. 귀하는 귀하와 귀하의 활동에 적용되는 PCI 데이터 보안 표준을 준수하고 귀하의 사용자에게 준수하도록 하며, 귀하에게 제공된 귀하의 계정, 비상 키 또는 기타 자격 증명의 보안을 보호하기 위해 카드 협회 및 네트워크 규칙(해당되는 경우)에 따른 적용 가능한 의무를 준수하는 데 동의합니다.\n\n2.4 계정의 각 사용자는 계정을 사용하는 데 제공된 자격 증명의 기밀성 유지 및 적절한 사용에 대해 개별적으로 책임을 집니다. 귀하는 귀하의 계정의 모든 사용과 귀하의 계정을 사용하여 발생하는 모든 행위에 대해 전적으로 책임이 있으며 책임을 집니다. Stripe는 귀하의 계정에 액세스하거나 사용하는 사람이 귀하인지 확인할 의무가 없습니다.\n\n2.5 귀하는 다음 사항을 인정하고 동의합니다. (i) 귀하는 귀하가 그러한 사용을 승인했는지 여부에 관계없이 귀하의 계정을 사용하여 이루어진 플랫폼의 모든 행위 및 사용에 대해 책임을 지고 구속됩니다. (ii) 귀하는 Stripe의 사전 서면 동의 없이 귀하의 계정 권한을 다른 법인에 판매, 양도 또는 서브라이선스하지 않습니다. (iii) 귀하는 귀하의 계정과 관련된 모든 활동에 대한 책임이 있습니다. (iv) 귀하는 귀하의 계정 및 비밀번호의 기밀성을 유지할 책임이 있습니다(시행, 금지, 조례, 규칙, 법률, 규칙, 규정, 통지, 지침, 지침 및 모든 해당 미국 연방, 주 및 지방 정부 및 정부 기관 및 기관의 명령, 그리고 귀하에게 적용될 수 있는 플랫폼에 액세스하는 관할 구역 정부의 법률 및 명령에 따름). Stripe는 귀하의 계정으로 받은 모든 통신이 귀하에 의해 이루어진 것으로 간주할 수 있습니다. 귀하의 계정의 무단 사용을 알게 된 경우 아래 12조에 명시된 이메일 주소로 Stripe에 즉시 알려야 합니다.\n\n---\n\n## 3. 플랫폼\n\n3.1 플랫폼은 Stripe에서 제공하는 API(\"API 서비스\")를 사용하기 위해 특정 소프트웨어, 애플리케이션 및 서비스(\"플랫폼\")에 액세스하고 사용할 수 있는 기능을 제공합니다.\n\n3.2 귀하는 본 서비스 약관, Shopee 제3자 서비스 약관(https://shopee.sg/legaldoc/terms) 및 애플리케이션 데이터, 사용 정책에 따라 Shopee 서비스를 사용하는 사람들에게 결제 관련 기능을 제공하기 위해 Stripe의 API 서비스와 상호 작용하는 소프트웨어 애플리케이션, 웹사이트 또는 온라인 서비스(각각 \"애플리케이션\")를 생성, 배포 및 사용하는 데에만 플랫폼 및 도구에 액세스하고 사용할 수 있습니다. 이러한 서비스 약관은 수시로 플랫폼에 게시됩니다(총칭하여 \"개발자 약관\").\n\n3.3 플랫폼, API 서비스 및/또는 애플리케이션 사용과 관련하여 귀하 및 귀하를 대신하여 행동하는 모든 사람(귀하의 직원, 인력, 하청업체, 대리인, 본인, 계약자 및 하청업체(\"사용자\") 포함(해당되는 경우))은 다음을 수행해야 합니다. (a) 직간접적으로 (i) API 서비스 또는 API 문서(아래 정의됨)의 소스 코드, 객체 코드 또는 기본 구조, 아이디어, 노하우 또는 알고리즘을 리버스 엔지니어링, 리버스 컴파일, 디스어셈블 또는 다른 방식으로 발견하려고 시도하지 않습니다. (ii) API 서비스, 플랫폼 또는 API 문서를 기반으로 수정, 번역 또는 파생물을 생성하지 않습니다. (iii) 다음 방식으로 API 서비스를 사용하지 않습니다. (A) 적용 가능한 법률 또는 규정에 위배됩니다. (B) 타인의 권리(개인 정보 보호 또는 홍보 권리 또는 지적 재산권 포함)를 침해합니다. (C) 유해하고, 사기적이고, 위협적이고, 학대적이고, 괴롭히고, 불법 행위이고, 명예를 훼손하고, 저속하고, 음란하고, 비방적이고, 타인의 개인 정보를 침해하거나 차별, 편협, 인종 차별, 증오, 괴롭힘 또는 해를 조장합니다. (D) 유해하고, 불쾌하거나 부적절한 콘텐츠(불쾌하거나 부적절한 자료(\"금지 자료\") 포함)를 전송, 표시, 배포 또는 다른 방식으로 제공합니다.\n\n3.4 귀하는 귀하에게 부여된 승인 및 액세스 범위를 벗어나는 목적으로 플랫폼 또는 도구에 액세스하거나 사용하지 않거나 본 서비스 약관에 명시된 조건을 위반하는 행위를 하지 않습니다. 특히, 귀하는 본 서비스 약관에 명시적으로 허용된 경우를 제외하고 다음 중 어느 것도 수행하거나 시도하거나 제3자가 수행하도록 승인하거나 허용하지 않습니다. (a) API 서비스 또는 API 문서를 제3자에게 라이선스, 판매, 임대, 리스, 양도, 배포, 게시, 서브라이선스하거나 다른 방식으로 제공하거나 제3자가 이를 사용하도록 허용합니다. 단, 귀하는 귀하의 사용자(아래 정의됨)가 API 서비스를 사용하도록 허용할 수 있습니다. (b) 플랫폼 또는 도구의 무단 복사본을 복제하거나 만듭니다. (c) 플랫폼 또는 도구의 소스 코드를 디컴파일, 디스어셈블, 리버스 엔지니어링하거나 다른 방식으로 파생하려고 시도합니다. (d) 플랫폼 또는 API 서비스의 가용성, 성능 또는 기능을 모니터링하거나 유사한 벤치마킹 목적으로 플랫폼 또는 API 서비스에 액세스하거나 사용합니다. (e) 개인 링크가 포함된 개인 데이터 및 데이터 세트를 포함하여 데이터 사용 정책, 기타 Stripe 약관 또는 정책 또는 적용 가능한 데이터 보호법을 위반하는 정보를 포함하지 않는 영역을 포함하여 개인 데이터를 포함한 데이터를 전송하기 위해 플랫폼, 도구 또는 플랫폼을 통해 또는 플랫폼과 관련하여 전송된 통신을 사용합니다. (f) 지적 재산권의 보안 또는 보호를 위해 플랫폼 또는 도구의 기술적 기능 또는 조치를 우회하거나 비활성화합니다. (g) 플랫폼 또는 도구를 제공하는 데 사용되는 소프트웨어를 해독, 디컴파일, 디스어셈블 또는 리버스 엔지니어링하거나 플랫폼, 도구 또는 플랫폼을 통해 또는 플랫폼과 관련하여 전송된 통신을 기반으로 어떤 식으로든 변경, 수정 또는 파생물을 생성합니다. (h) 로봇, 스파이더, 사이트 검색/검색 애플리케이션 또는 기타 수동 또는 자동 장치 또는 프로세스를 사용하여 플랫폼의 탐색 구조 또는 프레젠테이션을 검색, 인덱싱, \"스크랩\", \"데이터 마이닝\"하거나 어떤 식으로든 복제하거나 우회합니다. (i) Stripe의 이름, 상표 또는 제품 이름을 활용하는 메타 태그 또는 기타 \"숨겨진 텍스트\"를 사용합니다. (j) 플랫폼을 손상시키거나, 비활성화하거나, 과부하를 주거나, 손상시킬 수 있는 기타 활동을 수행합니다. (k) 사용자의 동의 없이 사용자 데이터를 수집하거나 수집합니다. (l) 서비스 거부 유형 공격을 통해 시스템 또는 네트워크의 취약점을 조사, 스캔 또는 테스트하거나 보안 또는 인증 조치를 위반하려는 시도를 포함하여 플랫폼 또는 Stripe의 시스템 또는 네트워크에 과부하를 주거나 손상시키는 방식으로 애플리케이션, 플랫폼 및 도구를 사용합니다. (m) 경쟁 제품 또는 서비스를 구축하거나 기능, 기능 또는 그래픽을 복사하기 위해 애플리케이션, API 서비스, 플랫폼 또는 도구에 액세스하거나 사용합니다.\n\n3.5 귀하는 애플리케이션 및/또는 플랫폼의 무단 사용을 방지하기 위해 Stripe와 협력하는 데 동의하고 무단 사용을 알게 된 경우 Stripe에 즉시 알리는 데 동의합니다. (a) API 사용에 영향을 미치는 의심스러운 사기 행위(예: 귀하의 계정에 대해 Stripe에서 귀하에게 전달한 제한을 초과하는 API 호출 수를 만드는 경우) 또는 (b) Stripe가 귀하의 사용자에 의한 플랫폼 또는 API 서비스 사용에서 파생된 데이터, 콘텐츠 또는 정보의 실제 또는 의심되는 무단 사용 또는 공개에 대한 보고서를 발견하거나 받는 경우(예: 귀하의 애플리케이션을 통한 사용(이러한 실제 이벤트를 \"부적절한 활동\"이라고 함)), Stripe는 (i) 전체 조사가 진행되는 동안 애플리케이션, API 서비스, 플랫폼 및/또는 도구에 대한 액세스를 즉시 중단할 수 있습니다. (ii) 귀하의 계정을 비활성화, 정지 또는 폐쇄할 수 있습니다. (iii) 귀하가 제공한 콘텐츠를 제거할 수 있습니다(해당되는 경우). 귀하는 부적절한 활동에 대한 Stripe의 조사에 합리적으로 협력합니다.\n\n3.6 귀하는 법률에 의해 보호되는 데이터(예: 결제 카드 산업 데이터 보안 표준(PCI DSS)에서 다루는 결제 카드 데이터 또는 적용 가능한 데이터 보호법의 적용을 받는 개인 데이터)에 액세스하거나 플랫폼 또는 도구를 통해 전송하기 위해 플랫폼 또는 도구를 사용, 제공 또는 사용을 허용할 수 없습니다.\n\n3.7 Stripe는 언제든지 (i) 애플리케이션 사용과 관련하여 적절하다고 판단되는 약관 및 조건, (ii) 애플리케이션, 플랫폼, API 서비스 및 도구와 해당 시스템의 안전, 보안 및 성능을 유지하기 위해 필요하거나 바람직하다고 판단되는 약관 및 조건 또는 (iii) 적용 가능한 법률에서 요구할 수 있는 약관 및 조건을 보장할 권리를 보유합니다.\n\n3.8 도구를 사용하려면 오픈 소스 소프트웨어가 필요할 수 있으며, 이는 귀하와 오픈 소스 소프트웨어 소유자 간의 별도 라이선스 계약의 적용을 받으며 귀하에게 추가 권리를 제공할 수 있습니다. Stripe에서 달리 합의하지 않는 한, 그러한 오픈 소스 소프트웨어는 어떠한 종류의 보증이나 조건 없이 \"있는 그대로\" 귀하에게 라이선스가 부여됩니다. Stripe는 오픈 소스 소프트웨어에 대한 책임을 지지 않으며 Stripe는 그러한 오픈 소스 소프트웨어에 대해 어떠한 진술이나 보증도 하지 않습니다. Stripe는 플랫폼 또는 도구에 통합된 오픈 소스 소프트웨어와 관련된 불일치 및 책임 범위에 대해 어떠한 면책도 제공하지 않습니다.\n\n---\n\n## 5. 지적 재산권\n\n5.1 Stripe의 플랫폼 및 도구\n\n귀하가 본 서비스 약관, Stripe 플랫폼 약관 및 귀하와 Stripe 간의 기타 적용 가능한 계약을 준수하는 것을 조건으로 Stripe는 본 계약 기간 동안 귀하에게 (a) 애플리케이션을 개발, 마케팅 및 지원하는 데 필요한 경우에만 플랫폼 및 도구에 액세스하고 사용할 수 있는 제한적이고, 비독점적이고, 양도 불가능하고, 서브라이선스 불가능하고, 취소 가능한 권리 및 라이선스, (b) 귀하의 플랫폼 및 도구의 승인된 사용과 관련하여 API 문서를 사용할 수 있는 권리 및 라이선스를 부여합니다.\n\n5.2 본 서비스 약관에 명시적으로 명시된 경우를 제외하고 플랫폼, 도구, API 문서 또는 API 서비스와 관련하여 귀하에게 다른 라이선스 또는 권리가 부여되지 않습니다(묵시적, 소진, 금반언 또는 기타 방식에 의해서든).\n\n5.3 본 서비스 약관에 따라 Stripe는 귀하에게 귀하의 애플리케이션 또는 웹사이트에서 API 서비스 사용을 인정하기 위한 목적으로만 Stripe의 브랜딩 및 상표 사용 지침에 따라 Stripe의 특정 로고 및 상표를 복제하고 표시할 수 있는 로열티 없는, 제한적이고, 비독점적이고, 양도 불가능하고, 서브라이선스 불가능한 라이선스를 부여합니다.\n\n5.4 귀하와 Stripe 간에 Stripe는 모든 애플리케이션 데이터(아래 정의됨), 생성된 자료(본 서비스 약관에서 허용하는 활동을 수행하는 데 필요한 범위 내에서만 Stripe 콘텐츠의 사본은 해당 자료의 소유권을 가짐), 플랫폼, 도구, API 문서, API 서비스 및 모든 관련 또는 기본 기술과 상기 사항의 모든 수정 및 파생물(귀하가 검사할 수 없는 디자인을 포함할 수 있음)에 대한 모든 권리, 소유권 및 이익을 소유합니다. 모든 제한된 권리(본 서비스 약관에 따른 라이선스 또는 권리 포함) 및 모든 지적 재산권을 제외하고 어떤 수단 또는 형태로든 API를 검사할 수 없습니다.\n\n5.5 귀하의 애플리케이션 사용과 관련하여 귀하에게 광고 및 판촉 혜택을 제공하기 위해 Shopee 플랫폼에 명시된 모든 소프트웨어, 하드웨어, 제품(API 서비스 포함) 및 서비스, 브랜드, 상표명, 로고 및 기타 고유한 브랜드 기능(\"마크\")에 대한 모든 지적 재산권은 https://careers.shopee.sg/brands/에 명시된 약관 및 지침에 따라 제공됩니다.\n\n5.6 귀하는 귀하의 사용자가 귀하의 애플리케이션을 사용할 수 있도록 하는 데 필요한 범위 내에서만 귀하의 사용자에게 부여된 추가 권리를 가집니다. 이러한 권리는 귀하의 계정 또는 본 서비스 약관이 종료되는 즉시 종료됩니다.\n\n5.7 본 약관에 명시적으로 규정된 경우를 제외하고 Shopee는 귀하의 애플리케이션 또는 귀하의 웹사이트에 대한 지적 재산권의 소유권을 취득하지 않습니다. 귀하는 귀하의 애플리케이션에 대한 모든 권리, 소유권 및 이익(모든 지적 재산권 포함)을 보유합니다.\n\n5.8 귀하는 플랫폼 및 도구와 관련하여 귀하가 개발한 모든 애플리케이션의 내용에 대해 전적으로 책임이 있으며 플랫폼을 통한 귀하의 전송 또는 통신 내용으로 인해 발생하거나 그 결과로 발생하는 모든 책임, 청구, 소송 및 비용에 대해 전적으로 책임이 있음을 인정하고 동의합니다.\n\n5.9 전술한 내용을 제한하지 않고 귀하는 플랫폼, API 서비스 또는 도구의 사용이 Stripe 지적 재산에 대한 소유권 또는 재산권을 귀하에게 양도하거나 부여하지 않음을 인정하고 동의합니다. 귀하는 Stripe와 그 라이선스 제공자 및 공급업체가 플랫폼 및 API 서비스에 대한 모든 권리를 소유하고 계속 소유할 것임을 인정합니다. 또한 귀하는 플랫폼, 도구, API 서비스 또는 기타와 관련하여 귀하가 Stripe에 제공한 모든 애플리케이션 또는 제안을 어떤 목적으로든 사용할 수 있는(사본을 만들고, 배포하고, 수정하고, 공개적으로 수행하고, 공개적으로 표시하고, 파생물을 만들 수 있는 권리 포함) 영구적이고, 취소 불가능하고, 전 세계적이고, 서브라이선스 가능하고, 로열티가 없고, 비독점적인 라이선스가 귀하에게 부여되었음을 인정하고 동의합니다.\n\n5.10 귀하는 귀하가 타인의 특허, 상표, 영업 비밀, 저작권 또는 기타 재산권(\"지적 재산권\")을 침해하는 애플리케이션 자료 또는 콘텐츠를 업로드, 게시, 이메일로 보내거나 다른 방식으로 전송하지 않을 것임을 진술하고 보증합니다.\n\n---\n\n---\n\n# 개발자 가이드\n\n## 6. SHOPEE 콘텐츠\n\n0페이지의 진실과 삽화 또는 사용자 생성 및 플랫폼을 통해 귀하에게 제공되는 Shopee 콘텐츠는 반드시 Shopee의 의견을 반영하는 것은 아니며 Shopee는 그러한 Shopee 콘텐츠 또는 플랫폼 상의 또는 플랫폼을 통한 기타 자료의 진실성, 정확성 및 신뢰성에 대해 어떠한 진술이나 보증도 하지 않습니다. 귀하는 플랫폼을 사용함으로써 사실적으로 부정확하거나 불쾌한 Shopee 콘텐츠에 노출될 수 있음을 이해하고 Shopee에 대해 가질 수 있는 법적 또는 형평법적 권리 또는 구제 수단을 포기하고 이에 따라 포기하는 데 동의합니다. Shopee 콘텐츠 또는 플랫폼 상의 또는 플랫폼을 통한 기타 자료의 적절성을 평가하고 결정한 후 사용, 구매 또는 다른 방식으로 의존하는 것이 좋습니다.\n\n다음 조항:\n\na) Shopee가 관련 Shopee 서비스(서비스 약관에 정의됨)에 등록된 해당 사용자의 계정(\"Shopee 계정\")에 대한 사용자 로그인을 귀하에게 공개하고 귀하가 Shopee 계정에 로그인하는 경우 해당 사용자에 속하거나 다른 방식으로 액세스할 수 있는 특정 Shopee 콘텐츠(\"사용자 Shopee 콘텐츠\")를 볼 수 있습니다. 해당 사용자의 Shopee 계정에 대한 사용자 로그인을 귀하에게 공개하기 전에 해당 사용자가 해당 Shopee 계정에 업로드하거나 다른 방식으로 제공한 정보 또는 자료와 관련 사용자 Shopee 콘텐츠의 정보 또는 자료는 Shopee 서비스 내에서 공개적으로 제공됩니다.\n\nb) Shopee 서비스 내에서 공개적으로 제공되는 Shopee 콘텐츠(Shopee 콘텐츠가 더 이상 공개적으로 제공되지 않는 경우에도 이전에 귀하에게 제공된 모든 자료 및 정보에 대해서는 효력이 유지됨).\n\nc) Shopee 계정 또는 해당 사용자에 특정한 특정(비공개 또는 공개적으로 사용 가능한) Shopee 콘텐츠에 대해 이해하거나 배우고 싶다면 developer@support.shopee.com으로 Shopee에 문의하십시오.\n\nd) Shopee는 어떤 이유로든 언제든지 Shopee 콘텐츠를 변경하거나 제거할 권리를 보유합니다.\n\ne) Shopee 콘텐츠에서 이익을 얻을 수 있는 방식으로 Shopee 콘텐츠를 사용하기 전에 Shopee의 사전 서면 동의를 구해야 합니다.\n\nf) Shopee는 단독 재량으로 언제든지 Shopee 콘텐츠를 제거할 수 있으며, 여기에는 다음 경우에 제거가 포함될 수 있습니다.\n(i) 스폰서 목록과 관련된 모든 프로그램에 대한 권리를 취하는 경우\n(ii) Shopee 서비스 사용에 대한 위반을 하는 경우\n(iii) Shopee 콘텐츠 또는 모든 콘텐츠를 사용하는 경우\nd) Shopee는 어떤 이유로든 언제든지 Shopee 콘텐츠를 변경하거나 제거할 권리를 보유합니다.\n\ne) 귀하는 Shopee 콘텐츠로부터 이익을 얻을 수 있는 방식으로 Shopee 콘텐츠를 사용하기 전에 Shopee의 사전 서면 동의를 구해야 합니다.\n\nf) Shopee는 단독 재량으로 언제든지 Shopee 콘텐츠를 제거할 수 있으며, 여기에는 다음 경우에 제거가 포함될 수 있습니다.\n(i) 스폰서 목록과 관련된 모든 프로그램에 대한 권리를 취하는 경우\n(ii) Shopee 서비스 사용에 대한 위반을 하는 경우\n(iii) Shopee의 사전 서면 동의 없이 Shopee 콘텐츠 또는 그 일부를 Shopee 서비스 (위치, 프로모션, 연구 등을 포함하되 이에 국한되지 않음)에서 사용하는 경우\n\ng) Shopee는 귀하가 제공한 정보를 카테고리로 분류할 권리를 보유합니다.\n\nh) 집계된 판매자 또는 구매자 데이터 (예: 개인 데이터).\n\ni) API 또는 애플리케이션의 목록에 표시된 정보 (예: Shopee 콘텐츠와 관련된 성능 데이터)를 Shopee의 사전 서면 동의 없이 생성하는 경우.\n\nj) 제3자 계열사를 통해 수행된 거래와 관련된 데이터를 집계합니다.\n\nk) 제3자로서 해당 서비스에서 사용할 수 있도록 생성할 때 해당 제3자의 권리, 디자인 권리 또는 상표를 포함한 모든 소유권을 침해하지 않습니다.\n\nl) 귀하는 Shopee가 수시로 규정할 수 있는 정보를 보유할 수 있습니다.\n\nm) 정보 또는 플랫폼 판매자 정보 또는 당사에서 사용하는 프로그램 (특정 사용자와 관련된 사용자 Shopee 계정을 식별하는 데 유용한 기타 정보)과 관련하여 위에 명시된 정보에 대한 설명을 표시할 수 있는 동안 Shopee 콘텐츠에 제공됩니다.\n\nn) 귀하는 개별 사용자 행동 및 활동을 추적하는 데 사용할 수 있으며, developer@support.shopee.com에서 Shopee의 사전 서면 동의 없이 Shopee 콘텐츠를 사용하여 귀하에게 제공되거나 액세스할 수 있는 Shopee 콘텐츠에 사용할 수 있습니다.\n\n## 7. 제한 사항 및 조건\n\n7.1 귀하는 로봇, 스파이더, 크롤러, 스크래퍼 또는 기타 자동화된 수단을 사용하여 Shopee 서비스, 도구, 귀하의 애플리케이션 또는 다른 당사자의 애플리케이션을 사용하거나 액세스 (또는 다른 사람이 사용하거나 액세스하도록 시도하거나 용이하게 함)할 수 없습니다.\n\n7.2 귀하는 플랫폼에 저장되고 표시되는 귀하의 콘텐츠 및 데이터에 대해 전적으로 책임을 집니다.\n\n7.3 귀하는 플랫폼, 도구 및 미래에 다음 조건이 적용됩니다.\n\na) 귀하는 프로그램 정책에 따라 항상 모든 다운로드 정보를 유지 관리하기로 선택합니다.\n\nb) 포괄적인 정보 섹션에서는 귀하가 (i) Shopee가 공개적으로 제공한 위치 또는 소스 이외의 위치 또는 소스에 액세스하기 위한 도구를 포함하여 Shopee 서비스에 액세스하는 방법, (ii) 본 약관에서 명시적으로 허용된 범위를 벗어나 Shopee 서비스를 사용하는 방법을 설명합니다. Shopee는 귀하의 애플리케이션 또는 플랫폼을 통한 전송과 관련하여 소유권 또는 지적 재산권을 취득하지 않습니다.\n\nc) 의심의 여지를 없애기 위해 Shopee 서비스에 가입하거나 제공하거나 Shopee 서비스 사용 시 Shopee는 본 약관에 따라 추가 조치를 취할 권리를 보유합니다.\n\nd) Shopee는 귀하의 애플리케이션 또는 전송 (\"자체 콘텐츠\")의 정보 또는 데이터의 부정확성, 오류 또는 누락에 대한 모든 보증 및 의무 또는 책임을 부인합니다. 또한 Shopee 서비스 이외의 다른 서비스의 성능에 대한 의존도와 관련된 Shopee 콘텐츠입니다.\n\ne) 애플리케이션 또는 전송에 오류가 없다는 보증 또는 조건은 암시되지 않습니다.\n\nf) Shopee 서비스를 통해 제공되는 Shopee 콘텐츠에는 제3자 웹사이트 또는 리소스에 대한 링크가 포함될 수 있습니다. 귀하는 Shopee가 해당 웹사이트 또는 리소스의 가용성 또는 정확성, 또는 해당 웹사이트 또는 리소스를 통해 직간접적으로 Shopee가 제공하는 콘텐츠, 광고, 제품 또는 기타 자료에 대해 책임을 지지 않음을 인정하고 이에 동의합니다.\n\ng) 모든 경우에 도구, 애플리케이션, 링크, 복사, 모델 또는 기타 방식으로 Shopee 콘텐츠, 다른 당사자의 애플리케이션에 대한 상업적 사용을 제공하는 경우 귀하는 귀하의 자체 콘텐츠 데이터, 다른 사용자 콘텐츠 또는 기타 콘텐츠를 어떤 방식으로든 제공할 수 없습니다.\n\nh) 당사는 개발자 커뮤니티가 데이터 관행에 대해 사용자에게 투명하게 공개할 것으로 기대합니다.\n\ni) 귀하는 본 서비스 약관에 제공된 것 이외의 다른 사용자의 개인 데이터에 액세스하거나 사용할 수 없습니다.\n\nj) (i) 개인 정보 보호, Shopee 서비스 사용을 위한 등록 프로세스인 콘텐츠에 저장된 정보에 대한 기본 공개 액세스를 초과하는 경우; (ii) 자동화된 방식으로; (iii) 본 서비스 약관에 명시적으로 제공된 목적 이외의 다른 목적으로 사용하는 경우.\n\nk) 귀하는 (i) 귀하가 정확하고 해당 데이터 또는 정보를 Shopee에 제공하는 데 필요한 모든 권리를 보유하고 있음을 진술하고 보증하지 않는 한 Shopee에 \"사용자 Shopee 데이터 또는 정보\"를 제공하거나 제공할 수 없으며, (ii) Shopee는 Shopee 서비스 또는 플랫폼, 도구 또는 Shopee 서비스에 연결된 다른 컴퓨터 시스템 또는 네트워크를 통해 해당 데이터 또는 정보를 사용하거나 처리할 때 해당 데이터 또는 정보를 Shopee 개인 정보 보호 정책의 적용을 받는 것처럼 취급합니다.\n\nl) 귀하의 애플리케이션 사용 시간 또는 기록에 관계없이 귀하는 Shopee가 귀하의 Shopee와의 모든 상호 작용을 귀하의 Shopee 계정과 자동으로 연결할 수 있음을 인정하고 이에 동의합니다.\n\nm) Shopee 서비스를 제공하거나 제공하기 위해 또는 어떤 경우에도 귀하는 어떤 상황에서도 (직접적으로든) Shopee 콘텐츠의 도구, API를 수정, 재구성, 리버스 엔지니어링하거나 추출하거나 상호 운용성을 위해 (콘텐츠, 기능, 사용자 인터페이스 또는 기타) 디컴파일하거나 공개적으로 복제하거나 해당 지적 재산권 법률에서 명시적으로 제공하는 경우를 제외하고 소스 코드 정보 또는 컴퓨터 프로그램에 포함된 정보에 액세스할 수 없습니다.\n\nn) 귀하는 Shopee가 플랫폼에 제공하거나 Shopee가 수시로 게시하는 Shopee (모든 배포) 및 마크의 요청을 의식적으로 표시해야 합니다.\n\no) 도구의 시간 또는 기록은 수시로 변경됩니다.\n\np) 귀하는 관련 플랫폼 약관에 명시적으로 설명된 방법 이외의 다른 방법을 사용하여 또는 사용자 (해당 구매 또는 서신이 귀하의 애플리케이션의 결과인지 여부에 관계없이)와 관련된 상품 또는 서비스의 판매 또는 구매를 초래하는 방식으로 플랫폼, 도구 또는 Shopee 서비스의 다른 부분에 액세스하거나 사용할 수 없습니다.\n\nq) 귀하는 수시로 관련 약관에 따라 적절하거나 독점적인지 확인하기 위해 필요한 모든 조치를 취해야 합니다.\n\nr) 귀하는 제3자의 지적 재산권을 침해하지 않아야 합니다.\n\ns) 귀하 또는 귀하의 직원이 데이터 보호 법률 또는 Shopee의 개인 정보 보호 정책을 잠재적으로 또는 실제로 위반하는 경우 (아래 제공됨). 약관에 설명된 대로 해당 \"개인 정보\"에는 플랫폼 사용자로부터 수집된 개인 정보 및 정보가 포함될 수 있습니다. 귀하는 귀하의 직원이 플랫폼의 적절한 기능 또는 개인 정보 보호 정책 및 서비스 약관을 방해하거나 플랫폼 또는 도구가 불법적인 방식으로 사용될 것이라고 Shopee가 단독 재량으로 또는 자발적으로 믿는 경우 문서 및 정보를 제공하고 귀하의 비즈니스를 지원하는 목적 이외의 다른 목적으로 플랫폼을 통해 사용자로부터 정보를 수집하지 않도록 합리적인 조치를 취해야 합니다. 귀하는 Shopee가 개인 정보 보호 및 데이터 보호를 심각하게 생각하며 귀하 또는 귀하의 직원의 부적절한 사용 (계정 개발, 위반, 처리 등)을 포함하되 이에 국한되지 않는다는 것을 인정합니다.\n\n## 8. 데이터 보호\n\n8.1 플랫폼 및 도구를 사용하는 데 있어 귀하는 Shopee의 개인 정보 보호 정책에 따라 처리되는 귀하의 개인 데이터 수집, 사용 및 공개에 동의합니다.\n\n8.2 Shopee 오픈 플랫폼 개발자 프로그램에 참여하고 도구를 사용하면 플랫폼을 통해 귀하의 애플리케이션 또는 전송을 사용하는 사용자로부터 개인 데이터 (\"개인 정보\")를 얻을 수 있습니다. 이와 관련하여 Shopee가 데이터 보호법과 일치하는 조건을 제공하더라도 Shopee는 귀하가 해당 요구 사항을 준수하지 못하는 것에 대해 책임을 지지 않습니다.\n\n8.3 Shopee가 귀하와 개인 정보를 공유하는 범위 내에서 귀하는 관련 데이터 보호 커미셔너 또는 싱가포르 또는 기타 관련 기관에서 발행한 지침 및 실행 규범을 포함하여 개인 데이터 또는 개인 정보 보호를 보호하고 처리하기 위해 합리적인 조치를 취하는 데 동의합니다.\n\n8.4 귀하는 귀하의 직원이 사용자를 수집하기 위해 개인 정보를 사용하지 않도록 합리적인 조치를 취해야 합니다. 개인 데이터 공개 또는 처리; 또는\n\n(i) 싱가포르 내외에 위치한 제3자에게 개인 데이터를 전송하거나 공개하는 행위;\n\n(ii) 해당 데이터가 수집된 목적에 필요한 기간 (해당 목적에만 해당)을 초과하여 해당 사용자의 명시적인 서면 동의 없이 개인 정보를 사용하거나 처리하는 행위; 또는\n\n(iii) 본 약관에 명시적으로 제공되지 않은 다른 목적으로 사용하는 행위. 관련 Shopee 사용자가 동의한 해당 사용자의 명시적인 서면 동의가 있는 경우를 제외하고 해당 Shopee 사용자에게 연락하거나 해당 개인 정보를 제3자에게 제공할 수 없습니다 (해당 목적이 완료된 후 해당 개인 정보는 삭제되어야 함).\n\n8.5 귀하는 귀하의 애플리케이션 또는 전송이 플랫폼 약관을 수락한 후 14일 이내에 다음 최소 제어 기능을 제공해야 합니다. 지정된 기간 내에 보라색 계정 준수 명세서의 정식 서명된 사본을 제공하지 못하면 Shopee는 해당 애플리케이션 또는 전송과 관련된 Shopee 플랫폼 개발자 프로그램에 따라 지원 및 Shopee 서비스에 대한 모든 액세스를 즉시 종료할 수 있습니다.\n\n## 9. 기밀 유지\n\n9.1 \"기밀 정보\"에는 도구, Shopee 콘텐츠, 개인 데이터, 귀하의 계정 (API 및 계열사에 따라 Shopee가 수신한 모든 정보), 귀하의 사용 또는 (귀하의 계정을 통해 플랫폼)과 관련된 제3자 및 Shopee가 귀하에게 기밀이 아니라고 알리는 모든 정보, 그리고 합리적인 사람이 기밀로 간주할 정보가 포함됩니다. Shopee 서비스가 제공됩니다. 귀하는 기밀 유지 위반을 알게 되거나 의심되는 즉시 또는 지정된 기밀 정보의 경우 영업 비밀을 구성하는 경우 당사에 알려야 합니다.\n\n9.2 귀하는 모든 기밀 정보를 기밀로 유지하고 플랫폼, 도구 및 Shopee의 서비스를 사용하는 목적으로만 독점적으로 해당 기밀 정보를 사용하며 Shopee의 사전 서면 승인 없이 기밀 정보를 다른 사람에게 공개하거나 제공하지 않을 것을 약속합니다.\n\n9.3 귀하는 직접 마케팅 목적으로 기밀 정보를 사용하거나 해당 기밀 정보에 대한 모든 사용자에게 마케팅 자료 또는 프로모션을 보내지 않습니다. Shopee 및 Shopee 서비스와 관련하여 Shopee가 귀하에게 공개하는 모든 정보는 이미 서비스 공개 지식에 있는 기밀 정보를 사용합니다. 그렇지 않으면 본 약관 또는 계열사의 불법 행위 위반의 결과로 발생합니다. 그리고/또는\n\n9.4 기밀 유지와 관련된 본 약관의 모든 조항은 본 약관의 종료 후에도 유효합니다. 전술의 일반성을 제한하지 않고 Shopee에 대한 정보를 공개, 게시 또는 다른 방식으로 전달하지 않으며 Shopee는 사용에 대한 책임이나 책임 없이 해당 정보를 사용할 수 있습니다.\n\n## 10. 수정 사항\n\n10.1 Shopee는 이유나 사전 통지 없이 수시로 귀하에 대한 책임을 지지 않고 플랫폼, 도구, Shopee 서비스, Shopee 콘텐츠 또는 플랫폼 및 도구의 다른 부분 또는 기능에 대한 사용 또는 액세스를 수정, 업그레이드, 일시 중단, 중단하거나 제한을 둘 수 있습니다. 귀하의 애플리케이션 또는 프로토콜에 영향을 줄 수 있는 해당 수정, 업그레이드 및 변경은 도구에 액세스하지 못할 수 있습니다. 수정 사항이 귀하의 애플리케이션에 영향을 미치는 경우 Shopee는 해당 수정 사항을 귀하에게 통지하기 위해 합리적인 노력을 기울여야 합니다. 이에 따라 귀하의 애플리케이션의 플랫폼 및 도구 사용을 방해하거나 간섭합니다 (\"수정\").\n\n10.2 Shopee는 플랫폼을 통해 도구에 대한 통지 또는 Shopee가 지정할 수 있는 다른 통지 방법 (특정 사용자 또는 모든 사용자에게 이메일 통지를 포함해야 함)을 통해 도구, 도구 또는 콘텐츠에 대한 업데이트가 사용자에게 영향을 미치는 경우 플랫폼 도구, Shopee 콘텐츠 또는 Shopee 서비스의 전부 또는 일부 제공.\n\n10.3 귀하는 Shopee가 (i) 플랫폼 또는 도구 사용 등록과 관련하여 언제든지 귀하에게 통신을 보내거나 통지할 수 있음을 인정합니다. 해당 날짜 이후에는 해당 변형을 수락한 것으로 간주됩니다. 변형을 수락하지 않으면 플랫폼 또는 도구 사용을 중단하고 Shopee에 즉시 수락하지 않음을 통지해야 합니다. Shopee에 통지하지 않으면 플랫폼 또는 도구에 대한 지속적인 액세스 또는 사용은 변경된 조건을 수락한 것으로 간주됩니다.\n\n## 11. 책임 및 책임의 제한\n\n11.1 플랫폼 및 도구는 \"있는 그대로\" 및 \"사용 가능한 대로\" 제공됩니다. 플랫폼 또는 도구의 작동 또는 플랫폼 또는 도구에 포함된 정보, 자료, 콘텐츠 또는 제품에 대한 명시적 또는 묵시적 진술 또는 보증은 제공되지 않습니다. Shopee는 제공된 플랫폼 또는 도구에 일반적으로 오류가 없음을 보증하거나 진술하지 않습니다. 전술한 내용에 따라 Shopee는 다음을 보증하지 않습니다.\n\na) 플랫폼 및 도구에 오류가 없거나 액세스가 중단되지 않고 적시에 이루어질 것입니다.\n\nb) 결함 또는 오류가 수정될 것입니다.\n\nc) 플랫폼 및 도구 또는 그 일부, 또는 이를 사용할 수 있도록 하는 서버, 컴퓨터, 장비 및 소프트웨어 구성에 오류가 없거나 식별된 결함이 수정될 것입니다.\n\n11.2 Shopee는 품질, 특정 목적에의 적합성 및 비침해와 관련된 묵시적 보증 및 거래 과정 또는 사용 또는 거래에서 발생하는 보증을 포함하되 이에 국한되지 않는 명시적, 묵시적, 법적 또는 기타 모든 보증을 부인합니다. 일부 관할 구역에서는 묵시적 보증의 부인을 허용하지 않으므로 플랫폼 또는 도구를 통해 귀하에게 또는 귀하가 전송한 보안 또는 정보와 관련하여 Shopee는 책임을 지지 않으며 귀하는 플랫폼 또는 도구를 통해 귀하가 사용할 수 있도록 제공하는 정보가 무단 제3자에 의해 가로채기, 수집, 사용 또는 변경될 수 있다는 위험을 감수하고 이로 인해 발생하는 모든 종류의 청구, 손실, 손해, 책임, 비용 및 지출로부터 Shopee를 면제합니다.\n\n11.3 귀하는 플랫폼 및 도구가 인터넷의 공개적인 특성 또는 기타 이유로 인해 통신, 오작동, 전송 지연, 트래픽 전송 실패 또는 잘못된 데이터 전송에 내재된 제한, 지연, 중단 및 기타 문제의 영향을 받을 수 있음을 인정합니다.\n\n11.4 Shopee는 귀하 또는 귀하의 사용자가 전송, 애플리케이션, 에이전트, 계약자 및 양수인 (\"Shopee 대리인\")으로 인해 또는 이와 관련하여 겪거나 발생하거나 유지하는 지연, 배송 실패 또는 손실, 손해, 책임, 비용 및 지출에 대해 책임을 지지 않습니다. (i) 플랫폼 또는 도구에 대한 액세스 또는 사용으로 인해 발생할 수 있는 직접적, 결과적, 특수적, 부수적 또는 간접적 손해, (ii) (a) 플랫폼 또는 도구를 통해 제공되는 Shopee 콘텐츠 또는 기타 자료의 정확성, 완전성, 상품성, 적합성 또는 가용성; (b) Shopee가 플랫폼 또는 도구에 적용할 수 있는 변경 사항 또는 플랫폼 또는 도구 제공의 영구적 또는 일시적 중단 (플랫폼 또는 도구 내의 기능); (c) 귀하의 데이터 또는 플랫폼 또는 도구 사용에 따라 포함되거나 보유된 정보에 대한 무단 액세스 또는 변경, 삭제 또는 공개; (d) 데이터의 손실 또는 제3자의 행위; 또는 (e) 플랫폼 또는 도구 사용과 관련된 모든 문제로 인해 발생할 수 있는 손실 또는 손해.\n\n# 서비스 약관\n\n## 11. 책임 제한\n\n11.1 귀하는 Shopee가 플랫폼 및 도구를 \"있는 그대로\" 및 \"사용 가능한 대로\" 제공하며 플랫폼 및 플랫폼을 통해 액세스하는 콘텐츠 또는 제3자 서비스에 대한 귀하의 사용 또는 의존은 귀하의 단독 위험 및 재량에 달려 있음에 동의합니다. Shopee는 상품성, 특정 목적에의 적합성, 소유권, 비침해 및 보안 및 정확성에 대한 묵시적 보증을 포함하되 이에 국한되지 않는 명시적이든 묵시적이든 모든 종류의 보증과 거래 사용, 거래 과정 또는 이행 과정에서 발생하는 모든 보증을 명시적으로 부인합니다.\n\n11.2 Shopee는 플랫폼 또는 도구가 귀하의 요구 사항을 충족하거나 항상 사용 가능하고 액세스 가능하며 중단되지 않고 적시에 안전하고 정확하며 완전하거나 오류가 없을 것이라고 진술하거나 보증하지 않습니다. Shopee는 결함이 수정되거나 플랫폼 또는 플랫폼을 사용할 수 있도록 하는 서버에 바이러스 또는 기타 유해한 구성 요소가 없음을 보증하지 않습니다. Shopee는 다음을 포함하되 이에 국한되지 않고 플랫폼 또는 도구에 대한 지속적이고 중단되지 않거나 안전한 액세스를 보장하지 않습니다.\n\n(a) 액세스\n(b) Shopee가 합리적인 예방 조치를 취했음에도 불구하고 플랫폼의 적절한 성능을 방해하는 예측 불가능한 상황. 이러한 상황에는 (화재, 폭발, 지진 및 홍수와 같은 천재지변), 정전, 인터넷 중단 또는 오류, 해킹 공격 및 플랫폼의 속도 저하나 지연을 유발하는 비정상적으로 높은 수준의 사용이 포함되지만 이에 국한되지는 않습니다.\n\n(c) 플랫폼에 저장되거나 플랫폼에서 전송된 데이터 또는 정보의 손상, 오류 또는 손실. Shopee는 내용 확인에 대한 책임을 지지 않습니다.\n\n(d) 시스템, 서버 또는 연결 오류, 오류, 누락, 중단, 전송 지연, 컴퓨터 바이러스 또는 기타 악성, 파괴적 또는 손상시키는 코드, 에이전트 프로그램 또는 매크로; 그리고\n\n(e) 플랫폼에 연결된 다른 웹사이트 또는 웹페이지에 대한 사용 또는 액세스 (그러한 책임의 가능성에 대해 조언을 받았거나 고려한 경우에도).\n\nopee는 귀하 또는 모든 사용자가 겪거나 발생하거나 지속하는 전송, 애플리케이션, 에이전트, 계약자 및 양수인(\"Shopee 담당자\")으로 인해 발생하거나 이와 관련하여 발생하는 지연, 배송 실패 또는 손실, 손해, 책임, 비용 및 경비에 대해 책임을 지지 않습니다. Shopee 담당자는 (i) 플랫폼 또는 도구에 대한 액세스 또는 사용으로 인해 발생하는 모든 직접적, 결과적, 특수적, 부수적 또는 간접적 손해에 대해 (ii) 귀하가 (a) Shopee 콘텐츠 또는 플랫폼 또는 도구를 통해 제공되는 기타 자료의 정확성, 완전성, 상품성, 적합성 또는 가용성; (b) Shopee가 플랫폼 또는 도구에 적용할 수 있는 변경 사항 또는 플랫폼 또는 도구(또는 플랫폼 또는 도구 내의 모든 기능) 제공의 영구적 또는 일시적 중단; (c) 귀하의 데이터 또는 플랫폼 또는 도구 사용에 따라 포함되거나 보유된 정보에 대한 무단 액세스 또는 변경, 삭제 또는 공개; (d) 데이터의 손실 또는 손해 또는 제3자의 행위; 또는 (e) 플랫폼 또는 도구 사용과 관련된 모든 문제로 인해 발생할 수 있는 손실 또는 손해에 대해 귀하에게 책임을 지지 않습니다.\n\n## 12. 면책\n\n12.1 해당 법률에서 허용하는 최대 한도 내에서 귀하는 다음을 포함하되 이에 국한되지 않고 귀하의 플랫폼 사용으로 인해 발생하거나 이와 관련된 모든 손실로부터 Shopee 면책 당사자를 면책하고 보호하는 데 동의합니다.\n\n(a) 귀하의 계정과 관련된 플랫폼 및 도구의 액세스 또는 사용;\n\n(b) 귀하의 애플리케이션;\n\n(c) 귀하의 사용자 자료;\n\n(d) 귀하의 플랫폼 약관 위반 또는 귀하의 실제 또는 주장된 제3자 권리 침해; 그리고\n\n(e) 귀하의 과실 또는 고의적인 행위.\n\nShopee는 귀하에게 손실에 대한 즉각적인 통지를 제공하지만, 그러한 통지를 제공하지 못하더라도 그러한 실패의 직접적인 결과로 발생하는 실질적인 편견의 범위 내에서만 귀하의 책임 또는 의무가 면제되지 않습니다.\n\n12.2 해당 법률에서 허용하는 최대 한도 내에서 귀하는 다음 사항에 동의합니다.\n\n(a) 제3자 법적 소송으로부터 Shopee를 방어하고 해당 제3자에게 최종적으로 수여된 손해 배상금을 Shopee에 지불하거나 다음의 결과로 Shopee가 합의한 합의금을 지불합니다. (i) 귀하의 애플리케이션 및/또는 사용자 자료가 제3자의 지적 재산권을 침해하는 경우; 또는 (ii) 귀하의 플랫폼 약관 위반으로 인해 발생하는 경우; 그리고\n\n(b) 제3자 법적 소송 방어에 완전히 협조합니다.\n\n12.3 전술한 내용에도 불구하고 Shopee는 자체 방어를 통제하고 자사의 이익을 보호하는 데 합리적으로 필요하다고 판단되는 조치를 취할 권리를 보유하며, 귀하는 그러한 조치 과정에서 합리적으로 발생한 모든 비용(법률 비용 및 합의금 포함)에 대해 Shopee를 완전히 면책해야 합니다.\n\n## 13. 하이퍼링크, 알림 및 광고\n\n13.1 귀하의 편의를 위해 Shopee는 제3자가 소유하거나 운영하는 인터넷상의 다른 웹사이트 또는 콘텐츠에 대한 하이퍼링크를 포함할 수 있습니다. 이러한 링크된 웹사이트 또는 콘텐츠는 Shopee의 통제하에 있지 않으며 Shopee는 콘텐츠에 포함된 오류, 누락, 지연, 명예 훼손, 중상 모략, 허위, 외설, 포르노, 불경건, 부정확성 또는 기타 불쾌한 자료 또는 링크된 웹사이트에 대한 액세스의 결과에 대해 책임을 지지 않습니다. 다른 웹사이트 또는 콘텐츠에 대한 하이퍼링크는 해당 웹사이트 또는 콘텐츠에 대한 보증 또는 확인이 아니며 귀하는 해당 링크된 웹사이트 또는 콘텐츠에 대한 액세스 또는 사용이 전적으로 귀하의 책임하에 있음에 동의합니다.\n\n13.2 Shopee는 Shopee 또는 특정 제3자의 제품 또는 서비스를 광고하기 위해 플랫폼에 배너, 자바 애플릿 및 기타 자료를 첨부할 수 있습니다. 의심의 여지를 없애기 위해 귀하는 그러한 광고 또는 기타 판촉 자료와 관련하여 지불, 수수료 또는 커미션을 받을 자격이 없습니다.\n\n## 14. 종료\n\n14.1 Shopee는 이유나 통지 없이, 그리고 책임 없이 수시로 (i) 귀하의 계정, 플랫폼, 도구 및 그 일부에 대한 액세스를 비활성화, 일시 중단 또는 종료하거나 (ii) 본 서비스 약관을 즉시 효력 발생으로 종료할 수 있습니다.\n\n14.2 어떤 이유로든 본 서비스 약관이 종료되면:\n\n(a) 귀하의 계정 및 본 약관에 따라 부여된 모든 라이선스는 즉시 자동으로 종료됩니다.\n\n(b) 귀하는 14일 이내에 귀하가 소유한 모든 Shopee 콘텐츠 및 개인 데이터의 사본을 삭제하거나 파기하고 요청 시 해당 삭제 또는 파괴에 대한 서면 증거를 Shopee에 제공해야 합니다. 그리고\n\n(c) 귀하는 귀하의 애플리케이션을 사용하는 Shopee 사용자가 불이익을 받지 않도록 질서 있는 전환을 위해 Shopee가 요청한 모든 합리적인 조치를 취해야 합니다.\n\n14.3 어떤 이유로든 본 서비스 약관이 종료되더라도 종료일 이전에 발생한 플랫폼 약관 위반을 포함한 위반과 관련하여 손해 배상을 청구할 권리를 포함하여 종료일까지 발생한 권리, 구제 수단, 의무 또는 책임에는 영향을 미치지 않습니다.\n\n## 15. 준거법 및 분쟁 해결\n\n15.1 본 서비스 약관은 싱가포르 법률에 따라 규율되고 해석됩니다. 본 서비스 약관에서 발생하거나 이와 관련된 모든 분쟁, 논쟁, 차이 또는 청구 (존재, 유효성, 해석, 이행, 위반 또는 종료 또는 그 무효의 결과 포함) 및 이와 관련된 모든 분쟁, 논쟁, 차이 또는 청구는 중재 신청서가 제출될 때 시행 중인 SIAC 관리 중재 규칙에 따라 싱가포르 국제 중재 센터(\"SIAC\")에서 관리하는 중재에 회부되어 최종적으로 해결됩니다. 중재지는 싱가포르입니다. 중재인의 수는 1명입니다. 중재 절차는 영어로 진행됩니다.\n\n## 16. 일반\n\n16.1 본 서비스 약관의 어떠한 내용도 귀하와 Shopee 간의 파트너십, 합작 투자 또는 본인-대리인 관계를 구성하지 않으며 Shopee를 대신하여 비용이나 책임을 발생시킬 권한을 부여하지 않습니다.\n\n16.2 Shopee가 언제든지 본 조항의 이행을 요구하지 못하더라도 서면으로 포기하지 않는 한 나중에 동일한 조항을 시행할 권리에 영향을 미치지 않습니다.\n\n16.3 본 서비스 약관은 귀하와 당사의 이익만을 위한 것이며 Shopee의 계열사 및 자회사(및 Shopee와 그 계열사 및 자회사의 각 후임자 및 양수인)를 제외하고 다른 개인 또는 법인의 이익을 위한 것이 아닙니다.\n\n16.4 어떤 이유로든 본 서비스 약관 및 본 서비스 약관에 포함되거나 언급된 모든 계약 및 정책의 조항(또는 조항의 일부)이 언제든지 어떤 범위에서든 유효하지 않거나 불법적이거나 시행 불가능하게 되는 경우 해당 조항은 해당 주제와 관련하여 당사자 간의 이전 계약 또는 이해를 대체하지 않습니다. 당사자는 또한 이로써 모든 묵시적 조건을 사실상 배제합니다. 본 서비스 약관에 의해 형성된 계약을 체결할 때 당사자는 본 서비스 약관에 명시적으로 명시된 것 외에 다른 사람의 진술, 표현, 보증, 이해, 약속 또는 보장에 의존하지 않았습니다. 각 당사자는 이 조항이 없었다면 가졌을 수 있는 전술한 내용과 관련된 모든 청구, 권리 및 구제 수단을 취소 불가능하고 무조건적으로 포기합니다. 본 서비스 약관은 이전 계약, 동시 구두 계약 또는 일관된 추가 조건의 증거에 의해 모순되거나 설명되거나 보충될 수 없습니다.\n\n16.5 귀하는 영국 뇌물 방지법, 미국 해외 부패 방지법 및 싱가포르 부패 방지법을 포함하되 이에 국한되지 않고 뇌물 방지 및 부패와 관련된 모든 해당 법률, 법규, 규정 및 코드를 준수하는 데 동의하며 이러한 요구 사항을 준수하는 데 필요한 모든 정책 및 절차를 마련했음을 확인합니다.\n\n16.6 본 서비스 약관 또는 본 서비스 약관 또는 사이트에서 제기된 문제에 대해 질문이나 우려 사항이 있는 경우 legal@support.shopee.sg로 문의하십시오.\n\n## 17. 법적 고지 (읽어주세요)\n\n법적 고지 (Shopee.com을 사용하기 전에 읽어주시고 \"법률 고문\"에게 전달하십시오)\n\n본인은 본 계약을 읽었으며 위에 포함된 모든 조항과 모든 개정 사항에 동의합니다.\n\n본인은 등록하는 동안 \"가입\" 또는 \"페이스북으로 연결\" 버튼을 클릭함으로써 디지털 서명을 생성하고 있으며, 이는 본인이 수동으로 서명한 것과 동일한 효력을 갖도록 의도하고 있음을 이해합니다.",
  "metadata": {
    "title": "Terms of Service",
    "summary": "This document outlines the Terms of Service for accessing and using Stripe's Products and API Services. It details the responsibilities of users, account management, and acceptable use of the platform, emphasizing compliance with legal and security standards.",
    "keywords": [
      "Terms of Service",
      "Stripe",
      "API Services",
      "Account",
      "Platform",
      "Users",
      "Legal Compliance",
      "Security"
    ],
    "category": "Legal",
    "tags": [
      "Terms of Use",
      "Agreement",
      "Legal",
      "Stripe Platform"
    ],
    "difficulty": "medium",
    "importance": 5,
    "use_cases": [
      "Understanding the legal agreement before using Stripe's services.",
      "Managing user accounts and ensuring security.",
      "Complying with API usage guidelines and restrictions.",
      "Developing applications that integrate with Stripe's API Services.",
      "Ensuring compliance with PCI Data Security Standard."
    ],
    "related_apis": [
      "API Services"
    ]
  },
  "vector": [
    -0.03234846144914627,
    0.0054320404306054115,
    -0.018269015476107597,
    -0.019082559272646904,
    -0.00918375514447689,
    -0.06765691190958023,
    0.0030721472576260567,
    0.001249274704605341,
    0.007610021624714136,
    0.04193795844912529,
    0.04444316029548645,
    0.03985298052430153,
    -0.023253774270415306,
    -0.0066603003069758415,
    0.0057997615076601505,
    0.01860029809176922,
    0.007658243179321289,
    -0.01882333494722843,
    0.008857501670718193,
    0.0030843964777886868,
    -0.0190084557980299,
    0.015005220659077168,
    -0.028420111164450645,
    0.03687020763754845,
    0.04775387793779373,
    0.035980913788080215,
    -0.006445531267672777,
    0.018809689208865166,
    0.015579400584101677,
    0.03951931744813919,
    -0.013692573644220829,
    -0.03451479971408844,
    -0.01313942950218916,
    -0.023959321901202202,
    -0.05502645671367645,
    -0.05531865358352661,
    -0.03891947492957115,
    -0.013070556335151196,
    -0.04389115050435066,
    0.007348496466875076,
    -0.026807090267539024,
    -0.017430955544114113,
    -0.0045803808607161045,
    0.007386946119368076,
    0.014592529274523258,
    -0.007468077354133129,
    0.009457380510866642,
    -0.019510705024003983,
    -0.04133866727352142,
    -0.012066156603395939,
    -0.0060919784009456635,
    0.02447598986327648,
    0.06118996813893318,
    -0.036483410745859146,
    -0.03649916499853134,
    0.039063673466444016,
    -0.0005300252232700586,
    0.002531402511522174,
    -0.05269916355609894,
    -0.00991174764931202,
    -0.053712617605924606,
    0.01275974977761507,
    0.006406615953892469,
    -0.008678089827299118,
    0.044601988047361374,
    -0.008147334679961205,
    -0.014805962331593037,
    -0.03928179666399956,
    -0.008853139355778694,
    -0.01163714099675417,
    -0.0004722947778645903,
    0.016465716063976288,
    -0.015222733840346336,
    0.013367577455937862,
    -0.09044359624385834,
    0.033705759793519974,
    0.007810292299836874,
    0.015319629572331905,
    -0.001066233846358955,
    -0.0045747458934783936,
    0.004423112608492374,
    -0.011764937080442905,
    0.01422998495399952,
    -0.02386273629963398,
    0.03397360071539879,
    -0.005061676260083914,
    -0.035072486847639084,
    0.028320111334323883,
    0.020469246432185173,
    0.050954677164554596,
    -0.0056759752333164215,
    -0.014176669530570507,
    0.041701674461364746,
    -0.009319134056568146,
    -0.04532349482178688,
    -0.014343892224133015,
    -0.02462099678814411,
    0.021695856004953384,
    0.03971943259239197,
    0.028816692531108856,
    0.000888196867890656,
    0.010903006419539452,
    0.013666794635355473,
    -0.021681368350982666,
    0.039509329944849014,
    0.01569366455078125,
    0.02533533237874508,
    0.005634410306811333,
    0.026509011164307594,
    -0.016841640695929527,
    -0.008431149646639824,
    -0.03292253986001015,
    -0.01138258632272482,
    -0.015199474059045315,
    0.0030924882739782333,
    -0.05168956145644188,
    0.030633796006441116,
    -0.02678207866847515,
    0.0036145600024610758,
    0.013068251311779022,
    0.006549251265823841,
    0.01871822029352188,
    -0.006947532761842012,
    -0.039127930998802185,
    -0.010294287465512753,
    0.020718663930892944,
    0.0001211380076711066,
    0.0476858913898468,
    0.0375707671046257,
    0.030320825055241585,
    0.04067206755280495,
    -0.0011029646266251802,
    -0.013177823275327682,
    0.0017386791296303272,
    -0.01996799372136593,
    0.03460835665464401,
    0.020863328129053116,
    0.03206072375178337,
    -0.013474772684276104,
    -0.055882565677165985,
    0.05315074324607849,
    -0.023583514615893364,
    -0.0070218658074736595,
    -0.01223781332373619,
    0.07665092498064041,
    -0.058239758014678955,
    0.03430500999093056,
    0.017303340137004852,
    -0.0416245274245739,
    -0.002371721202507615,
    0.029902901500463486,
    0.0010646804003044963,
    0.04039059951901436,
    -0.001713975565508008,
    0.019947657361626625,
    -0.03219986334443092,
    -0.04219653457403183,
    0.006444666534662247,
    0.027532527223229408,
    -0.027751794084906578,
    -0.013697189278900623,
    0.008542646653950214,
    -0.01521858386695385,
    0.028767216950654984,
    0.026687096804380417,
    -0.0066300989128649235,
    0.011435647495090961,
    0.023491041734814644,
    -0.020777177065610886,
    -0.015394437126815319,
    0.011821305379271507,
    0.0338250957429409,
    0.01863005757331848,
    -0.03953230008482933,
    -0.011939930729568005,
    0.029857397079467773,
    0.03372042626142502,
    0.0012537103611975908,
    -0.03555601090192795,
    -0.023826839402318,
    -0.03861766308546066,
    0.016186311841011047,
    -0.02788391523063183,
    -0.04227624461054802,
    -0.025748521089553833,
    0.009474835358560085,
    0.012031634338200092,
    -0.0012633014703169465,
    0.005910100415349007,
    0.02459036000072956,
    -0.05519413575530052,
    -0.03833473101258278,
    -0.001781257800757885,
    0.048822417855262756,
    -0.010067175142467022,
    -0.03934178501367569,
    0.0031852805987000465,
    -0.001598282135091722,
    0.04161921143531799,
    -0.009046917781233788,
    -0.035720255225896835,
    0.07110375910997391,
    0.03024766594171524,
    0.026399146765470505,
    -0.02687310241162777,
    -0.01781477965414524,
    0.0025040418840944767,
    0.040757566690444946,
    0.00530738290399313,
    -0.060633931308984756,
    -0.023319389671087265,
    -0.01610625721514225,
    -0.023392779752612114,
    0.01718246005475521,
    -0.04011320322751999,
    0.00740766478702426,
    -0.020527413114905357,
    0.021750357002019882,
    0.004373071249574423,
    0.008916705846786499,
    -0.003926635719835758,
    -0.02687922865152359,
    -0.013376935385167599,
    0.04184131696820259,
    -0.015459773130714893,
    -0.011795666068792343,
    0.03387105464935303,
    0.06608208268880844,
    0.02022029645740986,
    -0.013222293928265572,
    -0.018432511016726494,
    -0.0034769412595778704,
    0.014343726448714733,
    -0.01619677245616913,
    0.025175640359520912,
    -0.02768605202436447,
    -0.02748747356235981,
    -0.009469295851886272,
    0.04750292748212814,
    0.015660084784030914,
    -0.03761984780430794,
    -0.047684792429208755,
    0.0029332521371543407,
    -0.016766060143709183,
    -0.0314907468855381,
    -0.028428588062524796,
    0.008222706615924835,
    -0.008945235051214695,
    -0.017080647870898247,
    -0.045684486627578735,
    -0.008382667787373066,
    0.009185723029077053,
    -0.0027444367296993732,
    0.03814135491847992,
    -0.002063191495835781,
    -0.007996377535164356,
    0.017351534217596054,
    0.01619695872068405,
    0.0286840982735157,
    0.0078451968729496,
    -0.008043232373893261,
    -0.03835240751504898,
    0.011702240444719791,
    0.0002331604773644358,
    -0.00016195089847315103,
    -0.033530451357364655,
    -0.02432137355208397,
    -0.037847865372896194,
    -0.022684242576360703,
    0.011450886726379395,
    -0.0060047670267522335,
    -0.0014524111757054925,
    -0.01585927978157997,
    0.012644886039197445,
    0.019262198358774185,
    0.010728307068347931,
    0.005580722354352474,
    -0.02192857675254345,
    0.08345860987901688,
    0.005515155848115683,
    0.037878792732954025,
    0.02913758158683777,
    0.03795952722430229,
    0.02286473661661148,
    0.028551366180181503,
    -0.00076512829400599,
    -0.04524641111493111,
    -0.04889211803674698,
    0.031062286347150803,
    -0.06868184357881546,
    0.02999340556561947,
    0.02700626105070114,
    0.06264283508062363,
    0.004003515467047691,
    -0.03656790405511856,
    0.002899403451010585,
    -0.009387304075062275,
    -0.16483551263809204,
    -0.012644150294363499,
    0.013278725557029247,
    -0.00912451557815075,
    0.0037680945824831724,
    0.005422669928520918,
    -0.020620621740818024,
    -0.0036482003051787615,
    -0.051179565489292145,
    0.02178540825843811,
    -0.0009636949398554862,
    -0.05027635022997856,
    -0.05196196213364601,
    -0.00953593011945486,
    -0.031325630843639374,
    -0.019866319373250008,
    -0.008746415376663208,
    0.03869197145104408,
    -0.006261802744120359,
    -0.03694780170917511,
    -0.004753882065415382,
    0.007644867058843374,
    0.06929363310337067,
    -0.06487928330898285,
    -0.016741368919610977,
    -0.004965341184288263,
    0.028541583567857742,
    0.03917966037988663,
    -0.05572505667805672,
    0.005844774655997753,
    -0.0435914471745491,
    -0.0209482591599226,
    -0.0007631995249539614,
    0.03235936909914017,
    0.07174742221832275,
    0.004241005517542362,
    -0.004355178214609623,
    -0.047601088881492615,
    0.016460178419947624,
    -0.020165078341960907,
    0.011874556541442871,
    -0.02147286757826805,
    -0.00820142775774002,
    -0.03801153600215912,
    0.024822624400258064,
    -0.029364140704274178,
    0.019440464675426483,
    0.023533040657639503,
    -0.050602201372385025,
    0.015423999167978764,
    -0.0624169260263443,
    -0.04248430207371712,
    -0.05779307335615158,
    -0.01639154739677906,
    -0.05998966097831726,
    -0.0063008894212543964,
    0.02512178383767605,
    0.06710410118103027,
    0.0005943067953921854,
    -0.01616029255092144,
    0.0038389444816857576,
    0.00743159931153059,
    -0.029768088832497597,
    -0.04004138335585594,
    -0.0429084487259388,
    0.004357747733592987,
    0.005229728762060404,
    0.0005636275163851678,
    0.023189667612314224,
    -0.042630359530448914,
    0.03304152563214302,
    0.01412779651582241,
    -0.01751520484685898,
    0.0023477107752114534,
    -0.002508643316105008,
    -0.006349416449666023,
    0.048702627420425415,
    -0.05046716704964638,
    -0.02435499243438244,
    -0.07580863684415817,
    0.008265407755970955,
    0.03678175434470177,
    -0.039699986577034,
    0.009513076394796371,
    -0.01327376626431942,
    -0.024519136175513268,
    -0.019753580912947655,
    -0.02626633085310459,
    0.08048305660486221,
    0.21768750250339508,
    -0.020606324076652527,
    0.06025907024741173,
    0.00805625133216381,
    0.09746041148900986,
    -0.022654429078102112,
    0.00629457039758563,
    0.04274815693497658,
    -0.010628297924995422,
    -0.02934609353542328,
    0.024265876039862633,
    -0.031261276453733444,
    0.007126514334231615,
    -0.024049073457717896,
    -0.011243367567658424,
    0.02266746573150158,
    -0.011153637431561947,
    -0.010539752431213856,
    0.03856945037841797,
    0.03653772920370102,
    0.030771804973483086,
    0.02057238109409809,
    0.021891791373491287,
    0.00948240514844656,
    -0.047645505517721176,
    0.009623631834983826,
    -0.032252565026283264,
    0.0018106169300153852,
    -0.024111654609441757,
    0.027780458331108093,
    -0.0217893086373806,
    -0.03497111797332764,
    0.033356547355651855,
    -0.04528263956308365,
    0.015880819410085678,
    -0.03776431456208229,
    0.02514634281396866,
    -0.03349606692790985,
    -0.037003982812166214,
    0.07704512774944305,
    0.022311203181743622,
    -0.018099522218108177,
    0.048607971519231796,
    -0.012405456975102425,
    -0.006149774417281151,
    -0.025634678080677986,
    -0.01769694685935974,
    0.006729333195835352,
    -0.029320349916815758,
    0.0012053207028657198,
    0.02661246992647648,
    -0.03606249392032623,
    0.009986622259020805,
    0.010116132907569408,
    -0.0216901246458292,
    -0.06357770413160324,
    -0.015388009138405323,
    -0.03661990165710449,
    -0.060509566217660904,
    0.023091869428753853,
    0.014656861312687397,
    0.000909445050638169,
    -0.020758120343089104,
    0.03051680326461792,
    -0.027946854010224342,
    0.0012396116508170962,
    0.024708399549126625,
    -0.039679303765296936,
    0.007525397464632988,
    -0.008874857798218727,
    -0.041533198207616806,
    0.011510573327541351,
    0.012387456372380257,
    -0.00751481531187892,
    0.0357244610786438,
    -0.00560047198086977,
    0.00022933451691642404,
    0.030920201912522316,
    0.0006131288246251643,
    0.016581928357481956,
    -0.04537198320031166,
    0.006394381169229746,
    -0.04148528352379799,
    0.02105552703142166,
    0.02348191663622856,
    -0.05129198357462883,
    0.010918415151536465,
    0.0880868211388588,
    0.021951043978333473,
    -0.009241691790521145,
    -0.007356679532676935,
    0.01327976118773222,
    0.03168192878365517,
    0.038290832191705704,
    0.01718868501484394,
    -0.013186155818402767,
    0.027795633301138878,
    0.025078099220991135,
    -0.03442960977554321,
    -0.012949277646839619,
    -0.0339604914188385,
    -0.0019744373857975006,
    -0.0012223448138684034,
    -0.0466574989259243,
    0.03088327869772911,
    -0.034518953412771225,
    0.027706533670425415,
    0.01537504605948925,
    0.00451583182439208,
    0.016239631921052933,
    -0.012999720871448517,
    -0.009037715382874012,
    0.020871473476290703,
    -0.026186633855104446,
    -0.007373760920017958,
    0.04234893620014191,
    0.03155077248811722,
    0.026927929371595383,
    0.06606390327215195,
    -0.006579311564564705,
    -0.016083436086773872,
    -0.010505211539566517,
    0.03399801254272461,
    0.02059788815677166,
    0.010370807722210884,
    -0.053791750222444534,
    -0.009298930875957012,
    -0.01950223185122013,
    0.009523720480501652,
    -0.00039987132186070085,
    0.013515413738787174,
    -0.042893700301647186,
    0.07047127932310104,
    0.025439627468585968,
    -0.000699886935763061,
    -0.006375100463628769,
    0.032272256910800934,
    0.021696368232369423,
    0.01734142005443573,
    -0.021303590387105942,
    0.02659268118441105,
    -0.08182216435670853,
    -0.0031429354567080736,
    -0.020321281626820564,
    0.018796490505337715,
    0.03792250528931618,
    0.043758101761341095,
    -0.008213961496949196,
    -0.022786060348153114,
    0.024948207661509514,
    -0.016684599220752716,
    0.05325702577829361,
    0.01610865816473961,
    -0.06546830385923386,
    -0.051846910268068314,
    -0.031514234840869904,
    0.022164303809404373,
    0.007820391096174717,
    0.02823745086789131,
    0.006082672160118818,
    -0.023704856634140015,
    0.0024085910990834236,
    -0.003186378860846162,
    0.049785345792770386,
    0.06042720004916191,
    0.027872921898961067,
    0.01242008525878191,
    0.029062112793326378,
    -0.0357847735285759,
    -0.012323517352342606,
    0.02085147053003311,
    -0.03537612035870552,
    -0.04656921327114105,
    0.0172192994505167,
    0.01619807817041874,
    -0.006830486468970776,
    -0.01664680428802967,
    0.019287576898932457,
    0.02842366322875023,
    -0.05605287849903107,
    -0.014338331297039986,
    -0.03763078898191452,
    -0.00878114253282547,
    -0.02885698899626732,
    -0.02765521965920925,
    -0.005480534862726927,
    0.05501803010702133,
    -0.012066878378391266,
    0.013148744590580463,
    -0.012999658472836018,
    -0.043371137231588364,
    0.0638999342918396,
    -0.06888000667095184,
    -0.016990095376968384,
    0.023495130240917206,
    -0.039662040770053864,
    0.024038849398493767,
    0.031114960089325905,
    -0.026317937299609184,
    -0.0063774799928069115,
    0.03206627815961838,
    0.038101326674222946,
    -0.0002422444085823372,
    -0.03203129768371582,
    -0.03382231295108795,
    0.006877055391669273,
    0.004566369112581015,
    0.05487445369362831,
    -0.05069590359926224,
    0.09738010913133621,
    0.028063738718628883,
    0.00408175028860569,
    -0.0554116927087307,
    0.005859593395143747,
    -0.010849174112081528,
    -0.040851790457963943,
    0.060839105397462845,
    0.04457515850663185,
    0.0003137328021693975,
    -0.014132975600659847,
    -0.0826905369758606,
    0.0011786692775785923,
    0.062485676258802414,
    -0.03251947462558746,
    0.050503917038440704,
    0.04653353616595268,
    0.030881159007549286,
    0.008474437519907951,
    -0.005949304439127445,
    -0.01127530075609684,
    -0.005128504242748022,
    0.032463736832141876,
    0.08437307924032211,
    -0.010102515108883381,
    0.010881545953452587,
    -0.03191518783569336,
    0.007539062295109034,
    0.0024139578454196453,
    -0.021626174449920654,
    -0.002126225270330906,
    0.04130122810602188,
    -0.040012892335653305,
    0.009672600775957108,
    0.019016239792108536,
    -0.03570061922073364,
    0.04350964352488518,
    -0.005626673810184002,
    -0.011997892521321774,
    0.07580609619617462,
    0.034822989255189896,
    -0.015029506757855415,
    0.0021488366182893515,
    0.029834480956196785,
    -0.013325213454663754,
    -0.008170470595359802,
    0.018988272175192833,
    0.016748711466789246,
    0.007088391110301018,
    -0.06450647115707397,
    -0.02972530946135521,
    -0.006932236719876528,
    0.05144457519054413,
    0.01393468864262104,
    0.013364797458052635,
    -0.007801577914506197,
    -0.01131062675267458,
    0.008057903498411179,
    -0.03882163390517235,
    -0.02530849725008011,
    -0.0010992699535563588,
    0.01998038962483406,
    -0.0011603375896811485,
    -0.024027906358242035,
    0.007021352648735046,
    0.018935086205601692,
    0.0029427562840282917,
    -0.02868683636188507,
    0.019884154200553894,
    -0.009537243284285069,
    0.03501198813319206,
    -0.021827179938554764,
    -0.008690154179930687,
    0.0011208391515538096,
    -0.048402462154626846,
    -0.006633189506828785,
    0.016689147800207138,
    -0.058696530759334564,
    0.0045372722670435905,
    -0.016348332166671753,
    -0.03347919136285782,
    0.02444784715771675,
    -0.019598836079239845,
    -0.059988852590322495,
    0.034303080290555954,
    -0.01757008582353592,
    0.0010053464211523533,
    -0.02396147884428501,
    -0.025640619918704033,
    -0.030199503526091576,
    -0.004625228699296713,
    -0.03610973805189133,
    0.008847527205944061,
    -0.009297342039644718,
    -0.0434555746614933,
    -0.021851563826203346,
    0.025289403274655342,
    -0.03383978083729744,
    -0.055946141481399536,
    0.006572741083800793,
    0.044559065252542496,
    -0.0024234335869550705,
    -0.017255160957574844,
    -0.022468989714980125,
    0.03774002194404602,
    0.053190674632787704,
    -0.00879533402621746,
    0.08928867429494858,
    -0.007209409959614277,
    0.02788335643708706,
    -0.02838839776813984,
    0.030523475259542465,
    0.008388626389205456,
    -0.033751316368579865,
    -6.69448563712649e-05,
    -0.04845047742128372,
    0.000903927197214216,
    0.009140873327851295,
    -0.0006600490887649357,
    -0.014882514253258705,
    0.006205322686582804,
    -0.03945419192314148,
    -0.001374954590573907,
    -0.011996567249298096,
    -0.02693181112408638,
    0.026415612548589706,
    0.029174769297242165,
    0.00551601592451334,
    -0.052022967487573624,
    0.032627541571855545,
    -0.02408558875322342,
    0.019997822120785713,
    -0.018552957102656364,
    0.048577796667814255,
    -0.011681909672915936,
    -0.019273696467280388,
    -0.04224124550819397,
    0.029325352981686592,
    0.0251403097063303,
    -0.07142060250043869,
    -0.0001397692394675687,
    -0.002169231651350856,
    -0.012507535517215729,
    0.016068769618868828,
    -0.03882134333252907,
    0.072015181183815,
    0.0017955844523385167,
    -0.012889282777905464,
    0.03055807575583458,
    -0.010658365674316883,
    0.02002125419676304,
    -0.03660406917333603,
    0.022747864946722984,
    0.018508614972233772,
    0.04270365834236145,
    0.01584206335246563,
    0.007609272841364145,
    0.00887560099363327,
    -0.036736324429512024,
    0.025926271453499794,
    0.0038686159532517195,
    0.042971618473529816,
    0.006445176899433136,
    0.008483954705297947,
    0.009080726653337479,
    -0.002415634226053953,
    0.00033983963658101857,
    -0.0011492796475067735,
    -0.005435316823422909,
    0.045817162841558456,
    0.006270460784435272,
    -0.033722955733537674,
    0.000917525147087872,
    -0.0410497672855854,
    -0.03162572905421257,
    0.01882840506732464,
    -0.02628808654844761,
    -0.01983964629471302,
    0.014061914756894112,
    -0.014199311845004559,
    0.02670890837907791,
    -0.03618815913796425,
    -0.003405795432627201,
    -0.024285096675157547,
    -0.00048274456639774144,
    -0.14002305269241333,
    0.04635337367653847,
    0.00874348171055317,
    -0.004073307383805513,
    -0.035113342106342316,
    -0.0036458922550082207,
    0.0007903609075583518,
    -0.027089262381196022,
    0.042631596326828,
    -0.0322931744158268,
    -0.029811270534992218,
    -0.030546169728040695,
    -0.00292961485683918,
    -0.03452635183930397,
    0.039241448044776917,
    0.019228344783186913,
    0.0003619152994360775,
    0.003618950955569744,
    -0.02197330817580223,
    0.005176908802241087,
    0.006017961539328098,
    0.00161935284268111,
    0.041016921401023865,
    0.014675944112241268,
    -0.004874018952250481,
    0.003890385851264,
    0.040514230728149414,
    0.03877624496817589,
    -0.021340645849704742,
    -0.04397116228938103,
    0.008030482567846775,
    -0.0023138797841966152,
    0.009729147888720036,
    0.014998420141637325,
    0.001291049411520362,
    0.04271237552165985,
    0.013690631836652756,
    -0.00198003719560802,
    -0.03388611227273941,
    0.038142070174217224,
    0.007025294937193394,
    0.018895234912633896,
    -0.030834995210170746,
    0.0020543131977319717,
    -0.016768869012594223,
    0.019737791270017624,
    -0.05656657740473747,
    -0.02171054482460022,
    -0.017217807471752167,
    -0.004282501991838217,
    0.003270064713433385,
    -0.037574879825115204,
    -0.033516138792037964,
    0.021791335195302963,
    -0.009583177044987679,
    -0.014500771649181843,
    -0.04136042296886444,
    -0.002185164950788021,
    -0.02321719191968441,
    0.024576948955655098,
    0.01131786871701479,
    0.055040642619132996,
    -0.044271256774663925,
    -0.018281223252415657,
    0.06993460655212402,
    0.012481852434575558,
    -0.06899716705083847,
    0.030221404507756233,
    0.05260384455323219,
    0.017592402175068855,
    -0.011055397801101208,
    -0.019394313916563988,
    -0.02453167922794819,
    -0.014707968570291996,
    -0.0014276927104219794,
    -0.01907888427376747,
    0.035849083214998245,
    0.054621145129203796,
    -0.05167357623577118,
    -0.013741591013967991,
    -0.01266018021851778,
    -0.01988431252539158,
    -0.061877261847257614,
    0.03613626956939697,
    0.0832245871424675,
    0.04744047299027443,
    -0.022961420938372612,
    -0.00480947969481349,
    0.022728363052010536,
    0.010289965197443962,
    -0.050419796258211136,
    -0.010797188617289066,
    0.01826607622206211,
    0.06288322061300278,
    -0.02017994597554207,
    0.01707032136619091,
    -0.010614903643727303,
    0.01889616996049881,
    0.02905099466443062,
    -0.014562656171619892,
    -0.029144559055566788,
    -0.03651750087738037,
    0.01356465369462967,
    -0.002298954641446471,
    -0.005627976730465889,
    0.01220263447612524,
    -0.010012009181082249,
    -0.02575533837080002,
    0.015645766630768776,
    -0.0317489318549633,
    -0.006984073203057051,
    -0.009079799056053162,
    -0.031610433012247086,
    -0.0030873373616486788,
    -0.08048680424690247,
    -0.01971769705414772,
    -0.06850431114435196,
    0.030785243958234787,
    -0.04806182533502579,
    -0.008774828165769577,
    0.007989475503563881,
    -0.002196204848587513,
    -0.01651023142039776,
    -0.03315003961324692,
    0.012263569049537182,
    0.03442419692873955,
    0.027815941721200943,
    0.011854371055960655,
    0.07135666906833649,
    0.00821891613304615,
    0.001502188853919506,
    -0.0045631700195372105,
    0.0013859396567568183,
    0.01553326565772295,
    0.015608759596943855,
    -0.029003623872995377,
    0.031090816482901573,
    0.045355282723903656,
    0.0013379865558817983,
    0.0028927242383360863,
    0.008832604624330997,
    -0.0007386848446913064,
    0.014738135039806366,
    -0.030842801555991173,
    -0.018157439306378365,
    -0.02078837715089321,
    -0.010053328238427639,
    0.02395707368850708,
    0.008815130218863487,
    -0.00038497813511639833,
    0.021064581349492073,
    -0.006079703103750944,
    0.0017964045982807875,
    0.010788841173052788,
    -0.012466593645513058,
    0.029514648020267487,
    -0.0492180772125721,
    0.0075743915513157845,
    -0.02941380999982357,
    0.06419947743415833,
    0.00206655147485435,
    -0.057694707065820694,
    -0.027553651481866837,
    -0.0603981614112854,
    0.02578265406191349,
    0.00036785812699235976,
    -0.015382178127765656,
    -0.031666990369558334,
    0.009435586631298065,
    -0.0037462704349309206,
    -0.028371697291731834,
    -0.009364988654851913,
    -0.02936098352074623,
    0.055258575826883316,
    0.03180161491036415,
    0.037087053060531616,
    -0.0026719847228378057,
    -0.015979016199707985,
    0.037239059805870056,
    -0.029606325551867485,
    0.030476039275527,
    0.03583061695098877,
    0.01307483296841383,
    0.02154855988919735,
    -0.0008588104392401874,
    0.01616673171520233,
    0.0071139829233288765,
    -0.030685611069202423,
    -0.0014311393024399877,
    0.025561818853020668,
    -0.00788085162639618,
    0.007091499865055084,
    -0.00919287372380495,
    0.00669985031709075,
    0.02634509466588497,
    -0.025076577439904213,
    -0.027800576761364937,
    0.0261391568928957,
    0.013554759323596954,
    0.02883269265294075,
    0.059978727251291275,
    -0.04331055283546448,
    0.003640934359282255,
    -0.014584052376449108,
    -0.04522479325532913,
    0.0035433450248092413,
    -0.007220234256237745,
    -0.022326651960611343,
    -0.010983933694660664,
    0.0580274797976017,
    0.01056948397308588,
    -0.00524186622351408,
    0.03221391513943672,
    0.03189826011657715,
    0.015740860253572464,
    0.0042426795698702335,
    -0.026987142860889435,
    0.036546964198350906,
    -0.03567615896463394,
    0.014841065742075443,
    -0.015000482089817524,
    0.005579211749136448,
    -0.00424172030761838,
    -0.0008255400462076068,
    -0.017843278124928474,
    -0.015302186831831932,
    0.01770673133432865,
    -0.0007837931043468416,
    -0.02405264973640442,
    -0.011365811340510845,
    -0.02093116007745266,
    -0.008203348144888878,
    -0.033214177936315536,
    0.014732547104358673,
    0.046622198075056076,
    -0.010999538004398346,
    0.009908038191497326,
    0.021121440455317497,
    -0.007298181764781475,
    -0.032298602163791656,
    0.032202064990997314,
    -0.052330419421195984,
    0.012360303662717342,
    0.022556966170668602
  ],
  "vector_dimension": 1024,
  "model_name": "BAAI/bge-m3",
  "vectorized_at": "2025-10-16T15:01:10.778860"
}